
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСпискиТипов();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЗДокументы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЗСправочники

&НаКлиенте
Процедура ТЗСправочникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Элемент.ТекущиеДанные.Имя);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСпискиТипов()
	
	ТЗСправочники.Очистить();
	
	
		Для каждого элТип из Метаданные.ОпределяемыеТипы.SQLТипыПараметров.Тип.Типы() Цикл
			обМетаданных = Метаданные.НайтиПоТипу(элТип);
			
			Если обМетаданных <> Неопределено Тогда
				
				Если Метаданные.Справочники.Содержит(обМетаданных) Тогда
					ЗаполнитьЗначенияСвойств(ТЗСправочники.Добавить(), обМетаданных, "Имя, Синоним");
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла; 
		
	ТЗСправочники.Сортировать("Синоним");

	
КонецПроцедуры

#КонецОбласти
