

Функция ПолучитьТаблицуДанных(ПериодОтчета)
	
	Запрос = Новый Запрос;
	запрос.УстановитьПараметр("ДатаНачала",ПериодОтчета.ДатаНачала);
	запрос.УстановитьПараметр("ДатаОкончания",ПериодОтчета.ДатаОкончания);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	dwh_1_jira_logged_by.name КАК ЛогинПользователя,
		|	dwh_1_jira_issues_measures_wl._source_id КАК Задача,
		|	dwh_1_jira_issues_measures_wl.hours_spent КАК ЧасовПотрачено,
		|	ПОДСТРОКА(dwh_1_jira_worklogs.comment, 1, 250) КАК Комментарий,
		|	dwh_1_jira_worklogs.started_at КАК ДатаЗаписи,
		|	dwh_1_jira_issues.project_name КАК Проект,
		|	dwh_1_jira_statuses.name КАК Статус,
		|	dwh_1_jira_issues.issue_summary КАК Содержание,
		|	dwh_1_jira_issues.created_at КАК ДатаСоздания,
		|	dwh_1_jira_issues.closed_at КАК ДатаРешения,
		|	dwh_1_jira_issues.assignee_name КАК Правовриемник,
		|	0 КАК Количество,
		|	0 КАК ПлановоеВремя
		|ИЗ
		|	ВнешнийИсточникДанных.кст_Jira_sql.Таблица.dwh_1_jira_issues_measures_wl КАК dwh_1_jira_issues_measures_wl
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.кст_Jira_sql.Таблица.dwh_1_jira_logged_by КАК dwh_1_jira_logged_by
		|		ПО dwh_1_jira_issues_measures_wl.logged_by_id = dwh_1_jira_logged_by.id
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.кст_Jira_sql.Таблица.dwh_1_jira_worklogs КАК dwh_1_jira_worklogs
		|		ПО dwh_1_jira_issues_measures_wl.worklog_id = dwh_1_jira_worklogs.id
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.кст_Jira_sql.Таблица.dwh_1_jira_issues КАК dwh_1_jira_issues
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.кст_Jira_sql.Таблица.dwh_1_jira_statuses КАК dwh_1_jira_statuses
		|			ПО dwh_1_jira_issues.status_id = dwh_1_jira_statuses.id
		|		ПО dwh_1_jira_issues_measures_wl._source_id = dwh_1_jira_issues.issue_key
		|ГДЕ
		|	(dwh_1_jira_worklogs.started_at МЕЖДУ &ДатаНачала И &ДатаОкончания
		|			ИЛИ dwh_1_jira_issues.closed_at МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|
		|СГРУППИРОВАТЬ ПО
		|	dwh_1_jira_logged_by.id,
		|	dwh_1_jira_logged_by.name,
		|	dwh_1_jira_issues_measures_wl._source_id,
		|	dwh_1_jira_issues_measures_wl.hours_spent,
		|	ПОДСТРОКА(dwh_1_jira_worklogs.comment, 1, 250),
		|	dwh_1_jira_issues.project_name,
		|	dwh_1_jira_issues.issue_summary,
		|	dwh_1_jira_issues.created_at,
		|	dwh_1_jira_issues.closed_at,
		|	dwh_1_jira_issues.assignee_name,
		|	dwh_1_jira_worklogs.started_at,
		|	dwh_1_jira_statuses.name";
	
	
	ТаблицаЗадач =  Запрос.Выполнить().Выгрузить();  
	
	//Дополним плановым временем
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТабПлановогоВремени._source_id КАК Задача,
		|	ТабПлановогоВремени.original_estimated_hours КАК ПлановыеЧасы
		|ИЗ
		|	ВнешнийИсточникДанных.кст_Jira_sql.Таблица.dwh_1_jira_issues_measures КАК ТабПлановогоВремени
		|ГДЕ
		|	НЕ ТабПлановогоВремени.original_estimated_hours ЕСТЬ NULL";
	
	ТаблицаПланВремени = Запрос.Выполнить().Выгрузить();  
	ТаблицаПланВремени.Индексы.Добавить("Задача"); 
	
	МассивЗадач = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаЗадач.ВыгрузитьКолонку("Задача"));
	
	СтруктураОтбора = Новый Структура("Задача");
	Для каждого ТекЭлемента из МассивЗадач Цикл
		СтруктураОтбора.Задача = ТекЭлемента;	
		
		МассивПлановогоВремени = ТаблицаПланВремени.НайтиСтроки(СтруктураОтбора);
		МассивЗадач = ТаблицаЗадач.НайтиСтроки(СтруктураОтбора);
		
		Если МассивЗадач.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;		

		Если МассивПлановогоВремени.Количество()=0 Тогда
			МассивЗадач[0].Количество = 1;							
			
		Иначе			
			ПВ = МассивПлановогоВремени[0].ПлановыеЧасы;		
			
			Если МассивЗадач.Количество()>0 Тогда
				МассивЗадач[0].ПлановоеВремя = ПВ;	
				МассивЗадач[0].Количество = 1;				
			КонецЕсли;			
			
		КонецЕсли;

		
	КонецЦикла;
	
	Возврат ТаблицаЗадач;
	
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка 		= Ложь;	
	
	мПериодОтчета = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Значение;
	
	
	РезультатЗапроса			= ПолучитьТаблицуДанных(мПериодОтчета);		
	ВнешниеНаборыДанных 		= Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных",РезультатЗапроса);
	
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных,ДанныеРасшифровки);
	
	//Результат.Очистить();	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	 
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	
КонецПроцедуры
