&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяИнформационнойБазы     = Параметры.ИмяИнформационнойБазы;
	ИмяСервера                = Параметры.ИмяСервера;
	КаталогИнформационнойБазы = Параметры.КаталогИнформационнойБазы;
	АутентификацияОС          = Параметры.АутентификацияОС;
	Пользователь              = Параметры.Пользователь;
	Пароль                    = РасшифроватьBase64(Параметры.Пароль);
	ВариантЗапуска            = Параметры.ВариантЗапуска;
	Если ВариантЗапуска = 0 Тогда
		ВариантЗапуска = 1;
	КонецЕсли;
	ИмяБазыИзСписка           = Параметры.ИмяБазыИзСписка;
	СтрокаСоединения          = Параметры.СтрокаСоединения;
	
	Элементы.ИмяБазыИзСписка.СписокВыбора.Добавить("Первый", "Первый");
	Элементы.ИмяБазыИзСписка.СписокВыбора.Добавить("Второй", "Второй");
	
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Структура = Новый Структура();
	Структура.Вставить("ИмяИнформационнойБазы", СокрЛП(ИмяИнформационнойБазы));
	Структура.Вставить("ИмяСервера", СокрЛП(ИмяСервера));
	Структура.Вставить("КаталогИнформационнойБазы", СокрЛП(КаталогИнформационнойБазы));
	Структура.Вставить("Пользователь", СокрЛП(Пользователь));
	Структура.Вставить("Пароль", ЗашифроватьBase64(Пароль));
	Структура.Вставить("АутентификацияОС", АутентификацияОС);
	Структура.Вставить("ВариантЗапуска", ВариантЗапуска);
	Структура.Вставить("ИмяБазыИзСписка", ИмяБазыИзСписка);
	Структура.Вставить("СтрокаСоединения", СтрокаСоединения);
	
	
	Закрыть(Структура);
	
КонецПроцедуры

&НаСервере
Функция ЗашифроватьBase64(Строка) Экспорт
    
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
    ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, , КодировкаТекста.UTF8);
    ЗаписьТекста.Записать(Строка);
    ЗаписьТекста.Закрыть();

    Двоичные = Новый ДвоичныеДанные(ИмяВременногоФайла);
    Результат = Base64Строка(Двоичные);
    Результат = СтрЗаменить(Результат, "77u/", "");
    Результат = СтрЗаменить(Результат, Символы.ПС, "");
    
    УдалитьФайлы(ИмяВременногоФайла);
	
	//Поток = Новый ПотокВПамяти;
	//ЗаписьТекста = Новый ЗаписьТекста(Поток);
	
    
    Возврат Результат;
    
КонецФункции

&НаСервере
Функция РасшифроватьBase64(Строка) Экспорт
	
	Двоичные = Base64Значение(Строка);
	
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	Поток = Двоичные.ОткрытьПотокДляЧтения();
	
	//Двоичные.Записать(ИмяВременногоФайла);
	
	ЧтениеТекста = Новый ЧтениеТекста(Поток, КодировкаТекста.UTF8);
	Стр = ЧтениеТекста.ПрочитатьСтроку();
	ЧтениеТекста.Закрыть();
	
	Поток.Закрыть();
	
    Возврат Стр;
    
КонецФункции

&НаКлиенте
Процедура АутентификацияОСПриИзменении(Элемент)
	
	ИзменитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДоступностьЭлементов() 
	
	Элементы.Пользователь.Доступность = Не АутентификацияОС;
	Элементы.Пароль.Доступность       = Не АутентификацияОС;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущаяСтраница = ПолучитьТекущуюСтраницу();
	ВыделитьТекущуюСтраницу(ТекущаяСтраница);
	
	ИзменитьДоступностьЭлементов();
		
	ЗаполнитьСписокБаз();
	
	ПодключитьОбработчикОжидания("Установить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекущуюСтраницу() 
	
	Соотв = Новый Соответствие;
	Соотв.Вставить(1, "СтраницаПоИмениБазы");
	Соотв.Вставить(2, "СтраницаКлиентСервер");
	Соотв.Вставить(3, "СтраницаФайловый");
	Соотв.Вставить(4, "СтраницаПоСтрокеСоединения");

	ИмяСтраницы = Соотв[ВариантЗапуска];
	Возврат Элементы[ИмяСтраницы];
	
КонецФункции

&НаКлиенте
Процедура Установить() Экспорт
	
	Если Элементы.ИмяБазыИзСписка.СписокВыбора.НайтиПоЗначению(ИмяБазыИзСписка) <> Неопределено Тогда
		ИмяБазыИзСписка = ИмяБазыИзСписка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокБаз()
	
	ПутьКСпискуБаз = ИмяФайлаСпискаИнфобазПользователяОС();
	
	МассивБаз = ПолучитьСписокБазПользователяОС(ПутьКСпискуБаз);
	
	Элементы.ИмяБазыИзСписка.СписокВыбора.Очистить();
	Для каждого Эл Из МассивБаз Цикл
		Элементы.ИмяБазыИзСписка.СписокВыбора.Добавить(Эл, Эл);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ИмяФайлаСпискаИнфобазПользователяОС() Экспорт 
	
	Каталог = РабочийКаталогДанныхПользователя();
	AppData = Сред(Каталог, 1, СтрНайти(Каталог, "\AppData\") + 8);
	
	//App = Новый COMОбъект("Shell.Application");
	//AppData = App.Namespace(26).Self.Path;
	ИмяФайлаСписка = AppData + "Roaming\1C\1CEStart\ibases.v8i";
	Возврат ИмяФайлаСписка;

КонецФункции

&НаКлиенте
Функция ПолучитьСписокБазПользователяОС(ПолноеИмяФайла)
 
	Файл = Новый Файл(ПолноеИмяФайла);
	ДобавленныеСтроки = Новый Массив;
	Если Не Файл.Существует() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ПолноеИмяФайла);
	Текст = ТекстовыйДокумент.ПолучитьТекст();
	
    RegExp = Новый COMОбъект("VBScript.RegExp");    // создаем объект для работы с регулярными выражениями
	
	
	
    RegExp.MultiLine = Истина;                  // истина — текст многострочный, ложь — одна строка
    RegExp.Global = Истина;   // истина — поиск по всей строке, ложь — до первого совпадения
    RegExp.IgnoreCase = Истина;        // истина — игнорировать регистр строки при поиске
    RegExp.Pattern = "\[[^\]]+\]";                        // шаблон (регулярное выражение)
	
	Результат = RegExp.Execute(Текст);
	
	Массив = Новый Массив;
	Для каждого Эл Из Результат Цикл
		Массив.Добавить(Сред(Эл.Value, 2, СтрДлина(Эл.Value) - 2));
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ВариантЗапускаПриИзменении(Элемент)
	
	ИзменитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ВыделитьТекущуюСтраницу(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьТекущуюСтраницу(ТекущаяСтраница)
	
	
	Соотв = Новый Соответствие;
	Соотв.Вставить("СтраницаПоИмениБазы", 1);
	Соотв.Вставить("СтраницаКлиентСервер", 2);
	Соотв.Вставить("СтраницаФайловый", 3);
	Соотв.Вставить("СтраницаПоСтрокеСоединения", 4);

	Для каждого Эл Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл

		Если Эл = ТекущаяСтраница Тогда
			ВариантЗапуска = Соотв[Эл.Имя];
			Эл.ЦветТекстаЗаголовка = WebЦвета.ЦветМорскойВолны;
			Эл.ШрифтЗаголовка = Новый Шрифт(Эл.ШрифтЗаголовка, , , Истина); 
		Иначе
			Эл.ЦветТекстаЗаголовка = Новый Цвет;
			Эл.ШрифтЗаголовка = Новый Шрифт(Эл.ШрифтЗаголовка, , , Ложь);
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = ТекущаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогИнформационнойБазыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыбратьКаталог("КаталогИнформационнойБазы");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКаталог(ИмяРеквизитаРезультатВыбора, НачальныйКаталог = "")
	
	РежимДиалогаВыбора = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДополнительныеПараметры = Новый Структура("ИмяРеквизитаРезультатВыбора", ИмяРеквизитаРезультатВыбора); 
	
	ПослеВыбораКаталога = Новый ОписаниеОповещения("ПослеВыбораКаталога", ЭтотОбъект, ДополнительныеПараметры);
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбора);
	Если ЗначениеЗаполнено(НачальныйКаталог) Тогда
		ДиалогВыбора.Каталог = НачальныйКаталог;	
	КонецЕсли;
	
	ДиалогВыбора.Показать(ПослеВыбораКаталога);
	
КонецПроцедуры

&НаКлиенте 
Процедура ПослеВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ЗначениеВыбора = ВыбранныеФайлы[0];
		ЭтотОбъект[ДополнительныеПараметры.ИмяРеквизитаРезультатВыбора] = ЗначениеВыбора;
	КонецЕсли;
	
КонецПроцедуры
