
Процедура РегистрацияОтветственных(Ошибка_Ссылка,Разработчик, Аналитик) Экспорт
	
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ошибка_Ссылка,"ОтветственныйРазработчик,ОтветственныйАналитик");
	мЗамена = СтруктураРеквизитов.ОтветственныйРазработчик<>Разработчик или СтруктураРеквизитов.ОтветственныйАналитик<>Аналитик;
	
	Если мЗамена  Тогда
		
		СО = Ошибка_Ссылка.ПолучитьОбъект();
		СО.ОтветственныйРазработчик = ?(ЗначениеЗаполнено(Разработчик),Разработчик,СО.ОтветственныйРазработчик);
		СО.ОтветственныйАналитик =  ?(ЗначениеЗаполнено(Аналитик),Аналитик,СО.ОтветственныйАналитик); 
		СО.записать();
	КонецЕсли;
	
	
КонецПроцедуры
