
&НаСервере
Процедура НайтиФайлыНаСервере()
	РеестрПроцедурСервер.ПоискФайловBSL();
КонецПроцедуры

&НаКлиенте
Процедура КомандаНайтиФайлы(Команда)
	НайтиФайлыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьСодержимоеНаСервере()
	РеестрПроцедурСервер.ЗаполнитьСодержимоеФайловBSL();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСодержимое(Команда)
	ДобавитьСодержимоеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЭаполнитьЭлементыКонфигурацииНаСервере()
	РеестрПроцедурСервер.ЭаполнитьЭлементыКонфигурации();
КонецПроцедуры

&НаКлиенте
Процедура ЭаполнитьЭлементыКонфигурации(Команда)
	ЭаполнитьЭлементыКонфигурацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМетодыНаСервере()
	РеестрПроцедурСервер.ЗаполнитьМетоды();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМетоды(Команда)
	ЗаполнитьМетодыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъектыМетаданныхМетодыНаСервере()
	РеестрПроцедурСервер.ОбъектыМетаданныхМетоды();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыМетаданныхМетоды(Команда)
	ОбъектыМетаданныхМетодыНаСервере();
КонецПроцедуры
