
Функция ЗагрузитьДанныеВДокумент(СтруктураЗаписи) Экспорт
	
	Ошибка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОшибкиТестирования.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОшибкиТестирования КАК ОшибкиТестирования
	|ГДЕ
	|	ОшибкиТестирования.uuid = &uuid
	|	И ОшибкиТестирования.Тест = &Тест
	|	И ОшибкиТестирования.ИБ = &ИБ
	|	И ОшибкиТестирования.Метаданные = &Метаданные
	|	И ОшибкиТестирования.Ошибка = &Ошибка
	|	И НЕ ОшибкиТестирования.ПометкаУдаления
	|	И ОшибкиТестирования.status = &status
	|	И ОшибкиТестирования.start = &start
	|	И ОшибкиТестирования.stop = &stop";
	
	Запрос.УстановитьПараметр("uuid", СтруктураЗаписи.uuid);
	Запрос.УстановитьПараметр("ИБ", СтруктураЗаписи.ИБ);
	Запрос.УстановитьПараметр("Метаданные", СтруктураЗаписи.Метаданные);
	Запрос.УстановитьПараметр("Ошибка", СтруктураЗаписи.Ошибка);
	Запрос.УстановитьПараметр("Тест", СтруктураЗаписи.Тест);
	Запрос.УстановитьПараметр("status", СтруктураЗаписи.status);
	Запрос.УстановитьПараметр("start", СтруктураЗаписи.start);
	Запрос.УстановитьПараметр("stop", СтруктураЗаписи.stop);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если не ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		// SD-55296 Klevin V.D. 2023/12/29 (
		Если ТипЗнч(СтруктураЗаписи.Ошибка) = Тип("СправочникСсылка.ксОшибкиТестов") Тогда  
			
			ДО = Документы.ОшибкиТестирования.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(до,СтруктураЗаписи);
			
			Попытка
				до.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Ошибка = Истина;
				ОписаниеОшибки = ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки);
				ЗаписьЖурналаРегистрации("ОшибкиТестирования.Запись",УровеньЖурналаРегистрации.Ошибка,Метаданные.Документы.ОшибкиТестирования,,ОписаниеОшибки);		
			КонецПопытки;
			
		КонецЕсли; //)
	
	КонецЕсли;
	
		Возврат Ошибка;	
	
КонецФункции
