
&НаСервере
Процедура ВыполнитьJobНаСервере()
		
	Если НЕ ЗначениеЗаполнено(Задание) Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Не выбрано задание!";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;

	
	Структура = Новый Структура;
	Для Каждого Стр Из Объект.SQLПараметры Цикл 
		Если ЗначениеЗаполнено(Стр.Значение) Тогда
			Структура.Вставить(Стр.Имя, Стр.Значение);
		Иначе
			Сооб = Новый СообщениеПользователю;
			Сооб.Текст = "Не задан параметр " + Стр.Имя;
			Сооб.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	СтрокаИдентификатора = Строка(ТекущаяДата()) + "," + Строка(Пользователи.ТекущийПользователь());
	Если ПроверитьНеВыполненые(Задание, Структура) Тогда
		SQLВыполнениеЗаданий.ДобавитьЗаписьВРегистрВыполнениеЗаданий(Задание, Структура, СтрокаИдентификатора);
		SQLВыполнениеЗаданий.ОбработатьЗадания();
	Иначе
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Такое задание существует и не выполнено!";
		Сооб.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьJob(Команда)
	ВыполнитьJobНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ЗаданиеПриИзмененииНаСервере()
	Объект.SQLПараметры.Очистить();
	Если ЗначениеЗаполнено(Задание) Тогда
		Для Каждого Стр Из Задание.SQLПараметры Цикл
			НовыйСтр = Объект.SQLПараметры.Добавить();
			НовыйСтр.Имя = Стр.Имя; 
			НовыйСтр.Значение = ТипДляЗначения(Стр.НазваниеТипа); 			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеПриИзменении(Элемент)
	ЗаданиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ТипДляЗначения(НазваниеТипа)
	Рез = "";
	Для каждого элТип из Метаданные.ОпределяемыеТипы.SQLТипыПараметров.Тип.Типы() Цикл
		обМетаданных = Метаданные.НайтиПоТипу(элТип);
		
		Если обМетаданных <> Неопределено И обМетаданных.Имя = НазваниеТипа Тогда
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(обМетаданных.ПолноеИмя());
			Рез = МенеджерОбъекта.ПустаяСсылка();
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 	
	Возврат Рез;
КонецФункции  

//&НаСервере
//Процедура ЗапуститьРегламентноеЗадание()
//   ИмяМетода = Метаданные.РегламентныеЗадания.SQLВыполнениеЗаданий.ИмяМетода;

//   // Проверка, выполняется ли фоновое задание.
//   Отбор = Новый Структура;
//   Отбор.Вставить("ИмяМетода", ИмяМетода);
//   Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
//   ФоновыеЗаданияВыполнениеЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
//   Если ФоновыеЗаданияВыполнениеЗаданий.Количество() = 0 Тогда
//      НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//        НСтр("ru = 'Запуск вручную: %1'"), "SQL выполнение заданий");
//      ФоновыеЗадания.Выполнить(ИмяМетода,,, НаименованиеФоновогоЗадания);
//   КонецЕсли;
//КонецПроцедуры

&НаСервере
Функция ПроверитьНеВыполненые(Задание, Структура)
	Рез = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SQLВыполнениеЗаданий.СтрокаJson КАК СтрокаJson
		|ИЗ
		|	РегистрСведений.SQLВыполнениеЗаданий КАК SQLВыполнениеЗаданий
		|ГДЕ
		|	SQLВыполнениеЗаданий.РезультатВыполнения = Ложь
		|	И SQLВыполнениеЗаданий.Задание = &Задание";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("Ложь", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		СтруктураЗадания = SQLВыполнениеЗаданий.СтрокаJSONВСтруктуруПараметров(ВыборкаДетальныеЗаписи.СтрокаJson);
		Если ОбщегоНазначения.КоллекцииИдентичны(СтруктураЗадания, Структура) Тогда
			Рез = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Рез;

 КонецФункции