
&НаСервере
Процедура ВыполнитьJobНаСервере()
		
	Если НЕ ЗначениеЗаполнено(Задание) Тогда
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Не выбрано задание!";
		Сооб.Сообщить();
		Возврат;
	КонецЕсли;

	
	Структура = Новый Структура;
	Для Каждого Стр Из Объект.SQLПараметры Цикл 
		Если ЗначениеЗаполнено(Стр.Значение) Тогда
			Структура.Вставить(Стр.Имя, Стр.Значение);
		Иначе
			Сооб = Новый СообщениеПользователю;
			Сооб.Текст = "Не задан параметр " + Стр.Имя;
			Сооб.Сообщить();
			Возврат;
		КонецЕсли;
	КонецЦикла;
	СтрокаИдентификатора = Строка(ТекущаяДата()) + "," + Строка(Пользователи.ТекущийПользователь());
	Если ПроверитьНеВыполненые(Задание, Структура) Тогда
		SQLВыполнениеЗаданий.ДобавитьЗаписьВРегистрВыполнениеЗаданий(Задание, Структура, СтрокаИдентификатора, ОтложеноДо);
		Если РежимОтладки Тогда
			SQLВыполнениеЗаданий.ОбработатьЗадания(); 
		КонецЕсли;
	Иначе
		Сооб = Новый СообщениеПользователю;
		Сооб.Текст = "Такое задание существует и не выполнено!";
		Сооб.Сообщить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьJob(Команда)   
	
	ТекстСообщения = НСтр("ru = 'Выполнить задание %1, среднее время выполнения %2 мин. Заданий в очереди: %3?'");
	СтрВопроса = СтруктураВопроса();
	Подсказка = СтрШаблон(ТекстСообщения, СтрВопроса.Задание, СтрВопроса.Длительность, СтрВопроса.Очередь);
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаВыполнитьJob", ЭтотОбъект);
	Режим = РежимДиалогаВопрос.ДаНет;
	ПоказатьВопрос(Оповещение, Подсказка, Режим, 0);
	
КонецПроцедуры

&НаСервере
Функция СтруктураВопроса()
	Рез = Новый Структура; 
	Если ЗначениеЗаполнено(Задание) Тогда
		Рез.Вставить("Задание", Задание.Наименование);
		
		Длительность = 30.00;
		Очередь = 0;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	А.Количество КАК Количество,
		|	Б.Длительность КАК Длительность
		|ИЗ
		|	(ВЫБРАТЬ
		|		КОЛИЧЕСТВО(*) КАК Количество
		|	ИЗ
		|		РегистрСведений.SQLВыполнениеЗаданий КАК Т
		|	ГДЕ
		|		НЕ Т.РезультатВыполнения
		|		И Т.КоличествоПопыток < &КоличествоПопыток
		|		И Т.ОтложеноДо <= &ТекДата) КАК А,
		|	(ВЫБРАТЬ
		|		СРЕДНЕЕ(РАЗНОСТЬДАТ(ВЫБОР
		|					КОГДА Т.НачалоВыполнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ТОГДА Т.ДатаЗаписи
		|					ИНАЧЕ Т.ДатаЗаписи
		|				КОНЕЦ, Т.ДатаВыполнения, МИНУТА)) КАК Длительность
		|	ИЗ
		|		РегистрСведений.SQLВыполнениеЗаданий КАК Т
		|	ГДЕ
		|		Т.РезультатВыполнения
		|		И Т.Задание = &Задание) КАК Б";  
		Запрос.УстановитьПараметр("КоличествоПопыток",3);
		Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
		Запрос.УстановитьПараметр("Задание",Задание);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Длительность = Выборка.Длительность;
			Очередь = Выборка.Количество;
		КонецЦикла;
		Рез.Вставить("Длительность", Строка(Формат(Длительность, "ЧДЦ=0")));
		Рез.Вставить("Очередь", Строка(Очередь));
	Иначе
	    Рез.Вставить("Задание", "Неопределено");
		Рез.Вставить("Длительность", "0");
		Рез.Вставить("Очередь", "0");
	КонецЕСли;
	
	Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ПослеВопросаВыполнитьJob(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьJobНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.РежимОтладки.Видимость = РольДоступна("ПолныеПрава");	
КонецПроцедуры

&НаСервере
Процедура ЗаданиеПриИзмененииНаСервере()
	Объект.SQLПараметры.Очистить();
	Если ЗначениеЗаполнено(Задание) Тогда
		Для Каждого Стр Из Задание.SQLПараметры Цикл
			НовыйСтр = Объект.SQLПараметры.Добавить();
			НовыйСтр.Имя = Стр.Имя; 
			НовыйСтр.Значение = ТипДляЗначения(Стр.НазваниеТипа); 	
			НовыйСтр.Значение = ПолучитьЗначениеПоУмолчанию(НовыйСтр.Значение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаданиеПриИзменении(Элемент)
	ЗаданиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ТипДляЗначения(НазваниеТипа)
	Рез = "";
	Для каждого элТип из Метаданные.ОпределяемыеТипы.SQLТипыПараметров.Тип.Типы() Цикл
		обМетаданных = Метаданные.НайтиПоТипу(элТип);
		
		Если обМетаданных <> Неопределено И обМетаданных.Имя = НазваниеТипа Тогда
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(обМетаданных.ПолноеИмя());
			Рез = МенеджерОбъекта.ПустаяСсылка();
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 	
	Возврат Рез;
КонецФункции  

//&НаСервере
//Процедура ЗапуститьРегламентноеЗадание()
//   ИмяМетода = Метаданные.РегламентныеЗадания.SQLВыполнениеЗаданий.ИмяМетода;

//   // Проверка, выполняется ли фоновое задание.
//   Отбор = Новый Структура;
//   Отбор.Вставить("ИмяМетода", ИмяМетода);
//   Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
//   ФоновыеЗаданияВыполнениеЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
//  Если ФоновыеЗаданияВыполнениеЗаданий.Количество() = 0 Тогда
//      НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//        НСтр("ru = 'Запуск вручную: %1'"), "SQL выполнение заданий");
//      ФоновыеЗадания.Выполнить(ИмяМетода,,, НаименованиеФоновогоЗадания);
//	  Сооб = Новый СообщениеПользователю;
//	  Сооб.Текст = "Задание запущено!";
//	  Сооб.Сообщить();
//  Иначе
//	  Сооб = Новый СообщениеПользователю;
//	  Сооб.Текст = "Задание уже запущено, Ваше задание выполнится по расписанию.";
//	  Сооб.Сообщить();
//  КонецЕсли;
//КонецПроцедуры

&НаСервере
Функция ПроверитьНеВыполненые(Задание, Структура)
	Рез = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SQLВыполнениеЗаданий.СтрокаJson КАК СтрокаJson
		|ИЗ
		|	РегистрСведений.SQLВыполнениеЗаданий КАК SQLВыполнениеЗаданий
		|ГДЕ
		|	SQLВыполнениеЗаданий.РезультатВыполнения = Ложь
		|	И SQLВыполнениеЗаданий.КоличествоПопыток < &КоличествоПопыток
		|	И SQLВыполнениеЗаданий.Задание = &Задание";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("Ложь", Ложь);
	КоличествоПопыток = Константы.SQLЗаданиеКоличествоПопыток.Получить();
	Запрос.УстановитьПараметр("КоличествоПопыток",КоличествоПопыток);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		СтруктураЗадания = SQLВыполнениеЗаданий.СтрокаJSONВСтруктуруПараметров(ВыборкаДетальныеЗаписи.СтрокаJson);
		Если ОбщегоНазначения.КоллекцииИдентичны(СтруктураЗадания, Структура) Тогда
			Рез = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Рез;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПоУмолчанию(Значение)
	Рез = Неопределено; 
	Если ТипЗнч(Значение) =  Тип("СправочникСсылка.Пользователи") Тогда
		Рез = Пользователи.ТекущийПользователь();
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.SQLDBТестовые") Тогда
		Рез = Значение;
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	SQLDBТестовые.Ссылка КАК Ссылка,
			|	SQLDBТестовые.Код КАК Код,
			|	SQLDBТестовые.Разработчик КАК Разработчик
			|ИЗ
			|	Справочник.SQLDBТестовые КАК SQLDBТестовые
			|ГДЕ
			|	SQLDBТестовые.Разработчик = &Разработчик
			|
			|УПОРЯДОЧИТЬ ПО
			|	Код";
		
		Запрос.УстановитьПараметр("Разработчик", Пользователи.ТекущийПользователь());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Рез = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
	Иначе
		Рез = Значение;
	КонецЕсли;
	Возврат Рез;
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеЗадания() 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
							|	П.Задание КАК Задание
							|ИЗ
							|	РегистрСведений.SQLПравоЗапускаЗаданий КАК П
							|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
							|			ГруппыДоступаПользователи.Ссылка КАК Ссылка
							|		ИЗ
							|			Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
							|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
							|				ПО (СоставыГруппПользователей.Используется)
							|					И (СоставыГруппПользователей.Пользователь = &Пользователь)
							|					И ГруппыДоступаПользователи.Пользователь = СоставыГруппПользователей.ГруппаПользователей) КАК Д
							|		ПО (П.ГруппаДоступа = Д.Ссылка)");
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());	
	РезЗапроса =  Запрос.Выполнить();
	Если РезЗапроса.Пустой() Тогда
		Возврат Справочники.SQLЗадания.ПустаяСсылка();
	Иначе 
		Выборка = РезЗапроса.Выбрать();
		Рез = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			Рез.Добавить(Выборка.Задание);
		КонецЦикла;
		
		Возврат Рез;
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Процедура ЗаданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ДоступныеЗадания();

КонецПроцедуры
