
&НаКлиенте
Процедура ПараметрыТипНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ФВыбора = ПолучитьФорму("Справочник.SQLЗадания..Форма.ФормаВыбораТипа");
	ФВыбора.ВладелецФормы = Элемент;
	ФВыбора.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура ПараметрыТипОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда 
		ТекСтрока = Элементы.Параметры.ТекущиеДанные;
		ТекСтрока.НазваниеТипа = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СценарийКоммандаОткрытие(Элемент, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаКомандыСценария", ЭтотОбъект);
    ПоказатьВводСтроки(Оповещение,Элементы.Сценарий.ТекущиеДанные.КомандаСценария, "Введите команду", , Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВводаКомандыСценария(Результат, Параметры) Экспорт
 
	Если Не Результат = Неопределено Тогда 
		ТекСтрока = Элементы.Сценарий.ТекущиеДанные;
		ТекСтрока.КомандаСценария = Результат; 
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
 
КонецПроцедуры