

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьШаблонПоУмолчанию();	
	КонецЕсли;
        
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Шаблон(Команда)
	ЗаполнитьШаблонПоУмолчанию();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере		  
Функция ВернутьШаблонПоУмолчанию() Экспорт
	
	//Значения макета по умолчанию
	МакетПоУмолчанию			=	Справочники.ЗД_Скрипты.ПолучитьМакет("ШаблонТекста");
	
	Возврат МакетПоУмолчанию.ПолучитьТекст();;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьШаблонПоУмолчанию()

	Объект.КодФормированияСкрипта = ВернутьШаблонПоУмолчанию();

КонецПроцедуры


#КонецОбласти
		  
