
&НаСервере
Процедура ЗапуститьРегламентноеЗаданиеВРежимеОтладки()
   SQLВыполнениеЗаданий.ОбработатьЗадания();
КонецПроцедуры 

//&НаСервере
//Процедура ЗапуститьРегламентноеЗадание()
//   ИмяМетода = Метаданные.РегламентныеЗадания.SQLВыполнениеЗаданий.ИмяМетода;

//   // Проверка, выполняется ли фоновое задание.
//   Отбор = Новый Структура;
//   Отбор.Вставить("ИмяМетода", ИмяМетода);
//   Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
//   ФоновыеЗаданияВыполнениеЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
//  Если ФоновыеЗаданияВыполнениеЗаданий.Количество() = 0 Тогда
//      НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//        НСтр("ru = 'Запуск вручную: %1'"), "SQL выполнение заданий");
//      ФоновыеЗадания.Выполнить(ИмяМетода,,, НаименованиеФоновогоЗадания);
//	  Сооб = Новый СообщениеПользователю;
//	  Сооб.Текст = "Задание запущено!";
//	  Сооб.Сообщить();
//  Иначе
//	  Сооб = Новый СообщениеПользователю;
//	  Сооб.Текст = "Задание уже запущено, Ваше задание выполнится по расписанию.";
//	  Сооб.Сообщить();
//  КонецЕсли;
//КонецПроцедуры



&НаКлиенте
Процедура SQLВыполнитьЗадание(Команда) 
	Если РежимОтладки Тогда
		ЗапуститьРегламентноеЗаданиеВРежимеОтладки();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.РежимОтладки.Видимость = РольДоступна("ПолныеПрава");
КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзменении(Элемент)
	Элементы.SQLВыполнитьЗадание.Видимость = РежимОтладки;
КонецПроцедуры
