
Функция ПолучитьРезультатКомандыНаСервере(ТекущаяКоманда, КодировкаЗаписи = "cp866", КодировкаЧтения = "cp866") Экспорт
	
	//Ковычка = Символ(34); 
	//ПарамOutLog1c = ПолучитьИмяВременногоФайла("txt"); 
	//
	//МассивКомманд = Новый Массив;
	//МассивКомманд.Добавить(ТекущаяКоманда);
	//МассивКомманд.Добавить(" > ");
	//МассивКомманд.Добавить(ПарамOutLog1c);
	//
	//стрКоманда = СтрСоединить(МассивКомманд," ");   
	//
	//ЗапуститьПриложение(стрКоманда,,Истина);   
	//
	////чтение логов
	//РезультатКоманды = "";
	//ТекстФайл = новый Файл(ПарамOutLog1c);
	//Если ТекстФайл.Существует() Тогда
	//	Текст = Новый ТекстовыйДокумент;	
	//	Текст.Прочитать(ПарамOutLog1c);	
	//	РезультатКоманды = Текст.ПолучитьТекст();
	//КонецЕсли;
	////Сообщить("мТекстФайла: "+мТекстФайла);   	
	//УдалитьФайлы(ПарамOutLog1c);
	
	
	
	/////////////////////////
	КодВозврата = Неопределено;
	
	КаталогВременныхФайлов = КаталогВременныхФайлов();
	ИмяБатФайла = "1CInfo.bat";
	ИмяВременногоФайла = КаталогВременныхФайлов + "InfoLic.txt";
	ПолноеИмяИмяБатФайла = КаталогВременныхФайлов + ИмяБатФайла;
	
	БатФайл = Новый ТекстовыйДокумент;
	БатФайл.ДобавитьСтроку(ТекущаяКоманда + " > " + ИмяВременногоФайла);
	БатФайл.Записать(ПолноеИмяИмяБатФайла, КодировкаЗаписи);
	
	ЗапуститьПриложение(ИмяБатФайла, КаталогВременныхФайлов, Истина, КодВозврата);
	
	ФайлЛицензий = Новый ТекстовыйДокумент;
	ФайлЛицензий.Прочитать(ИмяВременногоФайла, КодировкаЧтения);	
	
	РезультатКоманды = ФайлЛицензий.ПолучитьТекст();
	
	ФайлЛицензий = Неопределено;
	
	УдалитьФайлы(ПолноеИмяИмяБатФайла);
	УдалитьФайлы(ИмяВременногоФайла);



	Возврат РезультатКоманды;
	
КонецФункции

Функция ПолучитьСтрокуПлатформыRAC()
	
	Возврат """" + КаталогПрограммы() + "rac.exe""";
	
КонецФункции


Функция ПолучитьИдентификаторКластера(СтрокаПлатформа,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	СтрокаИдентификаторКластера = "";     
		
	мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
	СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
	ТекущаяКоманда = СтрокаПлатформа + СерверПорт +" cluster list";
	
	
	РезультатКоманды = ПолучитьРезультатКомандыНаСервере(ТекущаяКоманда, КодировкаЗаписи, КодировкаЧтения);
	
	МассивИнформации = СтрРазделить(РезультатКоманды, Символы.ПС, Ложь);
	
	Для Каждого Элемент Из МассивИнформации Цикл
		
		Если СтрНайти(Элемент, "cluster") > 0 Тогда
			
			МассивИД = СтрРазделить(Элемент, ":", Ложь);
			
			Если МассивИД.Количество() > 1 Тогда
				
				СтрокаИдентификаторКластера = СокрЛП(МассивИД[1]);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СтрокаИдентификаторКластера;
	
КонецФункции

Функция ПолучитьТаблицуЛицензийНаСервере(СтрокаПлатформа,ИдентификаторКластера,НомерПорта,КодировкаЗаписи="cp866",КодировкаЧтения="cp866") Экспорт
	
	Если ПустаяСтрока(СтрокаПлатформа) Тогда
		СтрокаПлатформа = ПолучитьСтрокуПлатформыRAC();	
	КонецЕсли;
	    	
	Если ИдентификаторКластера = "" Тогда		
		ИдентификаторКластера = ПолучитьИдентификаторКластера(СтрокаПлатформа,НомерПорта,КодировкаЗаписи,КодировкаЧтения);					
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторКластера) Тогда
		
		мНомерПорта = формат(НомерПорта,"ЧЦ=4; ЧРГ=' '; ЧГ=0"); 
		СерверПорт = ?(не ПустаяСтрока(НомерПорта)," localhost:"+мНомерПорта," localhost:1545");
		
		ТекущаяКоманда = СтрокаПлатформа +СерверПорт+ " session --cluster=" + ИдентификаторКластера + " list --licenses";
	
		СписокЛицензий = ПолучитьРезультатКомандыНаСервере(ТекущаяКоманда, КодировкаЗаписи, КодировкаЧтения);
		
		МассивИнформации = СтрРазделить(СписокЛицензий, Символы.ПС);
		
		ТаблицаЛицензий = новый ТаблицаЗначений;
		мКолонкиТЗ = "Сессия,Пользователь,Сервер,Приложение,ЭтоКонфигуратор,ИмяФайла,Комплект,ИспользуетсяНаСервере,ТипЛицензии,МаксимумПользователей,PID,Описание,ПолноеОписание";
		Для Каждого ТекЭлемента из СтрРазделить(мКолонкиТЗ,",") Цикл
			ТаблицаЛицензий.Колонки.Добавить(ТекЭлемента);
		КонецЦикла;		
		
		Для Каждого ЭлементТекст Из МассивИнформации Цикл
			
			МассивКолонки = СтрРазделить(ЭлементТекст, ":", Истина);
			
			Если МассивКолонки.Количество() > 1 Тогда
				
				Если СтрНайти(МассивКолонки[0], "session") > 0 Тогда 
					
					НоваяСтрока = ТаблицаЛицензий.Добавить();
					
					НоваяСтрока.Сессия = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "user-name") > 0 Тогда 
					
					НоваяСтрока.Пользователь = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "host") > 0 Тогда 
					
					НоваяСтрока.Сервер = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "app-id") > 0 Тогда 
					
					НоваяСтрока.Приложение = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
					Если НоваяСтрока.Приложение = "Designer" Тогда
						
						НоваяСтрока.Приложение = "Конфигуратор";
						
						НоваяСтрока.ЭтоКонфигуратор = Истина;// DEV-8653 ЗыковГС 2022.10.28
						
					ИначеЕсли НоваяСтрока.Приложение = "1CV8" Тогда
						
						НоваяСтрока.Приложение = "Толстый клиент";
						
					ИначеЕсли НоваяСтрока.Приложение = "1CV8C" Тогда
						
						НоваяСтрока.Приложение = "Тонкий клиент";
						
					ИначеЕсли НоваяСтрока.Приложение = "WebClient" Тогда
						
						НоваяСтрока.Приложение = "Веб-клиент";
						
					КонецЕсли;
					  
				ИначеЕсли СтрНайти(МассивКолонки[0], "full-name") > 0 Тогда 
					
					НоваяСтрока.ИмяФайла = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "series") > 0 Тогда 
					
					НоваяСтрока.Комплект = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "issued-by-server") > 0 Тогда 
					
					НоваяСтрока.ИспользуетсяНаСервере = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "license-type") > 0 Тогда 
					
					НоваяСтрока.ТипЛицензии = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
					Если НоваяСтрока.ТипЛицензии = "soft" Тогда
						
						НоваяСтрока.ТипЛицензии = "Программная";
						
					КонецЕсли;
										
				ИначеЕсли СтрНайти(МассивКолонки[0], "max-users-all") > 0 Тогда 
					
					НоваяСтрока.МаксимумПользователей = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "rmngr-pid") > 0 Тогда 
					
					НоваяСтрока.PID = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "short-presentation") > 0 Тогда 
					
					НоваяСтрока.Описание = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				ИначеЕсли СтрНайти(МассивКолонки[0], "full-presentation") > 0 Тогда 
					
					НоваяСтрока.ПолноеОписание = СокрЛП(СтрЗаменить(ЭлементТекст, МассивКолонки[0] + ":", ""));
					
				КонецЕсли;
				
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;  
	
	Возврат ТаблицаЛицензий;

КонецФункции
