
Процедура ДобавитьПараметр(МассивКоманды,МассивОшибок,СтруктураПараметров,
							ИмяПараметра,БлокСкрипта,Обязательно=Ложь)
							
	Ковычка = Символ(34);
	мТекЗнач = Неопределено;
	Если СтруктураПараметров.Свойство(ИмяПараметра,мТекЗнач) Тогда
		МассивКоманды.Добавить(БлокСкрипта+Ковычка+мТекЗнач+Ковычка);
	ИначеЕсли Обязательно Тогда		
		МассивОшибок.Добавить("Не заполнено: "+ИмяПараметра);	
	КонецЕсли;


КонецПроцедуры

	 
Функция СформироватьСкрипт(СкриптСсылка,СтруктураПеременных) Экспорт
	
	СтруктураСкрипта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СкриптСсылка,"КодФормированияСкрипта,ВыполнитьКод");

	Если не СтруктураПеременных.Свойство("Ошибка")Тогда
		СтруктураПеременных.Вставить("Ошибка");
	КонецЕсли;
	
	мТекстСкрипта = СтруктураСкрипта.КодФормированияСкрипта;
	
	Результат = "";
	мОшибка = "";
	
	Если не ПустаяСтрока(мТекстСкрипта) Тогда
		
		Если СтруктураСкрипта.ВыполнитьКод  Тогда
			Попытка
				Выполнить(мТекстСкрипта);
			Исключение			       						
				мОшибка = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());			
			КонецПопытки;	
			
			СтруктураПеременных.Ошибка = мОшибка;		
		Иначе
			Результат = мТекстСкрипта; 	
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Результат;
	
	        	
КонецФункции
