	 
&НаСервере	 
Функция ДесереализацияJSON(Строка_json) Экспорт
	
	ЧтениеJSON 			= Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку(Строка_json); 
	ДанныеЗагрузки		=	ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат ДанныеЗагрузки;
	
КонецФункции
	 

&НаСервере
Функция ПолучитьЗапросНаСервере()
	
	//http://1c-www-server/zup301w/hs/workday/20200222
	
	//инф!!!
	//https://1c-programmer-blog.ru/programmirovanie/rabota-s-http-v-1s-8-2-i-8-3.html
	
	//http://vmweb1c01/wserpwork/hs/query/query_data/StrukturaTablits
	
	ИмяСервера      = "vmweb1c01";
	ПортСервера     = 80;
	ИмяПользователя = "apiquery";
	Пароль          = "m322341tt0zpvs43l4d5";
	
	мЗапрос			=	"/wserpwork/hs/query/query_data/StrukturaTablits";
	
	HTTP 			= Новый HTTPСоединение(ИмяСервера, 80,ИмяПользователя ,Пароль );		
	запросPOST 		= Новый HTTPЗапрос(мЗапрос);
	
	HTTPОтвет 		= HTTP.Получить(запросPOST); //отправляем
	
	мЗначение	=	Неопределено;

	Если НЕ HTTPОтвет.КодСостояния = 200 Тогда				
		ТекстСообщения = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"); 
		Сообщить("err: " + HTTPОтвет.КодСостояния );		 
	Иначе                                           		
		ТекстСообщения = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8"); 
		
		мЗначение = ДесереализацияJSON(ТекстСообщения);
	
	КонецЕсли;		
	
	
	Возврат мЗначение;	
	
КонецФункции


&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Итератор = 0;
	МассивСтруктур = ПолучитьЗапросНаСервере();   
	Для Каждого ТекЭлемента из МассивСтруктур Цикл
		Итератор = Итератор+1;	
		Справочники.ТаблицыМетаданных.ОбновитьЗапись(ИБ,ТекЭлемента);	
	КонецЦикла;              
	
	Сообщить("Загружено "+"("+ИБ+"): "+ Итератор);	
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
