
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// Возвращает сведения о внешней обработке.
//
// Возвращаемое значение:
//   Структура - Подробнее см. ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке().
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПредставлениеОбъекта	=	"Jira (факт отражений)";	
	
	ОписаниеИзменений	=	"
	|01/08/25			-	Создание разработчик:ДанилинВИ / ид.польз. хранилища: 
	|		
	|";
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
	ПараметрыРегистрации.Наименование		= ПредставлениеОбъекта;	
	ПараметрыРегистрации.Информация 		= ОписаниеИзменений;
	ПараметрыРегистрации.Вид 				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
	ПараметрыРегистрации.Версия 			= "01/08/25";
	ПараметрыРегистрации.БезопасныйРежим 	= Ложь; //Истина;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = '"+ПредставлениеОбъекта+"'");
	Команда.Идентификатор = "ИнтерактивнаяЗагрузка";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Ложь;
	
	//Команда = ПараметрыРегистрации.Команды.Добавить();
	//Команда.Представление = НСтр("ru = 'Фоновая обработка'");
	//Команда.Идентификатор = "ФоноваяЗагрузка";
	//Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	//Команда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;

КонецФункции

// Обработчик серверных команд.
//
// Параметры:
//   ИдентификаторКоманды - Строка - Имя команды, определенное в функции СведенияОВнешнейОбработке().
//   ОбъектыНазначения    - Массив - Ссылки объектов, для которых вызвана команда.
//       - Неопределено - для команд "ЗаполнениеФормы".
//   ПараметрыВыполнения  - Структура - Контекст выполнения команды.
//       * ДополнительнаяОбработкаСсылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка обработки.
//           Может использоваться для чтения параметров обработки.
//           Пример см. в комментарии к функции ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы().
//
Процедура ВыполнитьКоманду(ИдентификаторКоманды) Экспорт
	ДатаЗавершенияВМиллисекундах = ТекущаяУниверсальнаяДатаВМиллисекундах() + 4;
	
	Если ПараметрыСеанса.РаботаСВнешнимиРесурсамиЗаблокирована Тогда 
		ВызватьИсключение НСтр("ru = 'Запуск обмена невозможен, работа с внешними ресурсами заблокирована!'");
	КонецЕсли;
	
	////ЗаписьЖурналаРегистрации(ИдентификаторКоманды, УровеньЖурналаРегистрации.Предупреждение, 
	////	Метаданные.Обработки.УниверсальныйОбменДаннымиXML, ИдентификаторКоманды, 
	////	СтрокаСоединенияИнформационнойБазы, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
	
	Если ИдентификаторКоманды = "ФоноваяЗагрузка" Тогда
		ФоноваяЗагрузка();
	Иначе
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Команда ""%1"" не поддерживается обработкой ""%2""'"),
			ИдентификаторКоманды,
			Метаданные().Представление());
	КонецЕсли;
	
	// Имитация длительной операции.
	Пока ТекущаяУниверсальнаяДатаВМиллисекундах() < ДатаЗавершенияВМиллисекундах Цикл
	КонецЦикла;
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик команд ФоноваяЗагрузка.
Процедура ФоноваяЗагрузка() Экспорт 
	
	////ТекущаяДата = НачалоДня(ТекущаяДата());
	////
	////ДатаНачала = Макс(ТекущаяДата - 2 * 86400, '20180701');
	////ДатаОкончания = Макс(ТекущаяДата, '20180701') - 1;
	////

	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
