
Процедура ОбработатьЗадания() Экспорт
    ТекЗадание = ЗаданиеНаОбработку();
	Пока ЗначениеЗаполнено(ТекЗадание.Задание) Цикл 
		СтруктураПараметров = Новый Структура;
		Если Не ТекЗадание.КлючПараметров = "" Тогда
			СтруктураПараметров = СтрокаJSONВСтруктуруПараметров(ТекЗадание.СтрокаJson);
			Если Не СтруктураПараметров.Свойство("Задание") Тогда
				СтруктураПараметров.Вставить("Задание", ТекЗадание.Задание);
			КонецЕсли;   
			Если Не СтруктураПараметров.Свойство("КлючПараметров") Тогда
				СтруктураПараметров.Вставить("КлючПараметров", ТекЗадание.КлючПараметров);
			КонецЕсли;   
		Иначе
			СтруктураПараметров.Вставить("Задание", ТекЗадание.Задание);
		КонецЕсли;
		ЕстьОшибка = ""; 
		Набор = РегистрыСведений.SQLВыполнениеЗаданий.СоздатьНаборЗаписей();
		Набор.Отбор.Задание.Значение = ТекЗадание.Задание;
		Набор.Отбор.Задание.Использование = Истина;
		Набор.Отбор.КлючПараметров.Значение = ТекЗадание.КлючПараметров;
		Набор.Отбор.КлючПараметров.Использование = Истина;
		Набор.Прочитать();
		Если Набор.Количество() = 1 Тогда  
			Набор[0].НачалоВыполнения = ТекущаяДата(); 
		КонецЕсли;
		Набор.Записать(); 
		Попытка
			ВыполнитьЗадание(ТекЗадание.Задание, СтруктураПараметров, ЕстьОшибка);
		Исключение
			Если ОписаниеОшибки() = "" Тогда
				ЕстьОшибка = "Неизвестная ошибка!";	
			Иначе					
				ЕстьОшибка = ОписаниеОшибки();
			КонецЕсли;
		КонецПопытки;
		Набор = РегистрыСведений.SQLВыполнениеЗаданий.СоздатьНаборЗаписей();
		Набор.Отбор.Задание.Значение = ТекЗадание.Задание;
		Набор.Отбор.Задание.Использование = Истина;
		Набор.Отбор.КлючПараметров.Значение = ТекЗадание.КлючПараметров;
		Набор.Отбор.КлючПараметров.Использование = Истина;
		Набор.Прочитать();
		Если Набор.Количество() = 1 Тогда 
			Если ЕстьОшибка = "" Тогда
				Набор[0].РезультатВыполнения = Истина;
			Иначе
				Набор[0].НачалоВыполнения = ДАТА(1,1,1,0,0,0);
			КонецЕсли;
			Набор[0].ОшибкаВыполнения = ЕстьОшибка;
			Набор[0].ДатаВыполнения = ТекущаяДата(); 
			Набор[0].КоличествоПопыток = Набор[0].КоличествоПопыток + 1; 
		КонецЕсли;
		Набор.Записать(); 
		ТекЗадание = ЗаданиеНаОбработку();
	КонецЦикла;
КонецПроцедуры 

Функция ЗаданиеПроверить(Задание = Неопределено, КлючПараметров = Неопределено)
	Рез = Новый Структура;
	Рез.Вставить("Задание", Справочники.SQLЗадания.ПустаяСсылка());
	Рез.Вставить("КлючПараметров", "");
	Рез.Вставить("СтрокаJson", "");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Задание КАК Задание,
	|	Т.КлючПараметров КАК КлючПараметров,
	|	Т.СтрокаJson КАК СтрокаJson
	|ИЗ
	|	РегистрСведений.SQLВыполнениеЗаданий КАК Т
	|ГДЕ
	|	НЕ Т.РезультатВыполнения
	|	И Т.КоличествоПопыток < &КоличествоПопыток
	|	И Т.ОтложеноДо <= &ТекДата
	|	И НЕ (Т.Задание = &Задание И Т.КлючПараметров = &КлючПараметров) 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.ДатаЗаписи"; 
	
	КоличествоПопыток = Константы.SQLЗаданиеКоличествоПопыток.Получить();
    Запрос.УстановитьПараметр("КоличествоПопыток",КоличествоПопыток);
	Запрос.УстановитьПараметр("ТекДата",ТекущаяДата());
	Запрос.УстановитьПараметр("Задание",Задание);
	Запрос.УстановитьПараметр("КлючПараметров",КлючПараметров);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Рез.Задание = Выборка.Задание; 
		Рез.КлючПараметров = Выборка.КлючПараметров;
		Рез.СтрокаJson = Выборка.СтрокаJson;
	КонецЦикла;
	
	Возврат Рез;
		
КонецФункции  

Функция ЗаданиеНаОбработку()
	Рез = Новый Структура;
	Рез.Вставить("Задание", Справочники.SQLЗадания.ПустаяСсылка());
	Рез.Вставить("КлючПараметров", "");
	Рез.Вставить("СтрокаJson", "");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Задание КАК Задание,
	|	Т.КлючПараметров КАК КлючПараметров,
	|	Т.СтрокаJson КАК СтрокаJson
	|ИЗ
	|	РегистрСведений.SQLВыполнениеЗаданий КАК Т
	|ГДЕ
	|	НЕ Т.РезультатВыполнения
	|	И Т.КоличествоПопыток < &КоличествоПопыток
	|	И Т.НачалоВыполнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И Т.ОтложеноДо <= &ТекДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.ДатаЗаписи"; 
	
	КоличествоПопыток = Константы.SQLЗаданиеКоличествоПопыток.Получить();
    Запрос.УстановитьПараметр("КоличествоПопыток", КоличествоПопыток);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Рез.Задание = Выборка.Задание; 
		Рез.КлючПараметров = Выборка.КлючПараметров;
		Рез.СтрокаJson = Выборка.СтрокаJson;
	КонецЦикла;
	
	Возврат Рез;
		
КонецФункции


Функция СтрокаJSONВСтруктуруПараметров(СтрокаJSON) Экспорт  
	Если СтрокаJSON = "" Тогда
		Возврат Новый Структура;
	КонецЕсли;
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Структура = ПрочитатьJSON(ЧтениеJSON, Ложь);
	СтруктураПараметров = Новый Структура;
	Для каждого эл из Структура Цикл  
		Если Не ТипЗнч(эл.Значение) = Тип("Массив") Тогда 
			СтруктураПараметров.Вставить(эл.Ключ,эл.Значение);
			Продолжить;
		КонецЕсли;
		Если эл.Значение[0] = "Дата" Тогда
			Значение = ПрочитатьДатуJSON(Формат(эл.Значение[1], "ЧГ="), ФорматДатыJSON.ISO);
			СтруктураПараметров.Вставить(эл.Ключ, Значение);
			Продолжить;
		КонецЕсли;
		// <-- Пантелеев Д.И. 17.04.2023, Ссылка на задачу в Redmine (Jira): SD-22910 
		Если эл.Значение[0] = "ТаблицаЗначений" Тогда  
			ТЗ = Новый ТаблицаЗначений;
			к = 1;
			Пока к < эл.Значение.Количество() Цикл 
				Если к = 1 Тогда
					ТЗ = СтруктураВТЗ(СтрокаJSONВСтруктуруПараметров(эл.Значение[к]));
				Иначе
					врТЗ = СтруктураВТЗ(СтрокаJSONВСтруктуруПараметров(эл.Значение[к]));
					новСтр = ТЗ.Добавить();
					ЗаполнитьЗначенияСвойств(новСтр, врТЗ[0]);
				КонецЕсли; 
				к = к + 1;
			КонецЦикла;
			СтруктураПараметров.Вставить(эл.Ключ, ТЗ);
			Продолжить;
		КонецЕсли; 
		// --> Пантелеев Д.И. 17.04.2023 
		Попытка
			Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(эл.Значение[0]);
			Если СтрНайти(эл.Значение[0], "Перечисление") Тогда  
				Значение = Менеджер.Получить(эл.Значение[1]);
			Иначе
				Значение = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(эл.Значение[1]));
			КонецЕсли;
			СтруктураПараметров.Вставить(эл.Ключ, Значение);
		Исключение
			СтруктураПараметров.Вставить("Исключение", эл.Значение[0]);
		КонецПопытки;
	КонецЦикла;
	ЧтениеJSON.Закрыть(); 
	Возврат СтруктураПараметров; 
КонецФункции

Функция СтруктураВТЗ(Структра) 
	
	ТЗ = Новый ТаблицаЗначений;
	НовСтр=ТЗ.Добавить();

	Для Каждого ТекЭлем из Структра Цикл
		
		ТЗ.Колонки.Добавить(ТекЭлем.Ключ);
			
		НовСтр[ТекЭлем.Ключ] = ТекЭлем.Значение;                          
		
	КонецЦикла;
 	
	Возврат ТЗ;
	
КонецФункции

Процедура ДобавитьЗаписьВРегистрВыполнениеЗаданий(Задание, СтруктураПараметров = Неопределено, КлючПараметр = "", ОтложеноДо) Экспорт 
	Если Не ТипЗнч(КлючПараметр) = Тип("Строка") Тогда
		КлючПараметр = Строка(КлючПараметр);
	КонецЕсли;
	Запись = РегистрыСведений.SQLВыполнениеЗаданий.СоздатьМенеджерЗаписи();
	Запись.Задание = Задание;
	Запись.ДатаЗаписи = ТекущаяДата();
	Если ЗначениеЗаполнено(КлючПараметр) Тогда
		Запись.КлючПараметров = КлючПараметр;
		Если ЗначениеЗаполнено(СтруктураПараметров) Тогда
			Запись.СтрокаJson = СтруктураПараметровВСтрокуJSON(СтруктураПараметров);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров) Тогда
		Запись.КлючПараметров = "Истина";
		Запись.СтрокаJson = СтруктураПараметровВСтрокуJSON(СтруктураПараметров);
	КонецЕсли;
	Если ЗначениеЗаполнено(ОтложеноДо) Тогда
		Запись.ОтложеноДо = ОтложеноДо; 
	КонецЕсли;
	Запись.Записать(Истина);
КонецПроцедуры 

Функция СтруктураПараметровВСтрокуJSON(СтруктураПараметров)   
	//ЗаписьJSON = Новый ЗаписьJSON;
	//ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	//ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON;
	//ЗаписьJSON.ОткрытьФайл("ИмяФайла",,,ПараметрыЗаписиJSON);
	//ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров, Новый НастройкиСериализацииJSON);  
	Структура = Новый Структура;
	Для каждого эл из СтруктураПараметров Цикл
		Если ТипЗнч(Эл.Значение) = Тип("Строка")
			или ТипЗнч(Эл.Значение) = Тип("Число")
			или ТипЗнч(Эл.Значение) = Тип("Булево") 
			или Эл.Значение = Неопределено 
			Тогда
			Структура.Вставить(эл.Ключ, эл.Значение);
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Эл.Значение) = Тип("Дата") Тогда
			Массив = Новый Массив; 
			Массив.Добавить("Дата");
			Массив.Добавить(эл.Значение);
			Структура.Вставить(эл.Ключ, Массив);
			Продолжить;
		КонецЕсли; 
		// <-- Пантелеев Д.И. 17.04.2023, Ссылка на задачу в Redmine (Jira): SD-22910 
		Если ТипЗнч(Эл.Значение) = Тип("ТаблицаЗначений") Тогда   
			Массив = Новый Массив; 
			Массив.Добавить("ТаблицаЗначений"); 
			МассивСтруктур = ТЗВСтруктуру(эл.Значение);
			Для каждого элМС из МассивСтруктур Цикл
				Массив.Добавить(СтруктураПараметровВСтрокуJSON(элМС));
			КонецЦикла;
			Структура.Вставить(эл.Ключ, Массив);
			Продолжить;
		КонецЕсли;	
		// --> Пантелеев Д.И. 17.04.2023
		Массив = Новый Массив; 
		Тип = Метаданные.НайтиПоТипу(ТипЗнч(эл.Значение)).ПолноеИмя();
		Массив.Добавить(Тип); 
		Если СтрНайти(Тип, "Перечисление") Тогда
			Массив.Добавить(Перечисления[эл.Значение.Метаданные().Имя].Индекс(эл.Значение)); 
		Иначе 
			Массив.Добавить(Строка(эл.Значение.УникальныйИдентификатор())); 
		КонецЕсли;
		Структура.Вставить(эл.Ключ, Массив);
	КонецЦикла;
	ЗначенияJSON = Новый ЗаписьJSON;
	ЗначенияJSON.ПроверятьСтруктуру = Ложь;
	ЗначенияJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗначенияJSON, Структура,);
	Возврат ЗначенияJSON.Закрыть();
	//СтрокаJSON = ЗначенияJSON.Закрыть(); 
	//Возврат СтрЗаменить(СтрЗаменить(СтрокаJSON, "\r\n", Символы.ПС), "\", ""); 
КонецФункции 

Функция ТЗВСтруктуру(ТабЗначений)

	Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабЗначений);
	КоллекцияКолонок = ТабЗначений.Колонки;	
	
	Для каждого ТекЭлемента из Результат Цикл		
		Для каждого ТекКолонки из КоллекцияКолонок Цикл
			мЗначение	=	ТекЭлемента[ТекКолонки.имя];
			ТекЭлемента[ТекКолонки.имя]	= мЗначение;			
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции


Процедура ВыполнитьЗадание(Задание, СтруктураПараметров = Неопределено, ЕстьОшибка = "") 
	Если Задание.Отключено Тогда
		ЕстьОшибка = "Задание отключено";
		Возврат;
	КонецЕсли; 
	
	Для Каждого Шаг Из Задание.Сценарий Цикл
		ОтказОтПродолжения = Ложь;
		Если СтрДлина(Шаг.КомандаСценария) > 15 И Лев(Шаг.КомандаСценария, 15) = "СоздатьЗадание(" Тогда
			ПозОконч = СтрНайти(Шаг.КомандаСценария, ",",,1,1);
			Если ПозОконч > 16 Тогда
				ИмяЗадания = Сред(Шаг.КомандаСценария, 16, ПозОконч - 16); 
				НовоеЗадание = Неопределено;
				Для каждого ЭлементСтруктуры Из СтруктураПараметров Цикл
					Если ЭлементСтруктуры.Ключ = ИмяЗадания Тогда
						НовоеЗадание = ЭлементСтруктуры.Значение;	
					КонецЕсли;				
				КонецЦикла;
				Если ЗначениеЗаполнено(НовоеЗадание) Тогда
					СоздатьЗадание(НовоеЗадание, СтруктураПараметров, ОтказОтПродолжения, ЕстьОшибка);
				Иначе
					ЕстьОшибка = "Не удалось создать задание";
				КонецЕсли;
			Иначе
				ЕстьОшибка = "Не удалось создать задание";
			КонецЕсли;
		Иначе
			ВыполнитьШагЗадания(Шаг.КомандаСценария, СтруктураПараметров, ОтказОтПродолжения, ЕстьОшибка);
		КонецЕсли;
		Если ОтказОтПродолжения Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

  
Процедура ВыполнитьШагЗадания(ТекстКоманды, СтруктураПараметров = Неопределено, ОтказОтПродолжения, ЕстьОшибка = "")
	Если ЗначениеЗаполнено(ТекстКоманды) Тогда
		Выполнить(ТекстКоманды);
	КонецЕсли;
	Если ЕстьОшибка <> "" Тогда
		 ОтказОтПродолжения = Истина;
	КонецЕсли;
КонецПроцедуры     

Процедура СкриптВосстановления(СтруктураПараметров = Неопределено, ЕстьОшибка = "")

	ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
	ОЛАПСоединение.CursorLocation=3;
	Пароль = СтруктураПараметров.База.Сервер.Пароль;
	Пользователь = СтруктураПараметров.База.Сервер.Агент;
	Сервер = СтруктураПараметров.База.Сервер.Наименование;

	ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password="+Пароль+";Persist Security Info=True;User ID="+Пользователь+";Initial Catalog=master;Data Source="+Сервер;
	ОЛАПСоединение.Open();
	
	ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
	ExecuteOptionEnum = Новый Структура ("adAsyncExecute, adAsyncFetch, adAsyncFetchNonBlocking, adExecuteNoRecords, adExecuteStream, adOptionUnspecified", 16, 32, 64, 128, 1024, -1);
			
	ЗапросАДО.CommandText = "dbo.DatabaseRestoreAdm";
	ЗапросАДО.CommandType=4;
	ЗапросАДО.CommandTimeout = 300;
	ЗапросАДО.ActiveConnection = ОЛАПСоединение;
	
	ЗапросАДО.Parameters.Item("@databaseName").Value=Строка(СтруктураПараметров.База.Владелец.Наименование);
	ЗапросАДО.Parameters.Item("@serverName").Value=СтруктураПараметров.База.Владелец.Сервер.Наименование;
	ЗапросАДО.Parameters.Item("@pathBackup").Value=СтруктураПараметров.База.Владелец.Сервер.ПутьКБекапам;
	ЗапросАДО.Parameters.Item("@pathNetBackup").Value=СтруктураПараметров.База.Владелец.Сервер.ПутьКБекапамСетевой;
	ЗапросАДО.Parameters.Item("@databaseNameNew").Value=СтруктураПараметров.База.Наименование;
	ЗапросАДО.Parameters.Item("@DirectoryRestoreData").Value=СтруктураПараметров.База.Сервер.ПутьКДанным;
	ЗапросАДО.Parameters.Item("@DirectoryRestoreLog").Value=СтруктураПараметров.База.Сервер.ПутьКЛогам;
	UUID = UUIDизСсылки(СтруктураПараметров.Задание);
	ЗапросАДО.Parameters.Item("@sID").Value=UUID;
	ЗапросАДО.Parameters.Item("@IDstr").Value=СтруктураПараметров.КлючПараметров;
	
	ЗапросАДО.Parameters.Item("@pathBackupDIFF").Value=СтруктураПараметров.База.Владелец.Сервер.ПутьКБекапамDIFF;
	ЗапросАДО.Parameters.Item("@pathNetBackupDIFF").Value=СтруктураПараметров.База.Владелец.Сервер.ПутьКБекапамDIFFСетевой;

	ЗапросАДО.Parameters.Item("@pathBackupLOG").Value=СтруктураПараметров.База.Владелец.Сервер.ПутьКБекапамLOG;
	ЗапросАДО.Parameters.Item("@pathNetBackupLOG").Value=СтруктураПараметров.База.Владелец.Сервер.ПутьКБекапамLOGСетевой;


	НаборЗаписейАДО = Новый COMОбъект("ADODB.RecordSet");

	НаборЗаписейАДО = ЗапросАДО.Execute();
	СкриптВосстановления = "";

	Пока НаборЗаписейАДО.EOF()=0 Цикл
	    СкриптВосстановления = НаборЗаписейАДО.Fields(0).Value; 
	    НаборЗаписейАДО.MoveNext();
	КонецЦикла;

	ОЛАПСоединение.Close();
	
	Если СкриптВосстановления = "" Тогда
		ЕстьОшибка = "Скрипт не сформирован";
	Иначе
		ЕстьОшибка = "";
	КонецЕсли;
КонецПроцедуры

Процедура СкриптВосстановленияНовойВерсииЕРП(СтруктураПараметров = Неопределено, ЕстьОшибка = "") 
	
	ИмяБазыСВерсией = "";
	ЭлСервер = Справочники.SQLСервера.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SQLDBРабочие.Наименование КАК Наименование,
		|	SQLDBРабочие.Сервер КАК Сервер
		|ИЗ
		|	Справочник.SQLDBРабочие КАК SQLDBРабочие
		|ГДЕ
		|	SQLDBРабочие.ИмяПредопределенныхДанных = &ИмяВладельца";
	
	Запрос.УстановитьПараметр("ИмяВладельца", Строка(СтруктураПараметров.База.Владелец.Наименование));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИмяБазыСВерсией = ВыборкаДетальныеЗаписи.Наименование; 
		ЭлСервер = ВыборкаДетальныеЗаписи.Сервер;
	КонецЦикла;
	
	Если ИмяБазыСВерсией <> "" И ЗначениеЗаполнено(ЭлСервер) Тогда

		ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
		ОЛАПСоединение.CursorLocation=3;
		Пароль = СтруктураПараметров.База.Сервер.Пароль;
		Пользователь = СтруктураПараметров.База.Сервер.Агент;
		Сервер = СтруктураПараметров.База.Сервер.Наименование;

		ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password="+Пароль+";Persist Security Info=True;User ID="+Пользователь+";Initial Catalog=master;Data Source="+Сервер;
		ОЛАПСоединение.Open();
		
		ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
		ExecuteOptionEnum = Новый Структура ("adAsyncExecute, adAsyncFetch, adAsyncFetchNonBlocking, adExecuteNoRecords, adExecuteStream, adOptionUnspecified", 16, 32, 64, 128, 1024, -1);
				
		ЗапросАДО.CommandText = "dbo.DatabaseRestoreAdm";
		ЗапросАДО.CommandType=4;
		ЗапросАДО.CommandTimeout = 300;
		ЗапросАДО.ActiveConnection = ОЛАПСоединение;
		
		ЗапросАДО.Parameters.Item("@databaseName").Value=ИмяБазыСВерсией;
		ЗапросАДО.Parameters.Item("@serverName").Value=ЭлСервер.Наименование;
		ЗапросАДО.Parameters.Item("@pathBackup").Value=ЭлСервер.ПутьКБекапам;
		ЗапросАДО.Parameters.Item("@pathNetBackup").Value=ЭлСервер.ПутьКБекапамСетевой;
		ЗапросАДО.Parameters.Item("@databaseNameNew").Value=СтруктураПараметров.База.Наименование;
		ЗапросАДО.Parameters.Item("@DirectoryRestoreData").Value=СтруктураПараметров.База.Сервер.ПутьКДанным;
		ЗапросАДО.Parameters.Item("@DirectoryRestoreLog").Value=СтруктураПараметров.База.Сервер.ПутьКЛогам;
		UUID = UUIDизСсылки(СтруктураПараметров.Задание);
		ЗапросАДО.Parameters.Item("@sID").Value=UUID;
		ЗапросАДО.Parameters.Item("@IDstr").Value=СтруктураПараметров.КлючПараметров;  
		
		ЗапросАДО.Parameters.Item("@pathBackupDIFF").Value=ЭлСервер.ПутьКБекапамDIFF;
		ЗапросАДО.Parameters.Item("@pathNetBackupDIFF").Value=ЭлСервер.ПутьКБекапамDIFFСетевой;

		ЗапросАДО.Parameters.Item("@pathBackupLOG").Value=ЭлСервер.ПутьКБекапамLOG;
		ЗапросАДО.Parameters.Item("@pathNetBackupLOG").Value=ЭлСервер.ПутьКБекапамLOGСетевой;

		НаборЗаписейАДО = Новый COMОбъект("ADODB.RecordSet");

		НаборЗаписейАДО = ЗапросАДО.Execute();
		СкриптВосстановления = "";
		
		Пока НаборЗаписейАДО.EOF()=0 Цикл
		    СкриптВосстановления = НаборЗаписейАДО.Fields(0).Value; 
		    НаборЗаписейАДО.MoveNext();
		КонецЦикла;

		ОЛАПСоединение.Close(); 
	
		Если СкриптВосстановления = "" Тогда
			ЕстьОшибка = "Скрипт не сформирован";
		Иначе
			ЕстьОшибка = "";
		КонецЕсли;
	Иначе
		ЕстьОшибка = "Не найдена база с новой версией";
	КонецЕсли;
КонецПроцедуры

Процедура СкриптВосстановленияDCT(СтруктураПараметров = Неопределено, ЕстьОшибка = "")  
	
	
	ИмяБазыDCT = "";
	ЭлСервер = Справочники.SQLСервера.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SQLDBТестовые.Наименование КАК Наименование,
		|	SQLDBТестовые.Сервер КАК Сервер
		|ИЗ
		|	Справочник.SQLDBРабочие КАК SQLDBРабочие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.SQLDBТестовые КАК SQLDBТестовые
		|		ПО (SQLDBРабочие.БазаDCT = SQLDBТестовые.Ссылка)
		|ГДЕ
		|	SQLDBРабочие.Ссылка = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", СтруктураПараметров.База.Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИмяБазыDCT = ВыборкаДетальныеЗаписи.Наименование; 
		ЭлСервер = ВыборкаДетальныеЗаписи.Сервер;
	КонецЦикла;
	
	Если ИмяБазыDCT <> "" И ЗначениеЗаполнено(ЭлСервер) Тогда
       	ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
		ОЛАПСоединение.CursorLocation=3;
		Пароль = СтруктураПараметров.База.Сервер.Пароль;
		Пользователь = СтруктураПараметров.База.Сервер.Агент;
		Сервер = СтруктураПараметров.База.Сервер.Наименование;

		ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password="+Пароль+";Persist Security Info=True;User ID="+Пользователь+";Initial Catalog=master;Data Source="+Сервер;
		ОЛАПСоединение.Open();
		
		ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
		ExecuteOptionEnum = Новый Структура ("adAsyncExecute, adAsyncFetch, adAsyncFetchNonBlocking, adExecuteNoRecords, adExecuteStream, adOptionUnspecified", 16, 32, 64, 128, 1024, -1);
				
		ЗапросАДО.CommandText = "dbo.DatabaseRestoreAdm";
		ЗапросАДО.CommandType=4;
		ЗапросАДО.CommandTimeout = 300;
		ЗапросАДО.ActiveConnection = ОЛАПСоединение;
		
		ЗапросАДО.Parameters.Item("@databaseName").Value=ИмяБазыDCT;
		ЗапросАДО.Parameters.Item("@serverName").Value=ЭлСервер.Наименование;
		ЗапросАДО.Parameters.Item("@pathBackup").Value=ЭлСервер.ПутьКБекапам;
		ЗапросАДО.Parameters.Item("@pathNetBackup").Value=ЭлСервер.ПутьКБекапамСетевой;
		ЗапросАДО.Parameters.Item("@databaseNameNew").Value=СтруктураПараметров.База.Наименование;
		ЗапросАДО.Parameters.Item("@DirectoryRestoreData").Value=СтруктураПараметров.База.Сервер.ПутьКДанным;
		ЗапросАДО.Parameters.Item("@DirectoryRestoreLog").Value=СтруктураПараметров.База.Сервер.ПутьКЛогам;
		UUID = UUIDизСсылки(СтруктураПараметров.Задание);
		ЗапросАДО.Parameters.Item("@sID").Value=UUID;
		ЗапросАДО.Parameters.Item("@IDstr").Value=СтруктураПараметров.КлючПараметров;  
		
		ЗапросАДО.Parameters.Item("@pathBackupDIFF").Value=ЭлСервер.ПутьКБекапамDIFF;
		ЗапросАДО.Parameters.Item("@pathNetBackupDIFF").Value=ЭлСервер.ПутьКБекапамDIFFСетевой;

		ЗапросАДО.Parameters.Item("@pathBackupLOG").Value=ЭлСервер.ПутьКБекапамLOG;
		ЗапросАДО.Parameters.Item("@pathNetBackupLOG").Value=ЭлСервер.ПутьКБекапамLOGСетевой;

		НаборЗаписейАДО = Новый COMОбъект("ADODB.RecordSet");

		НаборЗаписейАДО = ЗапросАДО.Execute();
		СкриптВосстановления = "";
		
		Пока НаборЗаписейАДО.EOF()=0 Цикл
		    СкриптВосстановления = НаборЗаписейАДО.Fields(0).Value; 
		    НаборЗаписейАДО.MoveNext();
		КонецЦикла;

		ОЛАПСоединение.Close(); 
	
		Если СкриптВосстановления = "" Тогда
			ЕстьОшибка = "Скрипт не сформирован";
		Иначе
			ЕстьОшибка = "";
		КонецЕсли;
	Иначе
		ЕстьОшибка = "Не найдена база DCT";
	КонецЕсли;
КонецПроцедуры


Процедура ВыполнитьВосстановление(СтруктураПараметров = Неопределено, ЕстьОшибка = "")

	ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
	ОЛАПСоединение.CursorLocation=3;
	Пароль = СтруктураПараметров.База.Сервер.Пароль;
	Пользователь = СтруктураПараметров.База.Сервер.Агент;
	Сервер = СтруктураПараметров.База.Сервер.Наименование;

	ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password="+Пароль+";Persist Security Info=True;User ID="+Пользователь+";Initial Catalog=msdb;Data Source="+Сервер;
	ОЛАПСоединение.Open(); 

	ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
	ЗапросАДО.CommandText = "sp_start_job";
	ЗапросАДО.CommandType=4;
	ЗапросАДО.CommandTimeout = 300;
	ЗапросАДО.ActiveConnection = ОЛАПСоединение;
	ЗапросАДО.Parameters.Item("@job_name").Value="DatabaseRestoreAdm";  
Попытка
	ЗапросАДО.Execute();
Исключение
	ЕстьОшибка = ОписаниеОшибки();
КонецПопытки;

	ОЛАПСоединение.Close();

	ЕстьОшибка = "";

КонецПроцедуры  

Процедура ВыполнитьОповещение(СтруктураПараметров = Неопределено, ЕстьОшибка = "")

	Результат = Ложь;
	Счетчик = 0;
	Ошибка = "";

	Пока Не Результат И Счетчик < 100 Цикл
		ОбновлениеСервер.Пауза(3);
		Результат = ПроверитьСостояниеВосстановления(СтруктураПараметров, Ошибка);
 		Счетчик = Счетчик + 1;
	КонецЦикла;

	Если Результат Тогда
		ЕстьОшибка = Ошибка;
		Если Ошибка = "" Тогда
			Ошибка = "Обновление успешно завершено";
		Иначе
			ЕстьОшибка = "Не завершилось задание";
		КонецЕсли;
        СообщитьОВыполнении(СтруктураПараметров, Ошибка);  
		УведомитьУправляющийПроцесс(СтруктураПараметров, ЕстьОшибка);
	КонецЕсли;
	
КонецПроцедуры  

Процедура ВыполнитьОповещениеРезервноеКопирование(СтруктураПараметров = Неопределено, ЕстьОшибка = "")

	Результат = Ложь;
	Счетчик = 0;
	Ошибка = "";

	Пока Не Результат И Счетчик < 100 Цикл
		ОбновлениеСервер.Пауза(3);
		Результат = ПроверитьСостояниеРезервногоКопирования(СтруктураПараметров, Ошибка);
 		Счетчик = Счетчик + 1;
	КонецЦикла;

	Если Результат Тогда
		ЕстьОшибка = Ошибка;
		Если Ошибка = "" Тогда
			Ошибка = "Резервное копирование успешно завершено";
		Иначе
			ЕстьОшибка = "Не завершилось задание";
		КонецЕсли;
        СообщитьОВыполнении(СтруктураПараметров, Ошибка, " - резервное копирование базы");
		УведомитьУправляющийПроцесс(СтруктураПараметров, ЕстьОшибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОповещениеСокращение(СтруктураПараметров = Неопределено, ЕстьОшибка = "")

	Результат = Ложь;
	Счетчик = 0;
	Ошибка = "";

	Пока Не Результат И Счетчик < 100 Цикл
		ОбновлениеСервер.Пауза(3);
		Результат = ПроверитьСостояниеСокращения(СтруктураПараметров, Ошибка);
 		Счетчик = Счетчик + 1;
	КонецЦикла;

	Если Результат Тогда
		ЕстьОшибка = Ошибка;
		Если Ошибка = "" Тогда
			Ошибка = "Сокращение успешно завершено";
		Иначе
			ЕстьОшибка = "Не завершилось задание";
		КонецЕсли;
        СообщитьОВыполнении(СтруктураПараметров, Ошибка, " - сокращение базы"); 
		УведомитьУправляющийПроцесс(СтруктураПараметров, ЕстьОшибка);
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщитьОВыполнении(СтруктураПараметров = Неопределено, Сообщение, Тема = " - обновление копии базы")
	
	ЗапросКИ = Новый Запрос;
	ЗапросКИ.Текст = 
		"ВЫБРАТЬ
		|	ПользователиКонтактнаяИнформация.АдресЭП КАК АдресЭП
		|ИЗ
		|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
		|ГДЕ
		|	ПользователиКонтактнаяИнформация.Ссылка = &Пользователь
		|	И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
	
	ЗапросКИ.УстановитьПараметр("Пользователь", СтруктураПараметров.Пользователь);
	
	РезультатЗапросаКИ = ЗапросКИ.Выполнить();
	
	ВыборкаДетальныеЗаписиКИ = РезультатЗапросаКИ.Выбрать(); 
	Кому = "";
    Пока ВыборкаДетальныеЗаписиКИ.Следующий() Цикл
    	 Кому = Строка(СтруктураПараметров.Пользователь) + " <" + ВыборкаДетальныеЗаписиКИ.АдресЭП +">";
  	КонецЦикла;
 	Если Кому = "" Тогда
		Кому = Строка(СтруктураПараметров.Пользователь) + " <help@istk.ru>";
	КонецЕсли;

	ИмяБазы = СтруктураПараметров.База.Наименование;
	ИмяБазы = Прав(ИмяБазы, СтрДлина(ИмяБазы)-1);
	ПараметрыОтправки = Новый Структура("Кому,Копии,Тема,Тело,",
			Кому,
			"baklanov@ks-technology.ru",
			ИмяБазы + Тема,
			Сообщение);

	РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(
		Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,
		ПараметрыОтправки);
	
КонецПроцедуры
	
Процедура УведомитьУправляющийПроцесс(СтруктураПараметров = Неопределено, Сообщение)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Задание КАК Задание
	|ИЗ
	|	РегистрСведений.SQLВыполнениеЗаданий КАК Т
	|ГДЕ
	|	(Т.Задание.ТипЗадания = ЗНАЧЕНИЕ(Перечисление.sqlТипыЗаданий.Управление) И Т.КлючПараметров = &КлючПараметров) 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.ДатаЗаписи";
	Запрос.УстановитьПараметр("КлючПараметров", СтруктураПараметров.КлючПараметров);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Задание = Выборка.Задание;
		
		Набор = РегистрыСведений.SQLВыполнениеЗаданий.СоздатьНаборЗаписей();
		Набор.Отбор.Задание.Значение = Задание;
		Набор.Отбор.Задание.Использование = Истина;
		Набор.Отбор.КлючПараметров.Значение = СтруктураПараметров.КлючПараметров;
		Набор.Отбор.КлючПараметров.Использование = Истина;
		Набор.Прочитать();
		Если Набор.Количество() = 1 Тогда 
			Если Сообщение = "" Тогда
				Набор[0].РезультатВыполнения = Ложь;
				Набор[0].НачалоВыполнения = ДАТА(1,1,1,0,0,0);
			Иначе
				Набор[0].РезультатВыполнения = Истина;
			КонецЕсли;
			Набор[0].ОшибкаВыполнения = Сообщение;
			Набор[0].ДатаВыполнения = ТекущаяДата(); 
			Набор[0].КоличествоПопыток = 1; 
		КонецЕсли;
		Набор.Записать();
	КонецЦикла;

			
КонецПроцедуры

Функция ПроверитьСостояниеВосстановления(СтруктураПараметров = Неопределено, Ошибка = "") 
	
	Результат = Ложь;
	РезультатВПроцедуре = 0;
	
	ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
	ОЛАПСоединение.CursorLocation=3;
	Пароль = СтруктураПараметров.База.Сервер.Пароль;
	Пользователь = СтруктураПараметров.База.Сервер.Агент;
	Сервер = СтруктураПараметров.База.Сервер.Наименование;

	ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password="+Пароль+";Persist Security Info=True;User ID="+Пользователь+";Initial Catalog=master;Data Source="+Сервер;
	ОЛАПСоединение.Open(); 
	
	ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
	ЗапросАДО.CommandText = "CheckStatusDatabaseRestoreAdm";
	ЗапросАДО.CommandType=4;
	ЗапросАДО.CommandTimeout = 60;
	ЗапросАДО.ActiveConnection = ОЛАПСоединение;
	UUID = UUIDизСсылки(СтруктураПараметров.Задание);
	ЗапросАДО.Parameters.Item("@sID").Value=UUID;
	ЗапросАДО.Parameters.Item("@IDstr").Value=СтруктураПараметров.КлючПараметров;

	НаборЗаписейАДО = Новый COMОбъект("ADODB.RecordSet");
	НаборЗаписейАДО = ЗапросАДО.Execute();

	Пока НаборЗаписейАДО.EOF()=0 Цикл
	    РезультатВПроцедуре = НаборЗаписейАДО.Fields(0).Value; 
	    Ошибка = НаборЗаписейАДО.Fields(1).Value;
	    НаборЗаписейАДО.MoveNext();
	КонецЦикла;  

	Если РезультатВПроцедуре = 1 ИЛИ Ошибка <> "" Тогда
		Результат = Истина;
	КонецЕсли;  
	
	ОЛАПСоединение.Close();
	
	Возврат Результат;
	
КонецФункции 

Функция ПроверитьСостояниеРезервногоКопирования(СтруктураПараметров = Неопределено, Ошибка = "") 
	
	Результат = Ложь;
	РезультатВПроцедуре = 0; 
	НачалоВыполнения = ПолучитьНачалоВыполнения(СтруктураПараметров.Задание, СтруктураПараметров.КлючПараметров);
	Если НачалоВыполнения <> ДАТА(1,1,1,0,0,0) Тогда
		ПараметрНачалоВыполнения = XMLСтрока(НачалоВыполнения) + ".000";
	
	ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
	ОЛАПСоединение.CursorLocation=3;
	Пароль = СтруктураПараметров.База.Сервер.Пароль;
	Пользователь = СтруктураПараметров.База.Сервер.Агент;
	Сервер = СтруктураПараметров.База.Сервер.Наименование;

	ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password="+Пароль+";Persist Security Info=True;User ID="+Пользователь+";Initial Catalog=master;Data Source="+Сервер;
	ОЛАПСоединение.Open(); 
	
	ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
	ЗапросАДО.CommandText = "CheckStatusDatabaseBackup";
	ЗапросАДО.CommandType=4;
	ЗапросАДО.CommandTimeout = 60;
	ЗапросАДО.ActiveConnection = ОЛАПСоединение;
	UUID = UUIDизСсылки(СтруктураПараметров.Задание);
	ЗапросАДО.Parameters.Item("@sID").Value=UUID;
	ЗапросАДО.Parameters.Item("@IDstr").Value=СтруктураПараметров.КлючПараметров;

	НаборЗаписейАДО = Новый COMОбъект("ADODB.RecordSet");
	НаборЗаписейАДО = ЗапросАДО.Execute();

	Пока НаборЗаписейАДО.EOF()=0 Цикл
	    РезультатВПроцедуре = НаборЗаписейАДО.Fields(0).Value; 
	    Ошибка = НаборЗаписейАДО.Fields(1).Value;
	    НаборЗаписейАДО.MoveNext();
	КонецЦикла;  

	Если РезультатВПроцедуре = 1 ИЛИ Ошибка <> "" Тогда
		Результат = Истина;
	КонецЕсли;  
	
	ОЛАПСоединение.Close();  
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции  

Функция ПроверитьСостояниеСокращения(СтруктураПараметров = Неопределено, Ошибка = "")
	
	Результат = Ложь; 
	НачалоВыполнения = ПолучитьНачалоВыполнения(СтруктураПараметров.Задание, СтруктураПараметров.КлючПараметров);
	Если НачалоВыполнения <> ДАТА(1,1,1,0,0,0) Тогда
		ПутьВыгрузки = Константы.ПутьDatabaseCompressionTool.Получить();
		Поз = СтрНайти(ПутьВыгрузки, "\",НаправлениеПоиска.СКонца);
		Если Поз > 0 Тогда  
			ПутьККаталогу = Лев(ПутьВыгрузки, Поз-1);
		КонецЕсли; 
		ФайлыЛогов = Новый Массив;
	    ФайлыЛогов = НайтиФайлы(ПутьККаталогу, "*.txt"); 
		ИскомыйФайл = "";
		Для Каждого ФайлXLS Из ФайлыЛогов Цикл 
			Если ФайлXLS.Существует() И ФайлXLS.ПолучитьВремяИзменения() > НачалоВыполнения Тогда
				ИскомыйФайл = ПутьККаталогу + "\" + ФайлXLS.Имя;
				Прервать;
	        КонецЕсли;
		КонецЦикла; 
		Если ИскомыйФайл <> "" Тогда
			Текст = Новый ТекстовыйДокумент;
			Текст.Прочитать(ИскомыйФайл);
			КоличествоСтрок = Текст.КоличествоСтрок();
			Для Строка = 1 По КоличествоСтрок Цикл
				СтрокаДляРазбора = Текст.ПолучитьСтроку(Строка);
				Если СтрокаДляРазбора = "Конвертация завершена." Тогда
					Результат = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
КонецФункции    

Функция ПроверитьСостояниеУправления(СтруктураПараметров = Неопределено, Ошибка = "")
	Результат = Ложь;
	Возврат Результат;
КонецФункции   

Процедура ВыполнитьРезервноеКопирование(СтруктураПараметров = Неопределено, ЕстьОшибка = "")

	ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
	ОЛАПСоединение.CursorLocation=3;
	Пароль = СтруктураПараметров.База.Сервер.Пароль;
	Пользователь = СтруктураПараметров.База.Сервер.Агент;
	Сервер = СтруктураПараметров.База.Сервер.Наименование;

	ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password="+Пароль+";Persist Security Info=True;User ID="+Пользователь+";Initial Catalog=master;Data Source="+Сервер;
	ОЛАПСоединение.Open(); 

	ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
	ЗапросАДО.CommandText = "DatabaseBackupAdm";
	ЗапросАДО.CommandType=4;
	ЗапросАДО.CommandTimeout = 300;
	ЗапросАДО.ActiveConnection = ОЛАПСоединение;
	UUID = UUIDизСсылки(СтруктураПараметров.Задание);
	ЗапросАДО.Parameters.Item("@sID").Value=UUID;
	ЗапросАДО.Parameters.Item("@IDstr").Value=СтруктураПараметров.КлючПараметров;
	ЗапросАДО.Parameters.Item("@Database").Value = СтруктураПараметров.База.Наименование;  
Попытка
	ЗапросАДО.Execute();
Исключение
	ЕстьОшибка = ОписаниеОшибки();
КонецПопытки;

	ОЛАПСоединение.Close();

	ЕстьОшибка = "";

КонецПроцедуры 
	

Функция ПолучитьНачалоВыполнения(Задание, КлючПараметров)
	Рез = ДАТА(1,1,1,0,0,0); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	Т.НачалоВыполнения КАК НачалоВыполнения
	|ИЗ
	|	РегистрСведений.SQLВыполнениеЗаданий КАК Т
	|ГДЕ
	|	Т.Задание = &Задание
	|	И Т.КлючПараметров = &КлючПараметров"; 
	
    Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("КлючПараметров", КлючПараметров);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Рез = Выборка.НачалоВыполнения; 
	КонецЦикла;
	
	Возврат Рез;	
КонецФункции


Процедура УстановитьЗавершениеЗаданий() Экспорт
	
	ТекЗадание = ЗаданиеПроверить();
	Пока ЗначениеЗаполнено(ТекЗадание.Задание) Цикл 
		СтруктураПараметров = Новый Структура;
		Если Не ТекЗадание.КлючПараметров = "" Тогда
			СтруктураПараметров = СтрокаJSONВСтруктуруПараметров(ТекЗадание.СтрокаJson);
			Если Не СтруктураПараметров.Свойство("Задание") Тогда
				СтруктураПараметров.Вставить("Задание", ТекЗадание.Задание);
			КонецЕсли;   
			Если Не СтруктураПараметров.Свойство("КлючПараметров") Тогда
				СтруктураПараметров.Вставить("КлючПараметров", ТекЗадание.КлючПараметров);
			КонецЕсли;   
		Иначе
			СтруктураПараметров.Вставить("Задание", ТекЗадание.Задание);
		КонецЕсли;
		Результат = Ложь;
		Ошибка = ""; 
		Если ТекЗадание.Задание.ТипЗадания = Перечисления.sqlТипыЗаданий.Восстановление Тогда
			Результат = ПроверитьСостояниеВосстановления(СтруктураПараметров, Ошибка); 
		ИначеЕсли ТекЗадание.Задание.ТипЗадания = Перечисления.sqlТипыЗаданий.РезервноеКопирование Тогда	
			Результат = ПроверитьСостояниеРезервногоКопирования(СтруктураПараметров, Ошибка); 
		ИначеЕсли ТекЗадание.Задание.ТипЗадания = Перечисления.sqlТипыЗаданий.Сокращение Тогда	
			Результат = ПроверитьСостояниеСокращения(СтруктураПараметров, Ошибка);
		ИначеЕсли ТекЗадание.Задание.ТипЗадания = Перечисления.sqlТипыЗаданий.Управление Тогда	
			Результат = ПроверитьСостояниеУправления(СтруктураПараметров, Ошибка);
		КонецЕсли;
		Если Результат Тогда
			Набор = РегистрыСведений.SQLВыполнениеЗаданий.СоздатьНаборЗаписей();
		    Набор.Отбор.Задание.Значение = ТекЗадание.Задание;
		    Набор.Отбор.Задание.Использование = Истина;
		    Набор.Отбор.КлючПараметров.Значение = ТекЗадание.КлючПараметров;
		    Набор.Отбор.КлючПараметров.Использование = Истина;
		    Набор.Прочитать();
			Если Набор.Количество() = 1 Тогда
				Если Набор[0].РезультатВыполнения = Ложь И НЕ ЗначениеЗаполнено(Набор[0].ОшибкаВыполнения) Тогда
                    ЕстьОшибка = Ошибка;
					Если Ошибка = "" Тогда
						Ошибка = "Обновление успешно завершено";
						Набор[0].РезультатВыполнения = Истина;
					Иначе 
						Набор[0].ОшибкаВыполнения = Ошибка;
						ЕстьОшибка = "Не завершилось задание";
					КонецЕсли; 
					Если Набор[0].ДатаВыполнения = ДАТА(1,1,1,0,0,0) Тогда
			    		Набор[0].ДатаВыполнения = ТекущаяДата();
					КонецЕсли;
			    	Набор[0].КоличествоПопыток = Набор[0].КоличествоПопыток + 1;
			        СообщитьОВыполнении(СтруктураПараметров, Ошибка); 
					Набор.Записать(); 
					//26.11.2024
					УведомитьУправляющийПроцесс(СтруктураПараметров, ЕстьОшибка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		СтароеЗадание = ТекЗадание;
		ТекЗадание = ЗаданиеПроверить(СтароеЗадание.Задание, СтароеЗадание.КлючПараметров);
	КонецЦикла;
		
КонецПроцедуры

Процедура ВыполнитьСценарий(СтруктураПараметров = Неопределено, ЕстьОшибка = "")
    ПараметрКоманды = СтруктураПараметров.Сценарий; 
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ЗД_Модуль_oscript_Привелегированный.ВыполнитьСкрипт(ПараметрКоманды);
	Иначе
		ЕстьОшибка = "Не заполнен сценарий";
	КонецЕсли;
КонецПроцедуры 

Функция UUIDизСсылки(Ссылка)
	UUID = "0x00";
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ЗначениеЗадание=ЗначениеВСтрокуВнутр(Ссылка);
		СтрЗадание = Сред(ЗначениеЗадание, 2, СтрДлина(ЗначениеЗадание)-2);
		УУИДстр = ВРЕГ(Сред(СтрЗадание, Найти(СтрЗадание, ":")+1));
		UUID = "0x"+УУИДстр; 
	КонецЕсли;

	Возврат UUID;
	
КонецФункции

#Область Статистика_sql



Процедура ЗаполнитьСтатистику() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	dbo_View_1.program_name КАК Показатель,
		|	dbo_View_1.Expr1 КАК Соединений,
		|	&ДатаЗапроса КАК ДатаЗаписи
		|ИЗ
		|	ВнешнийИсточникДанных.ks_tech.Таблица.dbo_View_1 КАК dbo_View_1";
	
	Запрос.УстановитьПараметр("ДатаЗапроса", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МЗ = РегистрыСведений.СтатистикаСоединенийMSSQL.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ,ВыборкаДетальныеЗаписи);
		МЗ.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры




#КонецОбласти

Процедура ПодготовкаАвтоТеста() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ TOP 1 
		|	SQLЗадания.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.SQLЗадания КАК SQLЗадания
		|ГДЕ
		|	SQLЗадания.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", "Обновление Автотеста");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Задание = ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
	
	Структура = Новый Структура; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  
		|	Т.Параметр КАК Параметр
		|	,Т.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
		|ИЗ
		|	РегистрСведений.ЗапускЗаданияSQLЗначенияПоУмолчанию КАК Т
		|ГДЕ
		|	Т.SQLЗадания = &SQLЗадания";
	
	Запрос.УстановитьПараметр("SQLЗадания", Задание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура.Вставить(ВыборкаДетальныеЗаписи.Параметр, ВыборкаДетальныеЗаписи.ЗначениеПоУмолчанию); 
	КонецЦикла;
	
	ОтложеноДо = Дата(1,1,1);
	СтрокаИдентификатора = Строка(ТекущаяДата()) + "," + Строка("ПодготовкаАвтоТеста");
	SQLВыполнениеЗаданий.ДобавитьЗаписьВРегистрВыполнениеЗаданий(Задание, Структура, СтрокаИдентификатора, ОтложеноДо);

	
КонецПроцедуры 

Процедура ПодготовкаDCT() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ TOP 1 
		|	SQLЗадания.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.SQLЗадания КАК SQLЗадания
		|ГДЕ
		|	SQLЗадания.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", "Обновление DCT");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Задание = ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;
	
	Структура = Новый Структура; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  
		|	Т.Параметр КАК Параметр
		|	,Т.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
		|ИЗ
		|	РегистрСведений.ЗапускЗаданияSQLЗначенияПоУмолчанию КАК Т
		|ГДЕ
		|	Т.SQLЗадания = &SQLЗадания";
	
	Запрос.УстановитьПараметр("SQLЗадания", Задание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура.Вставить(ВыборкаДетальныеЗаписи.Параметр, ВыборкаДетальныеЗаписи.ЗначениеПоУмолчанию); 
	КонецЦикла;
	
	ОтложеноДо = Дата(1,1,1);
	СтрокаИдентификатора = Строка(ТекущаяДата()) + "," + Строка("ПодготовкаDCT");
	SQLВыполнениеЗаданий.ДобавитьЗаписьВРегистрВыполнениеЗаданий(Задание, Структура, СтрокаИдентификатора, ОтложеноДо);

	
КонецПроцедуры  

Процедура СоздатьЗадание(Задание, СтруктураПараметров = Неопределено, ОтказОтПродолжения, ЕстьОшибка = "")   
	СтрокаИдентификатора = СтруктураПараметров.КлючПараметров;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  
		|	Т.РезультатВыполнения КАК РезультатВыполнения
		|ИЗ
		|	РегистрСведений.SQLВыполнениеЗаданий КАК Т
		|ГДЕ
		|	Т.Задание = &Задание И Т.КлючПараметров = &КлючПараметров";
	
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("КлючПараметров", СтрокаИдентификатора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОтложеноДо = Дата(1,1,1);
		SQLВыполнениеЗаданий.ДобавитьЗаписьВРегистрВыполнениеЗаданий(Задание, СтруктураПараметров, СтрокаИдентификатора, ОтложеноДо);
	    ОтказОтПродолжения = Истина;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Если НЕ ВыборкаДетальныеЗаписи.РезультатВыполнения Тогда
			ОтказОтПродолжения = Истина;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры 

Процедура УстановитьПарольСлужебногоПользователяПоУмолчанию(СтруктураПараметров = Неопределено, ЕстьОшибка = "")
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т1.Ссылка КАК Ссылка,
		|	Т2.ЛогинБазы КАК ЛогинБазы,
		|	Т2.ПарольБазы КАК ПарольБазы
		|ИЗ
		|	Справочник.SQLDBТестовые КАК SQLDBТестовые
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗД_ИнформационныеБазы КАК Т1
		|		ПО (Т1.SQL_db = SQLDBТестовые.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗД_ИнформационныеБазы КАК Т2
		|		ПО (Т2.SQL_db = SQLDBТестовые.Владелец)
		|ГДЕ
		|	SQLDBТестовые.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураПараметров.База);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		СпрСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		СпрОбъект = СпрСсылка.ПолучитьОбъект();
		СпрОбъект.ЛогинБазы = ВыборкаДетальныеЗаписи.ЛогинБазы;
		СпрОбъект.ПарольБазы = ВыборкаДетальныеЗаписи.ПарольБазы; 
		Если (НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ЛогинБазы) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПарольБазы)) И СпрОбъект.СохранятьCF Тогда
			СпрОбъект.СохранятьCF = Ложь;	
		КонецЕсли;
		Попытка
			СпрОбъект.Записать();
		Исключение
			ЕстьОшибка = ОписаниеОшибки();	
		КонецПопытки;
	КонецЦикла;
		
КонецПроцедуры 

#Region ЖурналРегистрации
//SD-69438 baklanov 23.04.2024
Процедура УсечениеЖурналаРегиcтрации() Экспорт
	НаДень = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1)); 
	СократитьЖурналРегистрации(НаДень);
КонецПроцедуры

#EndRegion    

#Region DataCompressionTool

Процедура ВыполнитьDataCompressionTool(СтруктураПараметров = Неопределено, ЕстьОшибка = "")
    ПараметрКоманды = СтруктураПараметров.База;
	ИнформационнаяБаза = "";

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЗД_ИнформационныеБазы КАК Т
		|ГДЕ
		|	Т.SQL_db = &ПараметрКоманды";
	
	Запрос.УстановитьПараметр("ПараметрКоманды", ПараметрКоманды);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИнформационнаяБаза = ВыборкаДетальныеЗаписи.Ссылка; 
	КонецЦикла;

	Если ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		АвтономныйСервер.ПолучитьФайлDataCompressionTool(ИнформационнаяБаза);
	Иначе
		ЕстьОшибка = "Не найдена информационная база";
	КонецЕсли;
КонецПроцедуры

#EndRegion
