
Процедура ОбработатьЗадания() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Задание КАК Задание,
	|	Т.КлючПараметров КАК КлючПараметров,
	|	Т.СтрокаJson КАК СтрокаJson
	|ИЗ
	|	РегистрСведений.SQLВыполнениеЗаданий КАК Т
	|ГДЕ
	|	НЕ Т.РезультатВыполнения
	|	И Т.КоличествоПопыток < &КоличествоПопыток"; 
	
	КоличествоПопыток = 3;
    Запрос.УстановитьПараметр("КоличествоПопыток",КоличествоПопыток);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		СтруктураПараметров = Новый Структура;
		Если Не Выборка.КлючПараметров = "" Тогда
			СтруктураПараметров = СтрокаJSONВСтруктуруПараметров(Выборка.СтрокаJson);
			Если Не СтруктураПараметров.Свойство("Задание") Тогда
				СтруктураПараметров.Вставить("Задание", Выборка.Задание);
			КонецЕсли;   
			Если Не СтруктураПараметров.Свойство("КлючПараметров") Тогда
				СтруктураПараметров.Вставить("КлючПараметров", Выборка.КлючПараметров);
			КонецЕсли;   
		Иначе
			СтруктураПараметров.Вставить("Задание", Выборка.Задание);
		КонецЕсли;
		ЕстьОшибка = "";
		Попытка
			ВыполнитьЗадание(Выборка.Задание, СтруктураПараметров, ЕстьОшибка);
		Исключение
			Если ОписаниеОшибки() = "" Тогда
				ЕстьОшибка = "Неизвестная ошибка!";	
			Иначе					
				ЕстьОшибка = ОписаниеОшибки();
			КонецЕсли;
		КонецПопытки;
		Набор = РегистрыСведений.SQLВыполнениеЗаданий.СоздатьНаборЗаписей();
		Набор.Отбор.Задание.Значение = Выборка.Задание;
		Набор.Отбор.Задание.Использование = Истина;
		Набор.Отбор.КлючПараметров.Значение = Выборка.КлючПараметров;
		Набор.Отбор.КлючПараметров.Использование = Истина;
		Набор.Прочитать();
		Если Набор.Количество() = 1 Тогда 
			Если ЕстьОшибка = "" Тогда
				Набор[0].РезультатВыполнения = Истина;
			КонецЕсли;
			Набор[0].ОшибкаВыполнения = ЕстьОшибка;
			Набор[0].ДатаВыполнения = ТекущаяДата(); 
			Набор[0].КоличествоПопыток = Набор[0].КоличествоПопыток + 1; 
		КонецЕсли;
		Набор.Записать();
	КонецЦикла;
КонецПроцедуры 

Функция СтрокаJSONВСтруктуруПараметров(СтрокаJSON) Экспорт  
	Если СтрокаJSON = "" Тогда
		Возврат Новый Структура;
	КонецЕсли;
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Структура = ПрочитатьJSON(ЧтениеJSON, Ложь);
	СтруктураПараметров = Новый Структура;
	Для каждого эл из Структура Цикл  
		Если Не ТипЗнч(эл.Значение) = Тип("Массив") Тогда 
			СтруктураПараметров.Вставить(эл.Ключ,эл.Значение);
			Продолжить;
		КонецЕсли;
		Если эл.Значение[0] = "Дата" Тогда
			Значение = ПрочитатьДатуJSON(Формат(эл.Значение[1], "ЧГ="), ФорматДатыJSON.ISO);
			СтруктураПараметров.Вставить(эл.Ключ, Значение);
			Продолжить;
		КонецЕсли;
		// <-- Пантелеев Д.И. 17.04.2023, Ссылка на задачу в Redmine (Jira): SD-22910 
		Если эл.Значение[0] = "ТаблицаЗначений" Тогда  
			ТЗ = Новый ТаблицаЗначений;
			к = 1;
			Пока к < эл.Значение.Количество() Цикл 
				Если к = 1 Тогда
					ТЗ = СтруктураВТЗ(СтрокаJSONВСтруктуруПараметров(эл.Значение[к]));
				Иначе
					врТЗ = СтруктураВТЗ(СтрокаJSONВСтруктуруПараметров(эл.Значение[к]));
					новСтр = ТЗ.Добавить();
					ЗаполнитьЗначенияСвойств(новСтр, врТЗ[0]);
				КонецЕсли; 
				к = к + 1;
			КонецЦикла;
			СтруктураПараметров.Вставить(эл.Ключ, ТЗ);
			Продолжить;
		КонецЕсли; 
		// --> Пантелеев Д.И. 17.04.2023
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(эл.Значение[0]);
		Если СтрНайти(эл.Значение[0], "Перечисление") Тогда  
			Значение = Менеджер.Получить(эл.Значение[1]);
		Иначе
			Значение = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(эл.Значение[1]));
		КонецЕсли;
		СтруктураПараметров.Вставить(эл.Ключ, Значение);
	КонецЦикла;
	ЧтениеJSON.Закрыть(); 
	Возврат СтруктураПараметров; 
КонецФункции

Функция СтруктураВТЗ(Структра) 
	
	ТЗ = Новый ТаблицаЗначений;
	НовСтр=ТЗ.Добавить();

	Для Каждого ТекЭлем из Структра Цикл
		
		ТЗ.Колонки.Добавить(ТекЭлем.Ключ);
			
		НовСтр[ТекЭлем.Ключ] = ТекЭлем.Значение;                          
		
	КонецЦикла;
 	
	Возврат ТЗ;
	
КонецФункции

Процедура ДобавитьЗаписьВРегистрВыполнениеЗаданий(Задание, СтруктураПараметров = Неопределено, КлючПараметр = "") Экспорт 
	Если Не ТипЗнч(КлючПараметр) = Тип("Строка") Тогда
		КлючПараметр = Строка(КлючПараметр);
	КонецЕсли;
	Запись = РегистрыСведений.SQLВыполнениеЗаданий.СоздатьМенеджерЗаписи();
	Запись.Задание = Задание;
	Запись.ДатаЗаписи = ТекущаяДата();
	Если ЗначениеЗаполнено(КлючПараметр) Тогда
		Запись.КлючПараметров = КлючПараметр;
		Если ЗначениеЗаполнено(СтруктураПараметров) Тогда
			Запись.СтрокаJson = СтруктураПараметровВСтрокуJSON(СтруктураПараметров);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров) Тогда
		Запись.КлючПараметров = "Истина";
		Запись.СтрокаJson = СтруктураПараметровВСтрокуJSON(СтруктураПараметров);
	КонецЕсли;
	Запись.Записать(Истина);
КонецПроцедуры 

Функция СтруктураПараметровВСтрокуJSON(СтруктураПараметров)   
	//ЗаписьJSON = Новый ЗаписьJSON;
	//ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	//ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON;
	//ЗаписьJSON.ОткрытьФайл("ИмяФайла",,,ПараметрыЗаписиJSON);
	//ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров, Новый НастройкиСериализацииJSON);  
	Структура = Новый Структура;
	Для каждого эл из СтруктураПараметров Цикл
		Если ТипЗнч(Эл.Значение) = Тип("Строка")
			или ТипЗнч(Эл.Значение) = Тип("Число")
			или ТипЗнч(Эл.Значение) = Тип("Булево") 
			или Эл.Значение = Неопределено 
			Тогда
			Структура.Вставить(эл.Ключ, эл.Значение);
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Эл.Значение) = Тип("Дата") Тогда
			Массив = Новый Массив; 
			Массив.Добавить("Дата");
			Массив.Добавить(эл.Значение);
			Структура.Вставить(эл.Ключ, Массив);
			Продолжить;
		КонецЕсли; 
		// <-- Пантелеев Д.И. 17.04.2023, Ссылка на задачу в Redmine (Jira): SD-22910 
		Если ТипЗнч(Эл.Значение) = Тип("ТаблицаЗначений") Тогда   
			Массив = Новый Массив; 
			Массив.Добавить("ТаблицаЗначений"); 
			МассивСтруктур = ТЗВСтруктуру(эл.Значение);
			Для каждого элМС из МассивСтруктур Цикл
				Массив.Добавить(СтруктураПараметровВСтрокуJSON(элМС));
			КонецЦикла;
			Структура.Вставить(эл.Ключ, Массив);
			Продолжить;
		КонецЕсли;	
		// --> Пантелеев Д.И. 17.04.2023
		Массив = Новый Массив; 
		Тип = Метаданные.НайтиПоТипу(ТипЗнч(эл.Значение)).ПолноеИмя();
		Массив.Добавить(Тип); 
		Если СтрНайти(Тип, "Перечисление") Тогда
			Массив.Добавить(Перечисления[эл.Значение.Метаданные().Имя].Индекс(эл.Значение)); 
		Иначе 
			Массив.Добавить(Строка(эл.Значение.УникальныйИдентификатор())); 
		КонецЕсли;
		Структура.Вставить(эл.Ключ, Массив);
	КонецЦикла;
	ЗначенияJSON = Новый ЗаписьJSON;
	ЗначенияJSON.ПроверятьСтруктуру = Ложь;
	ЗначенияJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗначенияJSON, Структура,);
	Возврат ЗначенияJSON.Закрыть();
	//СтрокаJSON = ЗначенияJSON.Закрыть(); 
	//Возврат СтрЗаменить(СтрЗаменить(СтрокаJSON, "\r\n", Символы.ПС), "\", ""); 
КонецФункции 

Функция ТЗВСтруктуру(ТабЗначений)

	Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабЗначений);
	КоллекцияКолонок = ТабЗначений.Колонки;	
	
	Для каждого ТекЭлемента из Результат Цикл		
		Для каждого ТекКолонки из КоллекцияКолонок Цикл
			мЗначение	=	ТекЭлемента[ТекКолонки.имя];
			ТекЭлемента[ТекКолонки.имя]	= мЗначение;			
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции


Процедура ВыполнитьЗадание(Задание, СтруктураПараметров = Неопределено, ЕстьОшибка = "") 
	Если Задание.Отключено Тогда
		ЕстьОшибка = "Задание отключено";
		Возврат;
	КонецЕсли; 
	
	Для Каждого Шаг Из Задание.Сценарий Цикл
		ОтказОтПродолжения = Ложь;
		ВыполнитьШагЗадания(Шаг.КомандаСценария, СтруктураПараметров, ОтказОтПродолжения, ЕстьОшибка);
		Если ОтказОтПродолжения Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

  
Процедура ВыполнитьШагЗадания(ТекстКоманды, СтруктураПараметров = Неопределено, ОтказОтПродолжения, ЕстьОшибка = "")
	Если ЗначениеЗаполнено(ТекстКоманды) Тогда
		Выполнить(ТекстКоманды);
	КонецЕсли;
	Если ЕстьОшибка <> "" Тогда
		 ОтказОтПродолжения = Истина;
	КонецЕсли;
КонецПроцедуры     

Процедура СкриптВосстановления(СтруктураПараметров = Неопределено, ЕстьОшибка = "")

	ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
	ОЛАПСоединение.CursorLocation=3;
	Пароль = СтруктураПараметров.База.Сервер.Пароль;
	Пользователь = СтруктураПараметров.База.Сервер.Агент;
	Сервер = СтруктураПараметров.База.Сервер.Наименование;

	ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password="+Пароль+";Persist Security Info=True;User ID="+Пользователь+";Initial Catalog=master;Data Source="+Сервер;
	ОЛАПСоединение.Open();
	
	ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
	ExecuteOptionEnum = Новый Структура ("adAsyncExecute, adAsyncFetch, adAsyncFetchNonBlocking, adExecuteNoRecords, adExecuteStream, adOptionUnspecified", 16, 32, 64, 128, 1024, -1);
			
	ЗапросАДО.CommandText = "dbo.DatabaseRestoreAdm";
	ЗапросАДО.CommandType=4;
	ЗапросАДО.CommandTimeout = 300;
	ЗапросАДО.ActiveConnection = ОЛАПСоединение;
	
	ЗапросАДО.Parameters.Item("@databaseName").Value=Строка(СтруктураПараметров.База.Владелец.Наименование);
	ЗапросАДО.Parameters.Item("@serverName").Value=СтруктураПараметров.База.Владелец.Сервер.Наименование;
	ЗапросАДО.Parameters.Item("@pathBackup").Value=СтруктураПараметров.База.Владелец.Сервер.ПутьКБекапам;
	ЗапросАДО.Parameters.Item("@pathNetBackup").Value="\\"+СтруктураПараметров.База.Владелец.Сервер.Наименование;
	ЗапросАДО.Parameters.Item("@databaseNameNew").Value=СтруктураПараметров.База.Наименование;
	ЗапросАДО.Parameters.Item("@DirectoryRestoreData").Value=СтруктураПараметров.База.Сервер.ПутьКДанным;
	ЗапросАДО.Parameters.Item("@DirectoryRestoreLog").Value=СтруктураПараметров.База.Сервер.ПутьКЛогам;
	UUID = UUIDизСсылки(СтруктураПараметров.Задание);
	ЗапросАДО.Parameters.Item("@sID").Value=UUID;
	ЗапросАДО.Parameters.Item("@IDstr").Value=СтруктураПараметров.КлючПараметров;

	НаборЗаписейАДО = Новый COMОбъект("ADODB.RecordSet");

	НаборЗаписейАДО = ЗапросАДО.Execute();
	СкриптВосстановления = "";

	Пока НаборЗаписейАДО.EOF()=0 Цикл
	    СкриптВосстановления = НаборЗаписейАДО.Fields(0).Value; 
	    НаборЗаписейАДО.MoveNext();
	КонецЦикла;

	ОЛАПСоединение.Close();
	
	Если СкриптВосстановления = "" Тогда
		ЕстьОшибка = "Скрипт не сформирован";
	Иначе
		ЕстьОшибка = "";
	КонецЕсли;
КонецПроцедуры   

Процедура ВыполнитьВосстановление(СтруктураПараметров = Неопределено, ЕстьОшибка = "")

	ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
	ОЛАПСоединение.CursorLocation=3;
	Пароль = СтруктураПараметров.База.Сервер.Пароль;
	Пользователь = СтруктураПараметров.База.Сервер.Агент;
	Сервер = СтруктураПараметров.База.Сервер.Наименование;

	ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password="+Пароль+";Persist Security Info=True;User ID="+Пользователь+";Initial Catalog=msdb;Data Source="+Сервер;
	ОЛАПСоединение.Open(); 

	ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
	ЗапросАДО.CommandText = "sp_start_job";
	ЗапросАДО.CommandType=4;
	ЗапросАДО.CommandTimeout = 300;
	ЗапросАДО.ActiveConnection = ОЛАПСоединение;
	ЗапросАДО.Parameters.Item("@job_name").Value="DatabaseRestoreAdm";
	ЗапросАДО.Execute();

	ОЛАПСоединение.Close();

	ЕстьОшибка = "";

КонецПроцедуры  

Процедура ВыполнитьОповещение(СтруктураПараметров = Неопределено, ЕстьОшибка = "")

	Результат = Ложь;
	Счетчик = 0;
	РезультатВПроцедуре = 0;
	Ошибка = "";

	ОЛАПСоединение = Новый COMОбъект("ADODB.Connection"); 
	ОЛАПСоединение.CursorLocation=3;
	Пароль = СтруктураПараметров.База.Сервер.Пароль;
	Пользователь = СтруктураПараметров.База.Сервер.Агент;
	Сервер = СтруктураПараметров.База.Сервер.Наименование;

	ОЛАПСоединение.ConnectionString="Provider=SQLOLEDB.1;Password="+Пароль+";Persist Security Info=True;User ID="+Пользователь+";Initial Catalog=master;Data Source="+Сервер;
	ОЛАПСоединение.Open(); 

	Пока Не Результат И Счетчик < 50 Цикл
		ОбновлениеСервер.Пауза(1);

		ЗапросАДО = Новый COMОбъект("ADODB.Command"); 
		ЗапросАДО.CommandText = "CheckStatusDatabaseRestoreAdm";
		ЗапросАДО.CommandType=4;
		ЗапросАДО.CommandTimeout = 60;
		ЗапросАДО.ActiveConnection = ОЛАПСоединение;
		UUID = UUIDизСсылки(СтруктураПараметров.Задание);
		ЗапросАДО.Parameters.Item("@sID").Value=UUID;
		ЗапросАДО.Parameters.Item("@IDstr").Value=СтруктураПараметров.КлючПараметров;

		НаборЗаписейАДО = Новый COMОбъект("ADODB.RecordSet");
		НаборЗаписейАДО = ЗапросАДО.Execute();

		Пока НаборЗаписейАДО.EOF()=0 Цикл
		    РезультатВПроцедуре = НаборЗаписейАДО.Fields(0).Value; 
		    Ошибка = НаборЗаписейАДО.Fields(1).Value;
		    НаборЗаписейАДО.MoveNext();
		КонецЦикла;  

		Если РезультатВПроцедуре = 1 ИЛИ Ошибка <> "" Тогда
			Результат = Истина;
		КонецЕсли;

		Счетчик = Счетчик + 1;
	КонецЦикла;

	ОЛАПСоединение.Close();



	Если Результат Тогда
		ЕстьОшибка = Ошибка;
		Если Ошибка = "" Тогда
			Ошибка = "Обновление успешно завершено";
		Иначе
			ЕстьОшибка = "Не завершилось задание";
		КонецЕсли;


		ЗапросКИ = Новый Запрос;
		ЗапросКИ.Текст = 
			"ВЫБРАТЬ
			|	ПользователиКонтактнаяИнформация.АдресЭП КАК АдресЭП
			|ИЗ
			|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
			|ГДЕ
			|	ПользователиКонтактнаяИнформация.Ссылка = &Пользователь
			|	И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
		
		ЗапросКИ.УстановитьПараметр("Пользователь", СтруктураПараметров.Пользователь);
		
		РезультатЗапросаКИ = ЗапросКИ.Выполнить();
		
		ВыборкаДетальныеЗаписиКИ = РезультатЗапросаКИ.Выбрать(); 
		Кому = "";
	    Пока ВыборкаДетальныеЗаписиКИ.Следующий() Цикл
	    	 Кому = Строка(СтруктураПараметров.Пользователь) + " <" + ВыборкаДетальныеЗаписиКИ.АдресЭП +">";
	  	КонецЦикла;
	 	Если Кому = "" Тогда
			Кому = Строка(СтруктураПараметров.Пользователь) + " <help@istk.ru>";
		КонецЕсли;

		ИмяБазы = СтруктураПараметров.База.Наименование;
		ИмяБазы = Прав(ИмяБазы, СтрДлина(ИмяБазы)-1);
		ПараметрыОтправки = Новый Структура("Кому,Копии,Тема,Тело",
				Кому,
				"baklanov@ks-technology.ru",
				ИмяБазы + " - обновление копии базы",
				Ошибка);
	
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(
			Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,
			ПараметрыОтправки);
	КонецЕсли;
	
КонецПроцедуры  

Функция UUIDизСсылки(Ссылка)
	UUID = "0x00";
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ЗначениеЗадание=ЗначениеВСтрокуВнутр(Ссылка);
		СтрЗадание = Сред(ЗначениеЗадание, 2, СтрДлина(ЗначениеЗадание)-2);
		УУИДстр = ВРЕГ(Сред(СтрЗадание, Найти(СтрЗадание, ":")+1));
		UUID = "0x"+УУИДстр; 
	КонецЕсли;

	Возврат UUID;
	
КонецФункции