
Процедура ЗаписатьПроцессы(ТаблицаСеансов, Кластер, ПериодЗаписи) Экспорт
	
	Для каждого ТекСтрока из ТаблицаСеансов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.process) Тогда
			МЗ = РегистрыСведений.ксПроцессы.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ,ТекСтрока); 
			МЗ.process = Новый УникальныйИдентификатор(ТекСтрока.process);
	        МЗ.startedAt = xmlЗначение(тип("дата"), ТекСтрока.startedAt);
			Если ТекСтрока.isEnable = "yes" Тогда
				МЗ.isEnable = Истина; 
			Иначе
				МЗ.isEnable = Ложь; 
			КонецЕсли;
			Если ТекСтрока.reserve = "yes" Тогда
				МЗ.reserve = Истина; 
			Иначе
				МЗ.reserve = Ложь; 
			КонецЕсли;
			Если ТекСтрока.running = "yes" Тогда
				МЗ.running = Истина; 
			Иначе
				МЗ.running = Ложь; 
			КонецЕсли;
			Если ТекСтрока.use = "used" Тогда
				МЗ.use = "Использовать"; 
			Иначе
				МЗ.use = ТекСтрока.use; 
			КонецЕсли;
			МЗ.Кластер = Кластер;
			МЗ.ПериодЗаписи = ПериодЗаписи;
			МЗ.Записать();	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры