
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр РН_ОтработанноеВремя Приход
	Движения.РН_ОтработанноеВремя.Записывать = Истина;
	Движение = Движения.РН_ОтработанноеВремя.Добавить();
	Движение.ВидДвижения = ?(Операция,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Часы = Часы;    
	
	Если Операция Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РН_ОтработанноеВремяОстатки.ЧасыОстаток КАК ЧасыОстаток,
		|	РН_ОтработанноеВремяОстатки.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.РН_ОтработанноеВремя.Остатки(&ДатаЗапроса, Сотрудник = &Сотрудник) КАК РН_ОтработанноеВремяОстатки";
		
		Запрос.УстановитьПараметр("ДатаЗапроса", МоментВремени());
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Если (ВыборкаДетальныеЗаписи.ЧасыОстаток-Часы)<0 Тогда
				ОбщегоНазначения.СообщитьПользователю("Остаток Часов: "+(ВыборкаДетальныеЗаписи.ЧасыОстаток),,,,Отказ);			
			КонецЕсли;			
		КонецЕсли;   
		
	КонецЕсли;
	
	
КонецПроцедуры

