
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Т.Скриншот КАК Скриншот
		|ИЗ
		|	Документ.ОтчетыОбОшибках КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Картинка = Неопределено;
		Пока Выборка.Следующий() Цикл
			Картинка = Выборка.Скриншот.Получить();
			Скриншот = ПоместитьВоВременноеХранилище(Картинка, ЭтаФорма.УникальныйИдентификатор);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПисьмоОтветственномуНаСервере() 
	мСсылки = Новый Массив;
	мСсылки.Добавить(Объект.Ссылка);
	Копии = "";
	Если ЗначениеЗаполнено(Объект.Ответственный) Тогда
		ЗапросКИ = Новый Запрос;
		ЗапросКИ.Текст = 
			"ВЫБРАТЬ
			|	ПользователиКонтактнаяИнформация.АдресЭП КАК АдресЭП
			|ИЗ
			|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
			|ГДЕ
			|	ПользователиКонтактнаяИнформация.Ссылка = &Пользователь
			|	И ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)";
		
		ЗапросКИ.УстановитьПараметр("Пользователь", Объект.Ответственный);
		РезультатЗапросаКИ = ЗапросКИ.Выполнить();
		ВыборкаДетальныеЗаписиКИ = РезультатЗапросаКИ.Выбрать(); 
	    Пока ВыборкаДетальныеЗаписиКИ.Следующий() Цикл
	    	 Копии = Строка(Объект.Ответственный) + " <" + ВыборкаДетальныеЗаписиКИ.АдресЭП +">";
	  	КонецЦикла;  
	КонецЕсли;
	ОтчетыОбОшибкахСервер.ОтправитьВJira(мСсылки, Копии);
КонецПроцедуры

&НаКлиенте
Процедура ПисьмоОтветственному(Команда)
	ПисьмоОтветственномуНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьОшибкуНаСервере()
	ОтчетыОбОшибкахСервер.РасшифроватьОшибку(Объект.Ссылка);
	ЭтаФорма.Прочитать();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьОшибку(Команда)
	ЗаполнитьОшибкуНаСервере();
КонецПроцедуры

