
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Т.Скриншот КАК Скриншот
		|ИЗ
		|	Документ.ОтчетыОбОшибках КАК Т
		|ГДЕ
		|	Т.Ссылка = &Ссылка";
	РезультатЗапроса = Запрос.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Картинка = Неопределено;
		Пока Выборка.Следующий() Цикл
			Картинка = Выборка.Скриншот.Получить();
			Скриншот = ПоместитьВоВременноеХранилище(Картинка, ЭтаФорма.УникальныйИдентификатор);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
