
Процедура ЗаполнитьОшибку(ТекстОтчета, Ошибки, Стек, Пользователь1С=Неопределено) Экспорт
	
Рез = SQLВыполнениеЗаданий.СтрокаJSONВСтруктуруПараметров(ТекстОтчета); 
РезОшибка =  Рез.errorInfo.applicationErrorInfo; 
Ошибки = РезОшибка.errors; 
Если РезОшибка.Свойство("stack") Тогда 
	Стек = РезОшибка.stack; 
КонецЕсли; 

Если Рез.свойство("sessionInfo") и 
	Рез.sessionInfo.Свойство("userName") Тогда
	
	Пользователь1С = Справочники.Пользователи1С.ВернутьПользователя1С(Рез.sessionInfo.userName);
	
КонецЕсли;

	
КонецПроцедуры
