
Процедура ЗаполнитьОшибку(ТекстОтчета, Ошибки, Стек, Пользователь1С=Неопределено, ДополнительнаяИнформацияОтчета = "") Экспорт
	
Рез = SQLВыполнениеЗаданий.СтрокаJSONВСтруктуруПараметров(ТекстОтчета); 
РезОшибка =  Рез.errorInfo.applicationErrorInfo; 
Ошибки = РезОшибка.errors; 
Если РезОшибка.Свойство("stack") Тогда 
	Стек = РезОшибка.stack; 
КонецЕсли; 

Если Рез.свойство("sessionInfo") и 
	Рез.sessionInfo.Свойство("userName") Тогда
	
	Пользователь1С = Справочники.Пользователи1С.ВернутьПользователя1С(Рез.sessionInfo.userName);
	
КонецЕсли; 

Если Рез.свойство("additionalInfo") Тогда  //SD-47816 baklanov 09/11/2023
	ЗнДополнительнаяИнформацияОтчета = Рез.additionalInfo;
	Если ТипЗнч(ЗнДополнительнаяИнформацияОтчета) = Тип("Строка") Тогда
		Если СтрДлина(ЗнДополнительнаяИнформацияОтчета) > 100 Тогда
			ЗнДополнительнаяИнформацияОтчета = Лев(ЗнДополнительнаяИнформацияОтчета, 100);
		КонецЕсли;
		ДополнительнаяИнформацияОтчета = ЗнДополнительнаяИнформацияОтчета;
	КонецЕсли;
КонецЕсли;

	
КонецПроцедуры
