Процедура ЗаполнитьОшибкуНаСервере() Экспорт
	
	МОшибки = Новый Массив;
	МСтек = Новый Массив;
	Документы.ОтчетыОбОшибках.ЗаполнитьОшибку(ТекстОтчета, МОшибки, МСтек);
	Ошибки.Очистить();
	Стек.Очистить();
	Для Каждого Эл Из МОшибки Цикл 
		Если Эл[0] <> "" Тогда
			НСтр = Ошибки.Добавить();
			НСтр.Описание = Эл[0];
			Если ТипЗнч(Эл[1])=Тип("Массив") Тогда
				НСтр.Ошибка = МассивВСтроку(Эл[1]);
			Иначе
				НСтр.Ошибка = Эл[1]; 
			КонецЕсли;
			Если Нстр.НомерСтроки = 1 Тогда
				Ошибка = ПолучитьСсылкуНаОшибку(НСтр.Описание);	
			КонецЕсли;
        КонецЕсли;
	КонецЦикла;
	Для Каждого Эл Из МСтек Цикл
		НСтр = Стек.Добавить();
		НСтр.Метаданные = Эл[0];
		НСтр.NСтроки = Эл[1];
		НСтр.Содержание = Эл[2];
		Если Нстр.НомерСтроки = 1 Тогда
			Метаданные = ПолучитьСсылкуНаЭлемент(НСтр.Метаданные);	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры 

Функция МассивВСтроку(М)
	Рез = "";
	Для Каждого Эл Из М Цикл
		Рез = Эл + Символы.ПС;
	КонецЦикла;
	Возврат Рез;
КонецФункции

Функция ПолучитьСсылкуНаЭлемент(СтрокаМетаданных)
	Рез = Справочники.ЭлементКонфигурации.ПустаяСсылка();
	МассивЭК = СтрРазделить(СтрокаМетаданных,".",Ложь);
	Значение = МассивЭК[1];
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементКонфигурации.Наименование КАК Наименование,
		|	ЭлементКонфигурации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭлементКонфигурации КАК ЭлементКонфигурации
		|ГДЕ
		|	ЭлементКонфигурации.Наименование ПОДОБНО &Значение
		|ORDER BY 1";
	
	Запрос.УстановитьПараметр("Значение", "%\"+Значение+"\%");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	БылоСоответствий = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НайденоСоответствий = 0;
		Для Каждого Эл Из МассивЭК Цикл
			Если  СтрНайти(ВыборкаДетальныеЗаписи.Наименование,"\" + Эл) > 0 Тогда
				НайденоСоответствий = НайденоСоответствий + 1;	
			КонецЕсли;
		КонецЦикла;
		Если НайденоСоответствий > БылоСоответствий Тогда
			БылоСоответствий = НайденоСоответствий;
			Рез = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;

	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции    

Функция ПолучитьСсылкуНаОшибку(СтрокаОписания)
	Рез = Справочники.АнализОшибок.ПустаяСсылка();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АнализОшибок.Наименование КАК Наименование,
		|	АнализОшибок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.АнализОшибок КАК АнализОшибок
		|ГДЕ
		|	АнализОшибок.Наименование = &Значение";
	
	Запрос.УстановитьПараметр("Значение", СтрокаОписания);
	
	РезультатЗапроса = Запрос.Выполнить();  
	Если РезультатЗапроса.Пустой() Тогда
		Эл = Справочники.АнализОшибок.СоздатьЭлемент();	
		Эл.Наименование = СтрокаОписания;
		Эл.Записать();
		Рез = Эл.Ссылка;
	Иначе	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Рез = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

