

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Не ЗначениеЗаполнено(Объект.ПутьКПлатформе1С) Тогда
	//	Объект.ПутьКПлатформе1С = КаталогПрограммы()+"1cv8.exe";	
	//КонецЕсли;     
	//
	//Если Не ЗначениеЗаполнено(Объект.ПутьКRAC) Тогда
	//	Объект.ПутьКRAC = КаталогПрограммы()+"rac.exe";	
	//КонецЕсли;   
	
	//ОформитьРегЗадание();
	
КонецПроцедуры


&НаСервере
Процедура ОформитьРегЗадание()
		
	РеглЗадание = "не указано";
	Если ЗначениеЗаполнено(Объект.РеглЗаданияИдентификатор) и НастройкиРЗ = Неопределено Тогда
		РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Объект.РеглЗаданияИдентификатор);
		РеглЗадание = РЗ.Расписание;
		НастройкиРЗ = РЗ.Расписание;
	ИначеЕсли НастройкиРЗ<>Неопределено Тогда
		РеглЗадание = ""+НастройкиРЗ;					
	КонецЕсли;
	
	
КонецПроцедуры
    
&НаКлиенте
Процедура РасписаниеРегЗаданияНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(НастройкиРЗ) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		НастройкиРЗ = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ИзменитьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
	
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(НастройкиРЗ);
	РедактированиеРасписания.Показать(Обработчик);

	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРегламентноеЗаданиеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиРЗ = Расписание;
	СостояниеРЗ = Строка(Расписание);
	
	ОформитьРегЗадание();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПодключенияБазыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	ЗаполнитьСтрокуПодключения();
	
КонецПроцедуры    

&НаКлиенте
Процедура ИмяСервераПриИзменении(Элемент)
	ЗаполнитьСтрокуПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ИмяБазыПриИзменении(Элемент)
	ЗаполнитьСтрокуПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ПортКластераПриИзменении(Элемент)
	ЗаполнитьСтрокуПодключения();
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьСтрокуПодключения()

	мПортКластера = ?(ЗначениеЗаполнено(Объект.ПортКластера),Объект.ПортКластера,1541);
	Объект.СтрокаПодключенияБазы = СтрШаблон("/S %1:%2\%3",Объект.ИмяСервера,формат(мПортКластера,"ЧГ=0"),Объект.ИмяБазы);	
	
КонецПроцедуры

&НаСервере
Процедура ТекущийСкриптНаСервере(мСкриптСсылка)
	
	//1) сформировать скрипт
	СтруктураПеременных = новый Структура("ИБ,Ошибка",Объект.Ссылка,"");
	мТекстСкрипта = Справочники.ЗД_Скрипты.СформироватьСкрипт(мСкриптСсылка,СтруктураПеременных);
	
	Если ПустаяСтрока(СтруктураПеременных.Ошибка) Тогда
		Сообщить("-------------------------------------");
		Сообщить(мТекстСкрипта);
		Сообщить("-------------------------------------"); 
	Иначе
		Сообщить("ошибка: "+СтруктураПеременных.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСкрипт(Команда)
	
	ТекДанные = Элементы.Сценарий.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выделена строка",Объект.Ссылка,"Объект.Сценарий", Ложь);
		Возврат;	
	КонецЕсли;
	
	ТекущийСкриптНаСервере(ТекДанные.Скрипт);
	
КонецПроцедуры

&НаСервере
Процедура ТекущийСкриптЗапуск_СерверНаСервере(мСкриптСсылка)
	
	ЗД_Модуль_oscript_Привелегированный.ЗапуститьСкрипт(мСкриптСсылка,Объект.Ссылка)
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСкриптЗапуск_Сервер(Команда)
	
	ТекДанные = Элементы.Сценарий.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выделена строка",Объект.Ссылка,"Объект.Сценарий", Ложь);
		Возврат;	
	КонецЕсли;

	ТекущийСкриптЗапуск_СерверНаСервере(ТекДанные.Скрипт);
	
КонецПроцедуры



Процедура УстановитьОтметку(ЗначениеОтметки)

	Для Каждого ТекСтрока из Объект.Сценарий Цикл
		текСтрока.Отметка = ЗначениеОтметки;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтметкаВсе(Команда)
	
	УстановитьОтметку(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаСнятьВсе(Команда)
	
	УстановитьОтметку(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НастройкиРЗ", НастройкиРЗ);
КонецПроцедуры









