
&НаКлиенте
Процедура МетаданныеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ФВыбора = ПолучитьФорму("РегистрСведений.ГлубинаХранения.Форма.ФормаВыбораТипаИсточника");
	ФВыбора.ВладелецФормы = ЭтаФорма;
	ФВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Запись.ЗнчМетаданные = ВыбранноеЗначение.Имя;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПоискаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьТипыДаты(Запись.ЗнчМетаданные);
КонецПроцедуры 

&НаСервереБезКонтекста 
Функция ПолучитьТипыДаты(Источник)  
	Рез = Новый СписокЗначений;
	ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(Источник);
	ОписаниеДата = Новый ОписаниеТипов("Дата");
	Если Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных) Тогда
		Для Каждого Эл Из ОбъектМетаданных.Измерения Цикл
			Если Эл.Тип = ОписаниеДата Тогда
				Рез.Добавить(Эл.Имя);	
			КонецЕсли;
		КонецЦикла; 
	ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
		Для Каждого Эл Из ОбъектМетаданных.Реквизиты Цикл
			Если Эл.Тип = ОписаниеДата Тогда
				Рез.Добавить(Эл.Имя);	
			КонецЕсли;
		КонецЦикла; 
		Для Каждого Эл Из ОбъектМетаданных.СтандартныеРеквизиты Цикл
			Если Эл.Тип = ОписаниеДата Тогда
				Рез.Добавить(Эл.Имя);	
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		Для Каждого Эл Из ОбъектМетаданных.Реквизиты Цикл
			Если Эл.Тип = ОписаниеДата Тогда
				Рез.Добавить(Эл.Имя);	
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат "";	
	КонецЕсли;
	
	Возврат Рез;

КонецФункции
