  
&НаСервере
Процедура ВыгрузитьНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли; 
	    
    ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ВыполнитьСценарийАвтономногоСервера(Объект.ИБ,Объект.Команда,
		Объект.КаталогРазборки, Объект.ИмяРасширения);  
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСписокРасширений(ИБ)
	
	Элемент_ИмяРасширения = Элементы.ИмяРасширения;
	
	Элемент_ИмяРасширения.СписокВыбора.Очистить();
	
	Если не ЗначениеЗаполнено(ИБ) Тогда
		Возврат;	
	КонецЕсли;  
	             
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗД_Хранилища.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ЗД_ИнформационныеБазы.Хранилище КАК ЗД_ИнформационныеБазыХранилище
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗД_Хранилища КАК ЗД_Хранилища
		|		ПО ЗД_ИнформационныеБазыХранилище.Хранилище = ЗД_Хранилища.Ссылка
		|ГДЕ
		|	ЗД_ИнформационныеБазыХранилище.Ссылка = &Ссылка
		|	И ЗД_Хранилища.ЭтоРасширение";
	
	Запрос.УстановитьПараметр("Ссылка", ИБ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Итератор = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Элемент_ИмяРасширения.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Наименование);					
		Итератор = Итератор+1;
	КонецЦикла;
	
	Элемент_ИмяРасширения.ПодсказкаВвода = СтрШаблон("%1 - Расширений",Итератор);	
	
КонецПроцедуры


&НаСервере
Процедура ИБПриИзмененииНаСервере()
	
	ЗаполнитьСписокРасширений(Объект.ИБ);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИБПриИзменении(Элемент)
	ИБПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ИБ) Тогда
		ЗаполнитьСписокРасширений(Объект.ИБ);	
	КонецЕсли; 
	
КонецПроцедуры


