
Процедура ДобавитьЗапись(ДанныеОтчета, Идентификатор = Неопределено) Экспорт  
	
	МенеджерЗаписи = РегистрыСведений.ПолученныеОтчетыОбОшибках.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.Дата = ТекущаяДата();
	МенеджерЗаписи.Идентификатор = ?(Идентификатор = Неопределено, Новый УникальныйИдентификатор, Идентификатор);
	МенеджерЗаписи.Содержимое = ДанныеОтчета;
	МенеджерЗаписи.Записать(Истина);	
	
КонецПроцедуры  

Процедура УдалитьЗапись(Идентификатор) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ПолученныеОтчетыОбОшибках.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Идентификатор;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Удалить();

КонецПроцедуры
	