

Процедура ДобавитьЗапись(Метаданные, ТочкаОбращения, ТочкаВызова) Экспорт  
	
	МенеджерЗаписи = РегистрыСведений.ОбращенияКМетодам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.Метаданные = Метаданные;
	МенеджерЗаписи.ТочкаОбращения = ТочкаОбращения;
	МенеджерЗаписи.ТочкаВызова = ТочкаВызова; 
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Количество = 0 Тогда
		МенеджерЗаписи.Метаданные = Метаданные;
		МенеджерЗаписи.ТочкаОбращения = ТочкаОбращения;
		МенеджерЗаписи.ТочкаВызова = ТочкаВызова;
		МенеджерЗаписи.Количество = 1;
		МенеджерЗаписи.Записать(Ложь);
	Иначе
		МенеджерЗаписи.Количество = МенеджерЗаписи.Количество + 1;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры  

Процедура УдалитьЗапись(Метаданные, ТочкаОбращения, ТочкаВызова) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОбращенияКМетодам.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Метаданные = Метаданные;
	МенеджерЗаписи.ТочкаОбращения = ТочкаОбращения;
	МенеджерЗаписи.ТочкаВызова = ТочкаВызова;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Удалить();

КонецПроцедуры
