
#Область Сериализация

Функция ДесереализацияJSON(Строка_json) Экспорт
	
	ЧтениеJSON 			= Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку(Строка_json); 
	ДанныеЗагрузки		=	ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат ДанныеЗагрузки;
	
КонецФункции  

Функция СерилизацияJSON(ЗначениеСериализации) Экспорт	
	
	//2. сериализуем массив клиентов в JSON 
	ЗаписьJSON 		= Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, ЗначениеСериализации); 
	СтрокаДляОтвета = ЗаписьJSON.Закрыть(); 
	Возврат СтрокаДляОтвета;
	
КонецФункции


#КонецОбласти

#Область http_Запросы

Функция ВыполнитьЗапрос(JKL)  
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	НастройкаПрокси = Неопределено;
	Порт = Неопределено;	
	Таймаут = 30;   
	jira_сервер = "sd.istk.ru"; 
	jira_токен	=	"NzQ0NzE3Mjk3ODIxOqweF2v3Lig/ACLJV36/En4fVjZJ";
	 
	
	СоединениеHTTP = Новый HTTPСоединение(jira_сервер, Порт, , , НастройкаПрокси,Таймаут, ЗащищенноеСоединение);
	НовыйЗапрос = Новый HTTPЗапрос;
	
	castom_jql = "search?jql="+JKL;
	
	НовыйЗапрос.АдресРесурса = "/rest/api/2/"+castom_jql;
	
	НовыйЗапрос.Заголовки.Вставить("Accept","application/json");
	НовыйЗапрос.Заголовки.Вставить("Content-Type","application/json");
	
	//Аутентификация BearerToken	
	ПрефиксТокена = "Bearer";
	НовыйЗапрос.Заголовки.Вставить("Authorization", ПрефиксТокена +" "+jira_токен);
	
	ВидЗапроса = "GET";
	
	НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ОтветHTTP = СоединениеHTTP.ВызватьHTTPМетод(ВидЗапроса, НовыйЗапрос);
	ОкончаниеВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Длительность = ОкончаниеВыполнения - НачалоВыполнения;
	
	КодСостояния = ОтветHTTP.КодСостояния;
	ТелоОтветаСтрока = ОтветHTTP.ПолучитьТелоКакСтроку();  
	
	Если КодСостояния<>200 Тогда
		Сообщить(""+КодСостояния+" ("+JKL+") "+ТелоОтветаСтрока); 
		Возврат Неопределено;
	КонецЕсли; 
	
	строка_http = ТелоОтветаСтрока; 
	
	ТелоОтветаСтрока	=	СтрЗаменить(ТелоОтветаСтрока,"48x48","key48");	
	ТелоОтветаСтрока	=	СтрЗаменить(ТелоОтветаСтрока,"24x24","key24");
	ТелоОтветаСтрока	=	СтрЗаменить(ТелоОтветаСтрока,"16x16","key16");
	ТелоОтветаСтрока	=	СтрЗаменить(ТелоОтветаСтрока,"32x32","key32");
	
	Возврат ДесереализацияJSON(ТелоОтветаСтрока); 
	
КонецФункции


#КонецОбласти



Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	мТаблицаДанных = Новый ТаблицаЗначений;
	мТаблицаДанных.Колонки.Добавить("Задача");
	мТаблицаДанных.Колонки.Добавить("Описание");
	мТаблицаДанных.Колонки.Добавить("Статус");
	мТаблицаДанных.Колонки.Добавить("Исполнитель");
	мТаблицаДанных.Колонки.Добавить("Автор");
	мТаблицаДанных.Колонки.Добавить("Дата");
	мТаблицаДанных.Колонки.Добавить("Приоритет");
	мТаблицаДанных.Колонки.Добавить("Проект");
	мТаблицаДанных.Колонки.Добавить("Спринт");
	мТаблицаДанных.Колонки.Добавить("Кол_ВРаботе");
	
	Настройки 	= КомпоновщикНастроек.ПолучитьНастройки();		
	мАналитика 	= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Аналитика")).Значение;
	
	мМассивИсполнителей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(мАналитика,"ТЧ_Аналитики").Выгрузить().выгрузитьКолонку("ИмяПоля");
	СимволКовычка = Символ(34); 
    СтрСоединить(мМассивИсполнителей,", ");
	
	МассивСтатусов = Новый Массив;                  
	
	МассивСтатусов.Добавить(СимволКовычка+"Новая"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"В работе"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"Ожидание ответа"+СимволКовычка);
	//МассивСтатусов.Добавить(СимволКовычка+"В ожидании доработки"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"Ожидание поставки"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"К обработке"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"В ПРОРАБОТКЕ"+СимволКовычка);
	//МассивСтатусов.Добавить(СимволКовычка+"Передать на согласование"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"Эскалировано"+СимволКовычка);
	
	МассивСтатусовВРаботе = Новый Массив;
	МассивСтатусовВРаботе.Добавить("Новая");
	МассивСтатусовВРаботе.Добавить("В работе");
	МассивСтатусовВРаботе.Добавить("К обработке");
	МассивСтатусовВРаботе.Добавить("В ПРОРАБОТКЕ");
	МассивСтатусовВРаботе.Добавить("Эскалировано");
	
     	
	jkl = "project = SD AND status in ("+СтрСоединить(МассивСтатусов,", ")+") AND assignee in ("+СтрСоединить(мМассивИсполнителей,", ")+")&maxResults=1000";
	ДанныеАпи = ВыполнитьЗапрос(jkl);

	Для каждого ТекСтрока из ДанныеАпи.issues Цикл 
		НоваяСтрока = мТаблицаДанных.Добавить();
		НоваяСтрока.Задача = ТекСтрока.key;
		НоваяСтрока.Описание = ТекСтрока.fields.summary;
		НоваяСтрока.Статус = ТекСтрока.fields.status.name;
		НоваяСтрока.Исполнитель = ТекСтрока.fields.assignee.displayName;
		НоваяСтрока.Автор = ТекСтрока.fields.creator.displayName;
		НоваяСтрока.Дата = Дата(СтрЗаменить(лев(ТекСтрока.fields.created,10),"-",""));  
		НоваяСтрока.Приоритет = ТекСтрока.fields.priority.name;
		НоваяСтрока.Проект = "SD";   
		
		Если МассивСтатусовВРаботе.Найти(НоваяСтрока.Статус)<>Неопределено Тогда
			НоваяСтрока.Кол_ВРаботе = 1;
		иначе
			НоваяСтрока.Кол_ВРаботе = 0;
		КонецЕсли;	
		
	КонецЦикла;

	//////////////////////// 
	МассивСтатусов.Очистить();	
	МассивСтатусов.Добавить(СимволКовычка+"Сформировано ТЗ"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"В работе"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"На тестировании"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"Выполнена"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"В хранилище"+СимволКовычка);
	МассивСтатусов.Добавить(СимволКовычка+"Ожидание поставки"+СимволКовычка);
	
	МассивСтатусовВРаботе = Новый Массив;
	МассивСтатусовВРаботе.Добавить("Сформировано ТЗ");
	МассивСтатусовВРаботе.Добавить("В работе");
	
	jkl = "project = DEV  AND status in ("+СтрСоединить(МассивСтатусов,", ")+") AND assignee in ("+СтрСоединить(мМассивИсполнителей,", ")+")&maxResults=1000";

	ДанныеАпи = ВыполнитьЗапрос(jkl);

	Для каждого ТекСтрока из ДанныеАпи.issues Цикл 
		НоваяСтрока = мТаблицаДанных.Добавить();
		НоваяСтрока.Задача = ТекСтрока.key;
		НоваяСтрока.Описание = ТекСтрока.fields.summary;
		НоваяСтрока.Статус = ТекСтрока.fields.status.name;
		НоваяСтрока.Исполнитель = ТекСтрока.fields.assignee.displayName;
		НоваяСтрока.Автор = ТекСтрока.fields.creator.displayName;
		НоваяСтрока.Дата = Дата(СтрЗаменить(лев(ТекСтрока.fields.created,10),"-",""));  
		НоваяСтрока.Приоритет = ТекСтрока.fields.priority.name;
		НоваяСтрока.Проект = "DEV";
		НоваяСтрока.Спринт =  ?(ТекСтрока.fields.customfield_10109<>Неопределено и ТекСтрока.fields.customfield_10109.Количество()>0,ТекСтрока.fields.customfield_10109[0],"");
		
		Если МассивСтатусовВРаботе.Найти(НоваяСтрока.Статус)<>Неопределено Тогда
			НоваяСтрока.Кол_ВРаботе = 1;
		иначе
			НоваяСтрока.Кол_ВРаботе = 0;
		КонецЕсли;
		//ТекСтрока.fields.customfield_10109 - 
	КонецЦикла;

	
	
	
	СтандартнаяОбработка 		= Ложь;	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
	
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	ВнешнийНаборДанных = Новый Структура("ТаблицаДанных", мТаблицаДанных);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);	
	
	ДокументРезультат.Очистить();	
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);   	
	
КонецПроцедуры
