Функция СведенияОВнешнейОбработке() Экспорт
  	
	ПараметрыРегистрации = Новый Структура;
	МассивНазначений = Новый Массив;
	
	Наименование = УказатьНаименованиеВнешнейПечатнойФормы();
	
	МассивНазначений.Добавить(ПолучитьМетаданныеДокументаПечати());
	
	ПараметрыРегистрации.Вставить("Наименование", Наименование);
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);
	ПараметрыРегистрации.Вставить("Версия", "1.0");

	ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет"); 
	ПараметрыРегистрации.Вставить("Информация", УказатьНаименованиеВнешнейПечатнойФормы());
	
	///////////// команды /////////////////////////
	тзКоманд = Новый ТаблицаЗначений;
    тзКоманд.Колонки.Добавить("Идентификатор");
    тзКоманд.Колонки.Добавить("Представление");
    тзКоманд.Колонки.Добавить("Модификатор");
    тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
    тзКоманд.Колонки.Добавить("Использование");
  
    строкаКоманды = тзКоманд.Добавить();
    строкаКоманды.Идентификатор = ПолучитьМетаданныеДокументаПечати();
    строкаКоманды.Представление = Наименование;
    строкаКоманды.ПоказыватьОповещение = Истина;
    строкаКоманды.Модификатор = "";
    строкаКоманды.Использование = "ОткрытиеФормы";
	
	ПараметрыРегистрации.Вставить("Команды", тзКоманд);
     
    Возврат ПараметрыРегистрации;
              
КонецФункции

Функция УказатьНаименованиеВнешнейПечатнойФормы()
	Наименование = ЭтотОбъект.Метаданные().Представление();
	Возврат Наименование;
КонецФункции

Функция ПолучитьМетаданныеДокументаПечати()
	ПолноеИмя = ЭтотОбъект.Метаданные().ПолноеИмя();
	Возврат ПолноеИмя;
КонецФункции

