
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.ОтчетыОбОшибках.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	РасшифроватьОшибкиСервер(ПараметрКоманды);
КонецПроцедуры   

Процедура РасшифроватьОшибкиСервер(МассивОбъктов)
	
	ОтчетыОбОшибкахСервер.РасшифроватьОшибку(МассивОбъктов);
	
КонецПроцедуры

