
Функция ВернутьТаблицуХранилищ(ИБ) Экспорт
	
	Запрос = Новый Запрос;
	
	//Установка значений параметров
	Запрос.УстановитьПараметр("Ссылка", ИБ);//nota:1541 (Справочник.ИнформационныеБазы)
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИнформационныеБазыХранилище.Хранилище КАК Хранилище,
	|	ИнформационныеБазыХранилище.ЛогинХранилища КАК ЛогинХранилища,
	|	ИнформационныеБазыХранилище.ПарольХранилища КАК ПарольХранилища,
	|	Хранилища.Наименование КАК Наименование,
	|	Хранилища.ПутьХранилища КАК ПутьХранилища,
	|	Хранилища.ЭтоРасширение КАК ЭтоРасширение,
	|	ИнформационныеБазы.СтрокаПодключенияБазы КАК СтрокаПодключенияБазы,
	|	ИнформационныеБазы.КодРазрешения КАК КодРазрешения,
	|	ИнформационныеБазы.ЛогинБазы КАК ЛогинБазы,
	|	ИнформационныеБазы.ПарольБазы КАК ПарольБазы
	|ИЗ
	|	Справочник.ЗД_ИнформационныеБазы.Хранилище КАК ИнформационныеБазыХранилище
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗД_Хранилища КАК Хранилища
	|		ПО ИнформационныеБазыХранилище.Хранилище = Хранилища.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗД_ИнформационныеБазы КАК ИнформационныеБазы
	|		ПО ИнформационныеБазыХранилище.Ссылка = ИнформационныеБазы.Ссылка
	|ГДЕ
	|	ИнформационныеБазыХранилище.Ссылка = &Ссылка";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

Процедура ПакетСкриптов_Запуск_СерверНаСервере(ИБ) Экспорт

	ТЧ_Сценарий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИБ,"Сценарий");
	ТаблицаСкриптов = ТЧ_Сценарий.Выгрузить();
	ТаблицаСкриптов.Сортировать("НомерСтроки");
	
	Для Каждого ТекСкрипта из ТаблицаСкриптов Цикл
		Если ТекСкрипта.Отметка Тогда
			ЗД_Модуль_oscript_Привелегированный.ЗапуститьСкрипт(ТекСкрипта.Скрипт,ИБ);
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Функция ВернутьИБ(Наименование) Экспорт
	
	Нс = Справочники.ЗД_ИнформационныеБазы.НайтиПоРеквизиту("ИмяБазы",Наименование);
	Если не ЗначениеЗаполнено(нс) Тогда
		Нс = Справочники.ЗД_ИнформационныеБазы.НайтиПоРеквизиту("ИдБазыТесты",Наименование); 		
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(нс) Тогда
		ЗаписьЖурналаРегистрации("Поиск значения ИБ",
		УровеньЖурналаРегистрации.Предупреждение,
		Метаданные.Справочники.ЗД_ИнформационныеБазы,,
		Наименование);
		
	КонецЕсли;
	
	
	Возврат Нс;	
	
КонецФункции
