
Процедура ПередЗаписью(Отказ)
	//Наименование = ИмяБазы + ?(ПортКластера = "","",":"+ПортКластера);
	//Если Не ПустаяСтрока(КаталогВременныхФайлов) Тогда
	//	Если Прав(КаталогВременныхФайлов,1)<>"\" Тогда
	//		КаталогВременныхФайлов = КаталогВременныхФайлов+"\";
	//	КонецЕсли;
	//КонецЕсли;   
	//УстановитьСостояниеРЗ(Отказ);
	
	Если не ЭтоГруппа и 
		ПустаяСтрока(ИдБазыТесты) Тогда
		
		ИдБазыТесты = НРег(ИмяБазы);	
	КонецЕсли;
	
	
КонецПроцедуры


#Область архив



//Процедура УстановитьСостояниеРЗ(Отказ)
//	Перем НастройкиРЗ;
//	
//	ПустойУИД = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"); 
//	ДополнительныеСвойства.Свойство("НастройкиРЗ", НастройкиРЗ);
//	
//	Если РеглЗаданияАктивность   Тогда
//		
//		СсылкаОбъекта = Ссылка;
//		Если ЭтоНовый() Тогда
//			СсылкаОбъекта = ПолучитьСсылкуНового();
//			Если НЕ ЗначениеЗаполнено(СсылкаОбъекта) Тогда
//				СсылкаОбъекта = Справочники.ЗД_ИнформационныеБазы.ПолучитьСсылку();
//				УстановитьСсылкуНового(СсылкаОбъекта);
//			КонецЕсли;
//		КонецЕсли; 
//		
//		НаименованиеРЗ = "Скрипт ИБ:"+Наименование;
//		Если РеглЗаданияИдентификатор = ПустойУИД Тогда
//			РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("ВыполнениеСкриптов");			
//		Иначе
//			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданияИдентификатор);
//			Если РЗ = Неопределено Тогда
//				РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("ВыполнениеСкриптов");
//			КонецЕсли;
//		КонецЕсли;
//				
//		РЗ.Расписание = НастройкиРЗ;
//		РЗ.Наименование = НаименованиеРЗ;
//		РЗ.Использование = Истина;
//		РЗ.Параметры.Очистить();
//		РЗ.Параметры.Добавить(СсылкаОбъекта);
//		РЗ.Записать();
//		
//		РеглЗаданияИдентификатор = РЗ.УникальныйИдентификатор;
//		
//	Иначе
//		Если РеглЗаданияИдентификатор <> ПустойУИД Тогда
//			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданияИдентификатор);
//			Если РЗ <> Неопределено Тогда
//				РЗ.Удалить();
//			КонецЕсли;
//			РеглЗаданияИдентификатор = ПустойУИД;
//		КонецЕсли;
//	КонецЕсли; 
//	
//КонецПроцедуры

#КонецОбласти


