	
			
&НаСервере
Процедура ВыполнитьНаСервере()
	
	Если не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = КонвертацияХранилища.СФормироватьПараметрыИВыгрузитьВерсии(Объект.ИБ,Объект.КаталогВременныхФайлов);
	
	Объект.Хранилище = Результат.Хранилище;
	Объект.ИмяФайлаОтчета = Результат.ИмяФайлаОтчета;

	
	сообщить("ок");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура Выполнить2НаСервере()
	
	Справочники.ВерсииХранилища.ЗагрузитьВерсииИзОтчета(Объект.Хранилище, Объект.ИмяФайлаОтчета);
	сообщить("ок");
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнить2(Команда)
	Выполнить2НаСервере();
КонецПроцедуры
