
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПоказатьОповещениеПользователя ("Фоновый запуск", , ""+ПараметрКоманды, БиблиотекаКартинок.ВыполнитьЗадачу);
	ВыполнитьКодСценария(ПараметрКоманды);
	
КонецПроцедуры

Процедура ВыполнитьКодСценария(ПараметрКоманды)
	
	//выполнитьфо
	ЗД_Модуль_oscript_Привелегированный.ВыполнитьСкрипт(ПараметрКоманды);
	//ДлительныеОперации.ВыполнитьПроцедуру(,"ЗД_Модуль_oscript_Привелегированный.ВыполнитьСкрипт",ПараметрКоманды);
	
КонецПроцедуры             




