
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.QueryText.Ширина = 180;
КонецПроцедуры


&НаСервере
Процедура ПолучитьЖР(SessionID, localTime)   
	
	СеансНомер = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ксСеансыSQL.dbProcInfo КАК dbProcInfo,
		|	ксСеансыSQL.sessionId КАК sessionId,
		|	ксСеансыSQL.userName КАК userName,
		|	ксСеансыSQL.startedAt КАК startedAt,
		|	ксСеансыSQL.lastActiveAt КАК lastActiveAt
		|ИЗ
		|	РегистрСведений.ксСеансыSQL КАК ксСеансыSQL
		|ГДЕ
		|	ксСеансыSQL.infobase В
		|			(ВЫБРАТЬ
		|				ксИнформационныеБазы.infobase КАК infobase
		|			ИЗ
		|				РегистрСведений.ксИнформационныеБазы КАК ксИнформационныеБазы
		|			ГДЕ
		|				ксИнформационныеБазы.Кластер = ""srv1c-erp.office.local:1545""
		|				И ксИнформационныеБазы.name = ""ERP_work_2_5"")
		|	И ксСеансыSQL.dbProcInfo = &dbProcInfo
		|	И ксСеансыSQL.lastActiveAt <= &LocalTime
		|
		|УПОРЯДОЧИТЬ ПО
		|	ксСеансыSQL.lastActiveAt DESC";
	
	Запрос.УстановитьПараметр("LocalTime", LocalTime);
	Запрос.УстановитьПараметр("dbProcInfo", SessionID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СеансНомер = ВыборкаДетальныеЗаписи.sessionId;
	КонецЦикла;
	
	
	Если СеансНомер > 0 Тогда 
	
		СтрСеансНомер = СтрЗаменить(Строка(СеансНомер), Символы.НПП,"");
		РЕЗ = МодульRAC.ПолучитьЖурналРегистрации(СтрСеансНомер,Строка(ШиринаСек), XMLСтрока(localTime));
		ТЗЖурналРегистрации.Очистить(); 
		Для Каждого Эл ИЗ РЕЗ Цикл 
			Стр = ТЗЖурналРегистрации.Добавить();
			ЗаполнитьЗначенияСвойств(Стр,Эл);
			Стр.Date = XMLЗначение(Тип("Дата"), Эл.Date); 
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЖурналРегистрации(Команда)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		 ПолучитьЖР(Элементы.Список.ТекущиеДанные.SqlID, Элементы.Список.ТекущиеДанные.localTime);
	КонецЕсли;
КонецПроцедуры

