
Функция ВернутьМетаданные(МетаданныеИмя,КэшДанных=Неопределено) Экспорт
	
	НС = Неопределено;
	Если КэшДанных = Неопределено Тогда
		КэшДанных = новый Соответствие;		
	Иначе 
		НС = КэшДанных.Получить(МетаданныеИмя);		
	КонецЕсли;
	
	Если НС=Неопределено Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭлементКонфигурации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ЭлементКонфигурации КАК ЭлементКонфигурации
		|ГДЕ
		|	ЭлементКонфигурации.Наименование ПОДОБНО ""%"" + &Наименование
		|	И ЭлементКонфигурации.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Справочники.Конфигурация.ПолучитьСсылку(Новый УникальныйИдентификатор("1953b182-5926-11ee-9115-e8ebd36d0f8f")));
		Запрос.УстановитьПараметр("Наименование", МетаданныеИмя);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			КэшДанных.Вставить(МетаданныеИмя,ВыборкаДетальныеЗаписи.ссылка);			
			НС = ВыборкаДетальныеЗаписи.ссылка;
		КонецЕсли;

	КонецЕсли;
	
	
	Возврат НС;	
	
КонецФункции



