
Функция ПроверитьНеВыполненые(Задание, Структура) Экспорт

	Рез = Истина;
	КоличествоПопыток = Константы.SQLЗаданиеКоличествоПопыток.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	SQLВыполнениеЗаданий.СтрокаJson КАК СтрокаJson
		|ИЗ
		|	РегистрСведений.SQLВыполнениеЗаданий КАК SQLВыполнениеЗаданий
		|ГДЕ
		|	SQLВыполнениеЗаданий.РезультатВыполнения = Ложь
		|	И SQLВыполнениеЗаданий.КоличествоПопыток < &КоличествоПопыток
		|	И SQLВыполнениеЗаданий.Задание = &Задание";
	
	Запрос.УстановитьПараметр("Задание", Задание);	
	Запрос.УстановитьПараметр("КоличествоПопыток",КоличествоПопыток);
		
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		СтруктураЗадания = SQLВыполнениеЗаданий.СтрокаJSONВСтруктуруПараметров(ВыборкаДетальныеЗаписи.СтрокаJson);
		Если ОбщегоНазначения.КоллекцииИдентичны(СтруктураЗадания, Структура) Тогда
			Рез = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Рез;

КонецФункции