
Функция ПолучитьСсылкуНаОшибку(СтрокаОписания) Экспорт
	
	// SD-55296 Klevin V.D. 2023/12/29 (
	//Рез = Справочники.ксОшибкиТестов.ПустаяСсылка();
	//)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	АнализОшибок.Наименование КАК Наименование,
		|	АнализОшибок.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ксОшибкиТестов КАК АнализОшибок
		|ГДЕ
		|	ВЫРАЗИТЬ(АнализОшибок.ТекстОшибки КАК СТРОКА(1024)) = &Значение";  
	
	Запрос.УстановитьПараметр("Значение", СтрокаОписания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Эл = Справочники.ксОшибкиТестов.СоздатьЭлемент();	
		Эл.Наименование = СтрокаОписания;
		Эл.ТекстОшибки = СтрокаОписания;
		
		Эл.Записать();
		Рез = Эл.Ссылка;
	Иначе	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			Рез = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции       


