
&НаСервереБезКонтекста
Функция СписокПриАктивизацииСтрокиНаСервере(ТекСтр)
	Рез = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетыОбОшибках.ТекстОтчета КАК ТекстОтчета
		|ИЗ
		|	Документ.ОтчетыОбОшибках КАК ОтчетыОбОшибках
		|ГДЕ
		|	ОтчетыОбОшибках.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекСтр);
	
	РезультатЗапроса = Запрос.Выполнить(); 

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез = ВыборкаДетальныеЗаписи.ТекстОтчета;
	КонецЦикла; 
    Возврат Рез;
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтр = Элементы.Список.ТекущаяСтрока;
	ТекстОшибки = СписокПриАктивизацииСтрокиНаСервере(ТекСтр);
КонецПроцедуры
