		  

&НаСервере
Функция СформироватьСтрокуЗапуска(СсылкаИБ)		  
	
	Ковычка = Символ(34); 
	мНачалоСценария = ТекущаяДата();
	
	РеквизитыИБ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаИБ,"Хранилище,Платформа1С,СтрокаПодключенияБазы,ЛогинБазы,ПарольБазы");
	
	//Платформа
	Если не ЗначениеЗаполнено(РеквизитыИБ.Платформа1С) Тогда
		ТекПлатформа = РегистрыСведений.зд_АктуальнаяПлатформа.ПолучитьПоследнее(ТекущаяДата()).Платформа;		
	Иначе
		ТекПлатформа = РеквизитыИБ.Платформа1С;		
	КонецЕсли;
	ПарамТекПлатформа  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПлатформа,"ПутьКПлатформе1С");	
	ПарамТекПлатформа  = СтрЗаменить(ПарамТекПлатформа,"1cv8.exe","1cv8c.exe"); // запуск тонкого клиента
	
	МассивКомманд = Новый Массив;
	МассивКомманд.Добавить(Ковычка+ПарамТекПлатформа+Ковычка);  
	МассивКомманд.Добавить(" ENTERPRISE "+Ковычка+РеквизитыИБ.СтрокаПодключенияБазы+Ковычка);	
	
	МассивКомманд.Добавить("/DisableStartupDialogs /DisableStartupMessages /UseHwLicenses-");

	Возврат СтрСоединить(МассивКомманд," ");	
	
КонецФункции

		  
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.ЗД_ИнформационныеБазы.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	
	стрКоманда = СформироватьСтрокуЗапуска(ПараметрКоманды);
	ПоказатьОповещениеПользователя (стрКоманда,, "Запуск 1С:Предприятие", БиблиотекаКартинок.Информация_);

	ЗапуститьПриложение(стрКоманда,,);

	

	
КонецПроцедуры
