
Функция ФайлЗагружен(ИмяФайла) Экспорт
	
	мЗначение = новый Структура("Ошибка,Попыток",Неопределено,0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗД_ЗагруженныеФайлыЗамеров.Ошибка КАК Ошибка,
		|	ЗД_ЗагруженныеФайлыЗамеров.Попыток КАК Попыток
		|ИЗ
		|	РегистрСведений.ЗД_ЗагруженныеФайлыЗамеров КАК ЗД_ЗагруженныеФайлыЗамеров
		|ГДЕ
		|	ЗД_ЗагруженныеФайлыЗамеров.ИмяФайла = &ИмяФайла";
	
	Запрос.УстановитьПараметр("ИмяФайла", ИмяФайла);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(мЗначение,ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат мЗначение;	
	
КонецФункции
