
Функция ПолучитьЗапись(ИмяБД,ИмяТаблицыХранения,ИмяТаблицы,Метаданные) Экспорт
	
	мСсылкаНаЗапись = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицыМетаданных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТаблицыМетаданных КАК ТаблицыМетаданных
		|ГДЕ
		|	ТаблицыМетаданных.ИБ_1С = &ИБ_1С
		|	И ТаблицыМетаданных.ИмяТаблицыХранения = &ИмяТаблицыХранения
		|	И ТаблицыМетаданных.ИмяТаблицы = &ИмяТаблицы
		|	И ТаблицыМетаданных.Метаданные = &Метаданные
		|	И НЕ ТаблицыМетаданных.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИБ_1С", ИмяБД);
	Запрос.УстановитьПараметр("ИмяТаблицы", ИмяТаблицы);
	Запрос.УстановитьПараметр("ИмяТаблицыХранения", ИмяТаблицыХранения);
	Запрос.УстановитьПараметр("Метаданные", Метаданные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		мСсылкаНаЗапись = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли;
	
	Возврат мСсылкаНаЗапись;
	
	
КонецФункции   

Функция ОбновитьЗапись(ИмяБД,СтруктураПолей) Экспорт

	СсылкаНаЗапись = ПолучитьЗапись(ИмяБД,СтруктураПолей.ИмяТаблицыХранения,СтруктураПолей.ИмяТаблицы,СтруктураПолей.Метаданные);
	
	Если СсылкаНаЗапись = Неопределено Тогда
		СО = Справочники.ТаблицыМетаданных.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(СО,СтруктураПолей);	
		СО.ИБ_1С = ИмяБД;
		СО.Наименование = ?(ПустаяСтрока(СО.ИмяТаблицы),СО.ИмяТаблицыХранения,СО.ИмяТаблицы);
		СО.update = ТекущаяДата();
		СО.Записать();		
	КонецЕсли;
	
	
	
КонецФункции

	
	
