
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтчетыОбОшибкахОтправлятьJira = Константы.ОтчетыОбОшибкахОтправлятьJira.Получить(); 
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОсновноеДействие(Команда)
	ДействиеНаСервере();	
КонецПроцедуры  

&НаСервере
Процедура ДействиеНаСервере()
	ОтчетыОбОшибкахСервер.ОбработатьПолученныеОтчетыОбОшибках();	
КонецПроцедуры 


&НаСервере
Процедура ОтчетыОбОшибкахОтправлятьJiraПриИзмененииНаСервере()
	Константы.ОтчетыОбОшибкахОтправлятьJira.Установить(ОтчетыОбОшибкахОтправлятьJira); 
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыОбОшибкахОтправлятьJiraПриИзменении(Элемент)
	ОтчетыОбОшибкахОтправлятьJiraПриИзмененииНаСервере();
КонецПроцедуры


 

 


