
&НаСервере
Процедура ВыполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолученныеОтчетыОбОшибках.Идентификатор КАК Идентификатор,
		|	ПолученныеОтчетыОбОшибках.Содержимое КАК Содержимое,
		|	ПолученныеОтчетыОбОшибках.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ПолученныеОтчетыОбОшибках КАК ПолученныеОтчетыОбОшибках";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Попытка
				ОбработатьДанныеПолученногоОтчетаОбОшибке(Выборка);	
			Исключение
				ТекстОшибки = "Не удалось обработать отчет об ошибке с идентификатором %1 по причине %2";
				ТекстОшибки = СтрШаблон(ТекстОшибки, Выборка.Идентификатор, ОписаниеОшибки()); 
				ДобавитьСообщение(ТекстОшибки);
			КонецПопытки;
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОсновноеДействие(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры 

&НаСервере 
Процедура ОбработатьДанныеПолученногоОтчетаОбОшибке(ДанныеОбОтчете)
	ДанныеОтчета = ДанныеОбОтчете.Содержимое.Получить();
	//Если Ложь Тогда
	//	ДанныеОтчета = Новый ДвоичныеДанные;
	//КонецЕсли;
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".zip");
	ДанныеОтчета.Записать(ИмяВременногоФайла);
	
	Архиватор = Новый ЧтениеZipФайла(ИмяВременногоФайла);
	
	ВременныйКаталог = Новый Массив;
	ВременныйКаталог.Добавить(КаталогВременныхФайлов());
	ВременныйКаталог.Добавить("ОбработкаПолученныхОтчетовОбОшибках");
	ВременныйКаталог.Добавить(ДанныеОбОтчете.Идентификатор);
	ВременныйКаталог = СтрСоединить(ВременныйКаталог, "\");  
	
	Архиватор.ИзвлечьВсе(ВременныйКаталог); 
	Архиватор.Закрыть();
	УдалитьФайлы(ИмяВременногоФайла);
	
	ИмяОсновногоФайла = СтрШаблон("1%\2%", ВременныйКаталог, "report.json");
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяОсновногоФайла);
	ТекстОсновногоФайла = ТекстовыйДокумент.ПолучитьТекст(); 
	
	УдалитьФайлы(ВременныйКаталог);
	
	СсылкаНаОтчет = Документы.ОтчетыОбОшибках.ПолучитьСсылку(ДанныеОбОтчете.Идентификатор);
	ОтчетОбОшибке = СсылкаНаОтчет.ПолучитьОбъект();
	Если ОтчетОбОшибке = Неопределено Тогда
		ОтчетОбОшибке = Документы.ОтчетыОбОшибках.СоздатьДокумент();
		ОтчетОбОшибке.УстановитьСсылкуНового(СсылкаНаОтчет);
	КонецЕсли;
	
	ОтчетОбОшибке.Дата = ДанныеОбОтчете.Дата;
	ОтчетОбОшибке.ТекстОтчета = ТекстОсновногоФайла;
	ОтчетОбОшибке.Записать();
	
	РегистрыСведений.ПолученныеОтчетыОбОшибках.УдалитьЗапись(ДанныеОбОтчете.Идентификатор);
	
КонецПроцедуры  

&НаСервере
Процедура ДобавитьСообщение(ТекстСообщения)
	Сообщить(ТекстСообщения);
	ЗаписьЖурналаРегистрации("ОбработкаПолученныхОтчетовОбОшибках", 
	УровеньЖурналаРегистрации.Ошибка,,,ТекстСообщения);
КонецПроцедуры