	  
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;  
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	
	УстановитьСостояниеРЗ(Отказ);

КонецПроцедуры
	  
	  
Процедура УстановитьСостояниеРЗ(Отказ)
	Перем НастройкиРЗ;
	
	ПустойУИД = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"); 
	ДополнительныеСвойства.Свойство("НастройкиРЗ", НастройкиРЗ);
	
	Если РеглЗаданияАктивность   Тогда
		
		СсылкаОбъекта = Ссылка;
		Если ЭтоНовый() Тогда
			СсылкаОбъекта = ПолучитьСсылкуНового();
			Если НЕ ЗначениеЗаполнено(СсылкаОбъекта) Тогда
				СсылкаОбъекта = Справочники.кс_Сценарии.ПолучитьСсылку();
				УстановитьСсылкуНового(СсылкаОбъекта);
			КонецЕсли;
		КонецЕсли; 
		
		НаименованиеРЗ = "Сценарий: "+Наименование;
		Если РеглЗаданияИдентификатор = ПустойУИД Тогда
			РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("ВыполнениеСкриптов");			
		Иначе
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданияИдентификатор);
			Если РЗ = Неопределено Тогда
				РЗ = РегламентныеЗадания.СоздатьРегламентноеЗадание("ВыполнениеСкриптов");
			КонецЕсли;
		КонецЕсли;
				
		РЗ.Расписание = НастройкиРЗ;
		РЗ.Наименование = НаименованиеРЗ;
		РЗ.Использование = Истина;
		РЗ.Параметры.Очистить();
		РЗ.Параметры.Добавить(СсылкаОбъекта);
		РЗ.Записать();
		
		РеглЗаданияИдентификатор = РЗ.УникальныйИдентификатор;
		
	Иначе
		Если РеглЗаданияИдентификатор <> ПустойУИД Тогда
			РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РеглЗаданияИдентификатор);
			Если РЗ <> Неопределено Тогда
				РЗ.Удалить();
			КонецЕсли;
			РеглЗаданияИдентификатор = ПустойУИД;
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры   


