
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПараметрыЗадания();
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПараметрыЗадания()
	SQLПараметры.Очистить();
	Если ЗначениеЗаполнено(Запись.СтрокаJson) Тогда 
		СтруктураЗадания = SQLВыполнениеЗаданий.СтрокаJSONВСтруктуруПараметров(Запись.СтрокаJson);
		Для Каждого Элемент из СтруктураЗадания Цикл 
			НовыйСтр = SQLПараметры.Добавить();
			НовыйСтр.Имя = Элемент.Ключ; 
			НовыйСтр.Значение = Элемент.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если Запись.РезультатВыполнения Тогда
		Элементы.ОтложеноДо.ТолькоПросмотр = Истина;
		Элементы.КоличествоПопыток.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

