
Процедура ДобавитьЗапись(ДанныеОтчета, Путь) Экспорт  
	
	МенеджерЗаписи = РегистрыСведений.ФайлыBSL.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Активность = Истина;
	МенеджерЗаписи.Путь = Путь; 
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Путь = "" Тогда
		МенеджерЗаписи.Путь = Путь;
		МенеджерЗаписи.Записать(Ложь);
	ИначеЕсли ДанныеОтчета <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеОтчета);
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры  

Процедура УдалитьЗапись(Путь) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ФайлыBSL.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Путь = Путь;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Удалить();

КонецПроцедуры
