
Процедура ЗаписатьСеансы(ТаблицаСеансов, Кластер, ПериодЗаписи) Экспорт
	
	Для каждого ТекСтрока из ТаблицаСеансов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.session) Тогда
			МЗ = РегистрыСведений.ксСеансы.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ,ТекСтрока); 
			МЗ.session = Новый УникальныйИдентификатор(ТекСтрока.session);
			МЗ.infobase = Новый УникальныйИдентификатор(ТекСтрока.infobase);
			МЗ.process = Новый УникальныйИдентификатор(ТекСтрока.process);		
			Если ТекСтрока.appId = "1CV8C" Тогда
				МЗ.appId = "Тонкий клиент";
			ИначеЕсли  ТекСтрока.appId = "BackgroundJob" Тогда
				МЗ.appId = "Фоновое задание"; 
			ИначеЕсли ТекСтрока.appId = "WebClient" Тогда
				МЗ.appId = "Веб-клиент";
			ИначеЕсли ТекСтрока.appId = "HTTPServiceConnection" Тогда
				МЗ.appId = "Соединение с HTTP-сервисом";
			ИначеЕсли ТекСтрока.appId = "SrvrConsole" Тогда
				МЗ.appId = "Консоль кластера"; 				 
			ИначеЕсли ТекСтрока.appId = "Designer" Тогда
				МЗ.appId = "Конфигуратор";  
			ИначеЕсли ТекСтрока.appId = "1CV8" Тогда
				МЗ.appId = "Толстый клиент";
			КонецЕсли;
	        МЗ.startedAt = xmlЗначение(тип("дата"), ТекСтрока.startedAt);
			МЗ.lastActiveAt = xmlЗначение(тип("дата"), ТекСтрока.lastActiveAt);
			Если ТекСтрока.hibernate = "yes" Тогда
				МЗ.hibernate = Истина; 
			Иначе
				МЗ.hibernate = Ложь; 
			КонецЕсли;
			МЗ.Кластер = Кластер;
			МЗ.ПериодЗаписи = ПериодЗаписи;
			МЗ.Записать();
			Если ТекСтрока.dbProcInfo <> "" Тогда
				МЗ = РегистрыСведений.ксСеансыSQL.СоздатьМенеджерЗаписи(); 				
				ЗаполнитьЗначенияСвойств(МЗ,ТекСтрока); 
				МЗ.session = Новый УникальныйИдентификатор(ТекСтрока.session);
				МЗ.infobase = Новый УникальныйИдентификатор(ТекСтрока.infobase);
				МЗ.process = Новый УникальныйИдентификатор(ТекСтрока.process);
				МЗ.dbProcInfo = Число(СтрЗаменить(ТекСтрока.dbProcInfo,Символ(34),""));
				Если ТекСтрока.appId = "1CV8C" Тогда
					МЗ.appId = "Тонкий клиент";
				ИначеЕсли  ТекСтрока.appId = "BackgroundJob" Тогда
					МЗ.appId = "Фоновое задание"; 
				ИначеЕсли ТекСтрока.appId = "WebClient" Тогда
					МЗ.appId = "Веб-клиент";
				ИначеЕсли ТекСтрока.appId = "HTTPServiceConnection" Тогда
					МЗ.appId = "Соединение с HTTP-сервисом";
				ИначеЕсли ТекСтрока.appId = "SrvrConsole" Тогда
					МЗ.appId = "Консоль кластера"; 				 
				ИначеЕсли ТекСтрока.appId = "Designer" Тогда
					МЗ.appId = "Конфигуратор";  
				ИначеЕсли ТекСтрока.appId = "1CV8" Тогда
					МЗ.appId = "Толстый клиент";
				КонецЕсли;
		        МЗ.startedAt = xmlЗначение(тип("дата"), ТекСтрока.startedAt);
				МЗ.lastActiveAt = xmlЗначение(тип("дата"), ТекСтрока.lastActiveAt);
				Если ТекСтрока.hibernate = "yes" Тогда
					МЗ.hibernate = Истина; 
				Иначе
					МЗ.hibernate = Ложь; 
				КонецЕсли;
				МЗ.Кластер = Кластер;				
				МЗ.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
