
Функция ВернутьМассивСловКУдалению(Тэг = "") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("тэг",Тэг);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МусорныеСлова.Наименование КАК Наименование
		|ИЗ
		|	Справочник.ксМусорныеСлова КАК МусорныеСлова
		|ГДЕ
		|	НЕ МусорныеСлова.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА ДЛИНАСТРОКИ(&ТЭГ) = 0
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ МусорныеСлова.тэг = &ТЭГ
		|		КОНЕЦ" ;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Наименование");
	
КонецФункции

Функция ПочиститьСтроку(ОбрабатываемаяСтрока, МассивМусорныхСлов) Экспорт

	мСтрокаКОбработке = ОбрабатываемаяСтрока;
	Для каждого ТекСлово из МассивМусорныхСлов Цикл
		мСтрокаКОбработке = СтрЗаменить(мСтрокаКОбработке,ТекСлово,"");				
	КонецЦикла;
	
	Возврат СокрЛП(мСтрокаКОбработке);	
	
КонецФункции
