		 
		 
		 
		 
#Область Сериализация

Функция ДесереализацияJSON(Строка_json) Экспорт
	
	ЧтениеJSON 			= Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку(Строка_json); 
	ДанныеЗагрузки		=	ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат ДанныеЗагрузки;
	
КонецФункции  

Функция СерилизацияJSON(ЗначениеСериализации) Экспорт	
	
	//2. сериализуем массив клиентов в JSON 
	ЗаписьJSON 		= Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, ЗначениеСериализации); 
	СтрокаДляОтвета = ЗаписьJSON.Закрыть(); 
	Возврат СтрокаДляОтвета;
	
КонецФункции


#КонецОбласти

#Область http_Запросы

Функция ВыполнитьЗапрос(JKL)  
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	НастройкаПрокси = Неопределено;
	Порт = Неопределено;	
	Таймаут = 60;   
	jira_сервер = "sd.istk.ru"; 
	jira_токен	=	"NzQ0NzE3Mjk3ODIxOqweF2v3Lig/ACLJV36/En4fVjZJ";
	 
	
	СоединениеHTTP = Новый HTTPСоединение(jira_сервер, Порт, , , НастройкаПрокси,Таймаут, ЗащищенноеСоединение);
	НовыйЗапрос = Новый HTTPЗапрос;
	
	castom_jql = "search?jql="+JKL;
	
	НовыйЗапрос.АдресРесурса = "/rest/api/2/"+castom_jql;
	
	НовыйЗапрос.Заголовки.Вставить("Accept","application/json");
	НовыйЗапрос.Заголовки.Вставить("Content-Type","application/json");
	
	//Аутентификация BearerToken	
	ПрефиксТокена = "Bearer";
	НовыйЗапрос.Заголовки.Вставить("Authorization", ПрефиксТокена +" "+jira_токен);
	
	ВидЗапроса = "GET";
	
	НачалоВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ОтветHTTP = СоединениеHTTP.ВызватьHTTPМетод(ВидЗапроса, НовыйЗапрос);
	ОкончаниеВыполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Длительность = ОкончаниеВыполнения - НачалоВыполнения;
	
	КодСостояния = ОтветHTTP.КодСостояния;
	ТелоОтветаСтрока = ОтветHTTP.ПолучитьТелоКакСтроку();  
	
	Если КодСостояния<>200 Тогда
		Сообщить(""+КодСостояния+" ("+JKL+") "+ТелоОтветаСтрока); 
		Возврат Неопределено;
	КонецЕсли; 
	
	строка_http = ТелоОтветаСтрока; 
	
	ТелоОтветаСтрока	=	СтрЗаменить(ТелоОтветаСтрока,"48x48","key48");	
	ТелоОтветаСтрока	=	СтрЗаменить(ТелоОтветаСтрока,"24x24","key24");
	ТелоОтветаСтрока	=	СтрЗаменить(ТелоОтветаСтрока,"16x16","key16");
	ТелоОтветаСтрока	=	СтрЗаменить(ТелоОтветаСтрока,"32x32","key32");
	
	Возврат ДесереализацияJSON(ТелоОтветаСтрока); 
	
КонецФункции


#КонецОбласти


Функция ВернутьВремяИТПоЗадачам(ДатаНачала,ДатаОкончания,АналитикаИТ)

	Запрос = Новый Запрос;
	мМассивПользователейИТ	=	новый Массив;
	
	//Установка значений параметров
	Запрос.УстановитьПараметр("ДатаНачало", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонец", ДатаОкончания);
	//Параметр "name_jira" (Список значений) 
	Если ЗначениеЗаполнено(АналитикаИТ) Тогда
        мМассивПользователейИТ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АналитикаИТ,"ТЧ_Аналитики").Выгрузить().выгрузитьКолонку("ИмяПоля");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("name_jira", мМассивПользователейИТ);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ВложенныйЗапрос.issue_key КАК issue_key,
	|	СУММА(ВложенныйЗапрос.hours_spent) КАК Часы
	|ИЗ
	|	(ВЫБРАТЬ
	|		dwh_1_jira_issues.issue_key КАК issue_key,
	|		dwh_1_jira_issues.issue_summary КАК issue_summary,
	|		ВложенныйЗапрос.updated_at КАК updated_at,
	|		ВложенныйЗапрос.comment КАК comment,
	|		ВложенныйЗапрос.hours_spent КАК hours_spent,
	|		dwh_1_jira_assignees.name КАК name_jira,
	|		dwh_1_jira_assignees.display_name КАК ФИО
	|	ИЗ
	|		(ВЫБРАТЬ
	|			dwh_1_jira_worklogs.updated_at КАК updated_at,
	|			dwh_1_jira_worklogs.comment КАК comment,
	|			dwh_1_jira_issues_measures_wl.project_id КАК project_id,
	|			dwh_1_jira_issues_measures_wl.reporter_id КАК reporter_id,
	|			dwh_1_jira_issues_measures_wl.assignee_id КАК assignee_id,
	|			dwh_1_jira_issues_measures_wl.issue_type_id КАК issue_type_id,
	|			dwh_1_jira_issues_measures_wl.issue_id КАК issue_id,
	|			dwh_1_jira_issues_measures_wl.hours_spent КАК hours_spent
	|		ИЗ
	|			ВнешнийИсточникДанных.кст_Jira_sql.Таблица.dwh_1_jira_worklogs КАК dwh_1_jira_worklogs
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.кст_Jira_sql.Таблица.dwh_1_jira_issues_measures_wl КАК dwh_1_jira_issues_measures_wl
	|				ПО dwh_1_jira_worklogs.id = dwh_1_jira_issues_measures_wl.worklog_id
	|		ГДЕ
	|			dwh_1_jira_worklogs.updated_at МЕЖДУ &ДатаНачало И &ДатаКонец) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.кст_Jira_sql.Таблица.dwh_1_jira_issues КАК dwh_1_jira_issues
	|			ПО ВложенныйЗапрос.issue_id = dwh_1_jira_issues.id
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВнешнийИсточникДанных.кст_Jira_sql.Таблица.dwh_1_jira_assignees КАК dwh_1_jira_assignees
	|			ПО ВложенныйЗапрос.assignee_id = dwh_1_jira_assignees.id) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.name_jira В(&name_jira)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.issue_key
	|";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Результат.Индексы.Добавить("issue_key");
	
	Возврат Результат;
	
КонецФункции


Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	мТаблицаДанных = Новый ТаблицаЗначений;
	мТаблицаДанных.Колонки.Добавить("Задача");
	мТаблицаДанных.Колонки.Добавить("Описание");
	мТаблицаДанных.Колонки.Добавить("Статус");
	мТаблицаДанных.Колонки.Добавить("Исполнитель");
	мТаблицаДанных.Колонки.Добавить("Автор");
	мТаблицаДанных.Колонки.Добавить("Дата");
	мТаблицаДанных.Колонки.Добавить("Приоритет");
	мТаблицаДанных.Колонки.Добавить("Проект");	
	мТаблицаДанных.Колонки.Добавить("Company");
	
	мТаблицаДанных.Колонки.Добавить("Департамент");
	мТаблицаДанных.Колонки.Добавить("ДепартаментЗаказчика");
	мТаблицаДанных.Колонки.Добавить("Заказчик");
	мТаблицаДанных.Колонки.Добавить("ВидЗапроса");	
	мТаблицаДанных.Колонки.Добавить("Категория");
	мТаблицаДанных.Колонки.Добавить("Метки"); 
	мТаблицаДанных.Колонки.Добавить("КоличествоВРаботе"); 
	мТаблицаДанных.Колонки.Добавить("КоличествоВыполнено"); 
	мТаблицаДанных.Колонки.Добавить("ПотраченоЧасов"); 
	мТаблицаДанных.Колонки.Добавить("ПотраченоЧасовИТ"); 
	
	//мТаблицаДанных.Колонки.Добавить("Спринт");
	мМассивИсполнителей	=	новый Массив;	
	Настройки 	= КомпоновщикНастроек.ПолучитьНастройки();		
	
	мАналитикаНастройка = 	Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Аналитика"));
	мАналитика			=	Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Аналитика")).Значение;
	
	//<< Danilin.V 07.05.2026 SD-172229
	мАналитикаИТ		=	Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("АналитикаИТ")).Значение;
	Если не ЗначениеЗаполнено(мАналитикаИТ) Тогда
		мАналитикаИТ	=	Справочники.зд_АналитикаJira.ПолучитьСсылку(Новый УникальныйИдентификатор("d19e0a05-4a08-11f1-9187-e8ebd36d0f8f"));	
	КонецЕсли;//<< Danilin.V 07.05.2026 SD-172229
	
	мСтандартныйПериод 	= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтандартныйПериод")).Значение;
	
	Если мАналитикаНастройка.Использование и ЗначениеЗаполнено(мАналитика) Тогда
		мМассивИсполнителей = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(мАналитика,"ТЧ_Аналитики").Выгрузить().выгрузитьКолонку("ИмяПоля");
	КонецЕсли;
	
	
	//СимволКовычка = Символ(34); 
    мИсполнители = СтрСоединить(мМассивИсполнителей,?(мМассивИсполнителей.количество()>1,", ","")); 
	
	Итератор		=	1;
	ДнейИтератор	=	5;
	мДатаНачала 	=	мСтандартныйПериод.ДатаНачала;
	мДатаОкончания 	= 	НачалоДня(мДатаНачала)+(86400*ДнейИтератор);  
	Пока мДатаОкончания	<	мСтандартныйПериод.ДатаОкончания Цикл
		Сообщить(СтрШаблон("Итератор: %1 (%2 - %3)",Итератор,мДатаНачала,мДатаОкончания));
		ВыполнитьЗапросИЗаполнитьТаблицу(мТаблицаДанных,мМассивИсполнителей,мИсполнители,мДатаНачала,мДатаОкончания);
		

		//---------------
		мДатаНачала		=	началодня(КонецДня(мДатаОкончания)+1);	
		мДатаОкончания 	= 	Мин(НачалоДня(мДатаНачала)+(86400*ДнейИтератор),мСтандартныйПериод.ДатаОкончания);  
		Итератор		=	Итератор+1;				
	КонецЦикла;
	
	Сообщить(СтрШаблон("Итератор: %1 (%2 - %3)",Итератор,мДатаНачала,мДатаОкончания));	
	ВыполнитьЗапросИЗаполнитьТаблицу(мТаблицаДанных,мМассивИсполнителей,мИсполнители,мДатаНачала,мДатаОкончания);	
	
	//<< Danilin.V 07.05.2026 SD-172229
	мТаблицаЗадачВремениИТ	=	ВернутьВремяИТПоЗадачам(мСтандартныйПериод.ДатаНачала,
								мСтандартныйПериод.ДатаОкончания,мАналитикаИТ);
								
								
	//расстановка времени
	мМассивСтрок	=	Неопределено;
	Для каждого ТекСтрока из мТаблицаДанных Цикл
		мМассивСтрок	=	мТаблицаЗадачВремениИТ.НайтиСтроки(Новый Структура("issue_key",ТекСтрока.Задача));
		Если мМассивСтрок.количество() Тогда
			ТекСтрока.ПотраченоЧасовИТ	=	мМассивСтрок[0].Часы;	
		КонецЕсли;
		
	КонецЦикла;
								
	//Danilin.V>>
	//------------------------------------------------------------------------------------------------------
	СтандартнаяОбработка 		= Ложь;	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); 
	
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
	
	ВнешнийНаборДанных = Новый Структура("ТаблицаДанных", мТаблицаДанных);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных, ДанныеРасшифровки);	
	
	ДокументРезультат.Очистить();	
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);   	
	
КонецПроцедуры  

Процедура ВыполнитьЗапросИЗаполнитьТаблицу(мТаблицаДанных,мМассивИсполнителей,мИсполнители,ДатаНачала,ДатаОкончания)

	jkl = "project in (SD, DEV) AND (created >= %1 AND created < %2) OR (resolved >= %1 AND resolved < %2) AND assignee in ( %3 ) &maxResults=10000";
	мИскатьИсполнителей	= мМассивИсполнителей.Количество()>0;
	
	Если  мИскатьИсполнителей Тогда
		jkl = СтрШаблон(jkl,формат(ДатаНачала,"ДФ=yyyy-MM-dd"),формат(ДатаОкончания,"ДФ=yyyy-MM-dd"),мИсполнители);		
	Иначе
		jkl = СтрЗаменить(jkl,"AND assignee in ( %3 ) ","");		
		jkl = СтрШаблон(jkl,формат(ДатаНачала,"ДФ=yyyy-MM-dd"),формат(ДатаОкончания,"ДФ=yyyy-MM-dd"));	
		
	КонецЕсли;
	
	ДанныеАпи = ВыполнитьЗапрос(jkl);         
	
	МассивСтатусовЗакрыто = Новый Массив;
	МассивСтатусовЗакрыто.Добавить("Выполнена");
	МассивСтатусовЗакрыто.Добавить("Закрыта");

	Для каждого ТекСтрока из ДанныеАпи.issues Цикл 
		
		Если мИскатьИсполнителей Тогда
			Если ЗначениеЗаполнено(ТекСтрока.fields.assignee) Тогда
				Если мМассивИсполнителей.найти(ТекСтрока.fields.assignee.name)<>Неопределено Тогда
					НоваяСтрока = мТаблицаДанных.Добавить();			
					
				Иначе
					Продолжить;
				КонецЕсли;			
			Иначе 
				Продолжить;
			КонецЕсли;		
		Иначе       
			МассивСтрокПоЗадаче	=	мТаблицаДанных.найтиСтроки(Новый Структура("Задача",ТекСтрока.key));
			Если МассивСтрокПоЗадаче.Количество() Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = мТаблицаДанных.Добавить();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекСтрока.fields.aggregatetimespent) 
			и ТекСтрока.fields.aggregatetimespent>0 Тогда
			НоваяСтрока.ПотраченоЧасов	=	Окр(ТекСтрока.fields.aggregatetimespent/3600,2);	
		КонецЕсли;
		    	   
		Если ТекСтрока.fields.Свойство("customfield_10519") Тогда
			НоваяСтрока.Company	=	ТекСтрока.fields.customfield_10519;	
		КонецЕсли;                                                      	
		
		НоваяСтрока.Проект	=	ТекСтрока.fields.project.key;	
		НоваяСтрока.Задача = ТекСтрока.key;
		НоваяСтрока.Описание = ТекСтрока.fields.summary;
		НоваяСтрока.Статус = ТекСтрока.fields.status.name;
		
		НоваяСтрока.Исполнитель = СтрШаблон("(%1) %2",ТекСтрока.fields.assignee.name,ТекСтрока.fields.assignee.displayName);
		НоваяСтрока.Автор = ТекСтрока.fields.creator.displayName;
		НоваяСтрока.Дата = Дата(СтрЗаменить(лев(ТекСтрока.fields.created,10),"-",""));  
		НоваяСтрока.Приоритет = ТекСтрока.fields.priority.name;

		
		НоваяСтрока.Департамент = ТекСтрока.fields.customfield_10120;  
		
		//<< Danilin.V 06.04.2026 SD-168266
		НоваяСтрока.ДепартаментЗаказчика = ТекСтрока.fields.customfield_12100;  
		Если ТекСтрока.fields.Свойство("customfield_10328") 
			И ТекСтрока.fields.customfield_10328<>Неопределено Тогда
			НоваяСтрока.Заказчик = ТекСтрока.fields.customfield_10328.displayName;  
		КонецЕсли;
		//Danilin.V>>
		
		
		Если ТекСтрока.fields.Свойство("customfield_10300") Тогда
			НоваяСтрока.ВидЗапроса = ?(ТекСтрока.fields.customfield_10300=Неопределено,"",ТекСтрока.fields.customfield_10300.value);
		КонецЕсли;
		
		Если ТекСтрока.fields.Свойство("customfield_10206") и 
			ТекСтрока.fields.customfield_10206 <> Неопределено Тогда 
			
			Если  ТипЗнч(ТекСтрока.fields.customfield_10206) = Тип("Массив") Тогда			
				мПредставление = "";
				Для каждого ТекЭлемента из ТекСтрока.fields.customfield_10206 Цикл
					мПредставление = мПредставление+ТекЭлемента.value+"/";	
				КонецЦикла;			
				НоваяСтрока.Категория = мПредставление;
			КонецЕсли;
		КонецЕсли;
		
		Если  Тип(ТекСтрока.fields.labels) = Тип("Массив") Тогда
			мПредставление = "";
			Для каждого ТекЭлемента из ТекСтрока.fields.labels Цикл
				мПредставление = мПредставление+ТекЭлемента+"/";	
			КонецЦикла;			
			НоваяСтрока.Метки = мПредставление;
		КонецЕсли;  
		
		Если МассивСтатусовЗакрыто.Найти(НоваяСтрока.Статус)<> Неопределено Тогда
			НоваяСтрока.КоличествоВыполнено = 1;
		Иначе
			НоваяСтрока.КоличествоВРаботе = 1;
		КонецЕсли; 	
	КонецЦикла;





КонецПроцедуры


