
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 ФайлыBSL.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	 //Элементы.ФайлыBSL.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФайлыBSLПриАктивизацииСтрокиНаСервере(ТекСтр)
	Рез = ""; 
	Если ЗначениеЗаполнено(ТекСтр) Тогда
		Путь = ТекСтр.Путь;
	Иначе
		Путь = "";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Содержимое КАК Содержимое
		|ИЗ
		|	РегистрСведений.ФайлыBSL КАК Т
		|ГДЕ
		|	Т.Путь = &Путь";
	
	Запрос.УстановитьПараметр("Путь", Путь);
	
	РезультатЗапроса = Запрос.Выполнить(); 

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез = ВыборкаДетальныеЗаписи.Содержимое;
	КонецЦикла; 
    Возврат Рез;
КонецФункции

&НаКлиенте
Процедура ФайлыBSLПриАктивизацииСтроки(Элемент)
	ТекСтр = Элементы.ФайлыBSL.ТекущаяСтрока;
	Содержимое = ФайлыBSLПриАктивизацииСтрокиНаСервере(ТекСтр); 
КонецПроцедуры
