
Функция Хэш(СтрокаХэш, hash=0, M = 31, TABLE_SIZE = 18446744073709551616)
    //TABLE_SIZE = 18446744073709551615; 64 бита
    //M = 31; Умножитель
    ДлинаСтроки = СтрДлина(СтрокаХэш);
    Для к=1 по ДлинаСтроки цикл
        hash = M * hash + КодСимвола(Сред(СтрокаХэш,к,1));
    конеццикла;
    возврат hash%TABLE_SIZE;
КонецФункции

// Для ускорения работы с большими текстами их надо передавать блоками
// Данная функция разбивает исходный текст (Параметр "Строка") на блоки
// длиной ДлинаБлока и вычислет хэш блоками возвращая результат для всего текста.
Функция ХэшБлоками(Строка, ДлинаБлока = 64, hash = 0, M = 31, TABLE_SIZE = 18446744073709551616) 
     НачПозиция = 1;
     ДлинаСтроки = СтрДлина(Строка);
      Пока  НачПозиция<=ДлинаСтроки цикл
        hash = Хэш(Сред(Строка, НачПозиция, ДлинаБлока), hash, M, TABLE_SIZE);
        НачПозиция = НачПозиция + ДлинаБлока;
    КонецЦикла;
    возврат hash;
КонецФункции 

Процедура ПоискФайловBSL() Экспорт
	
	Файлы = НайтиФайлы("\\office.local\1c\1c_exchange\ERP\", "*.bsl", Истина);
	Для Каждого Ф Из Файлы Цикл
	 	РегистрыСведений.ФайлыBSL.ДобавитьЗапись(Неопределено,Ф.ПолноеИмя); 	
	КонецЦикла;
КонецПроцедуры   

Процедура ЗаполнитьСодержимоеФайловBSL() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыBSL.Путь КАК Путь,
		|	ФайлыBSL.Содержимое КАК Содержимое,
		|	ФайлыBSL.ДатаФайла КАК ДатаФайла,
		|	ФайлыBSL.Хэш КАК Хэш,
		|	ФайлыBSL.Загружен КАК Загружен
		|ИЗ
		|	РегистрСведений.ФайлыBSL КАК ФайлыBSL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Файл = Новый ЧтениеТекста(ВыборкаДетальныеЗаписи.Путь);
		БлокнотТекст = Файл.Прочитать();
		ТекущийХэш = ХэшБлоками(БлокнотТекст);
		Если ТекущийХэш <> ВыборкаДетальныеЗаписи.Хэш Тогда 
			Данные = Новый Структура;
			Данные.Вставить("Содержимое", БлокнотТекст);
			Данные.Вставить("Хэш", ТекущийХэш); 
			Данные.Вставить("Загружен", ТекущаяДата());
			РегистрыСведений.ФайлыBSL.ДобавитьЗапись(Данные,ВыборкаДетальныеЗаписи.Путь);	
		КонецЕсли;
		//Сообщить(БлокнотТекст);
		Файл.Закрыть();
	КонецЦикла;

КонецПроцедуры 

Процедура ЭаполнитьЭлементыКонфигурации() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыBSL.Путь КАК Путь,
		|	Конф.ПутьВыгрузки КАК ПутьВыгрузки,
		|	Конф.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ФайлыBSL КАК ФайлыBSL
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Конфигурация КАК Конф
		|		ПО (ФайлыBSL.Путь ПОДОБНО Конф.ПутьВыгрузки + ""%"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Конф.ПутьВыгрузки + ""\"" + Эл.Наименование КАК Путь
		|		ИЗ
		|			Справочник.ЭлементКонфигурации КАК Эл
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Конфигурация КАК Конф
		|				ПО Эл.Владелец = Конф.Ссылка) КАК Элементы
		|		ПО (ФайлыBSL.Путь ПОДОБНО Элементы.Путь + ""%"")
		|ГДЕ
		|	Элементы.Путь ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Наименование = ПолучитьНазваниеЭлемента(ВыборкаДетальныеЗаписи.Путь, ВыборкаДетальныеЗаписи.ПутьВыгрузки);
		Запрос1 = Новый Запрос;
		Запрос1.Текст = 
			"ВЫБРАТЬ
			|	ЭлементКонфигурации.Владелец КАК Владелец,
			|	ЭлементКонфигурации.Наименование КАК Наименование
			|ИЗ
			|	Справочник.ЭлементКонфигурации КАК ЭлементКонфигурации
			|ГДЕ
			|	ЭлементКонфигурации.Владелец = &Владелец
			|	И ЭлементКонфигурации.Наименование = &Наименование";
		
		Запрос1.УстановитьПараметр("Владелец", ВыборкаДетальныеЗаписи.Ссылка);
		Запрос1.УстановитьПараметр("Наименование", Наименование);
		
		РезультатЗапроса1 = Запрос1.Выполнить(); 
		
		Если РезультатЗапроса1.Пустой() Тогда
	        Эл = Справочники.ЭлементКонфигурации.СоздатьЭлемент();
			Эл.Владелец = ВыборкаДетальныеЗаписи.Ссылка;
			Эл.Наименование = Наименование;
			Эл.Записать(); 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры  

Функция ПолучитьНазваниеЭлемента(Путь, ПутьВыгрузки) 
	Рез = СтрЗаменить(Путь, ПутьВыгрузки + "\", "");
	РазделительРез = СтрНайти(Рез, "\Ext\");
	Если РазделительРез > 0 Тогда
		Рез = Лев(Рез,РазделительРез-1);
	КонецЕсли;
	Возврат Рез; 	
КонецФункции