
Функция Хэш(СтрокаХэш, hash=0, M = 31, TABLE_SIZE = 18446744073709551616)
    //TABLE_SIZE = 18446744073709551615; 64 бита
    //M = 31; Умножитель
    ДлинаСтроки = СтрДлина(СтрокаХэш);
    Для к=1 по ДлинаСтроки цикл
        hash = M * hash + КодСимвола(Сред(СтрокаХэш,к,1));
    конеццикла;
    возврат hash%TABLE_SIZE;
КонецФункции

// Для ускорения работы с большими текстами их надо передавать блоками
// Данная функция разбивает исходный текст (Параметр "Строка") на блоки
// длиной ДлинаБлока и вычислет хэш блоками возвращая результат для всего текста.
Функция ХэшБлоками(Строка, ДлинаБлока = 64, hash = 0, M = 31, TABLE_SIZE = 18446744073709551616) 
     НачПозиция = 1;
     ДлинаСтроки = СтрДлина(Строка);
      Пока  НачПозиция<=ДлинаСтроки цикл
        hash = Хэш(Сред(Строка, НачПозиция, ДлинаБлока), hash, M, TABLE_SIZE);
        НачПозиция = НачПозиция + ДлинаБлока;
    КонецЦикла;
    возврат hash;
КонецФункции 

Процедура ПоискФайловBSL() Экспорт
	//Константы.ИттерацияЗагрузкиРеестраПроцедур.Установить(0); 
	
	//Файлы = НайтиФайлы("\\office.local\1c\1c_exchange\ERP\", "*.bsl", Истина);
	//Для Каждого Ф Из Файлы Цикл
	// 	РегистрыСведений.ФайлыBSL.ДобавитьЗапись(Неопределено,Ф.ПолноеИмя); 	
	//КонецЦикла;
	//Константы.ИттерацияЗагрузкиРеестраПроцедур.Установить(1); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Конфигурация.ПутьВыгрузки КАК ПутьВыгрузки
		|ИЗ
		|	Справочник.Конфигурация КАК Конфигурация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Файлы = НайтиФайлы(ВыборкаДетальныеЗаписи.ПутьВыгрузки, "*.bsl", Истина);
		Для Каждого Ф Из Файлы Цикл
		 	РегистрыСведений.ФайлыBSL.ДобавитьЗапись(Неопределено,Ф.ПолноеИмя); 	
		КонецЦикла;	
	КонецЦикла;
    Константы.ИтерацияЗагрузкиРеестраПроцедур.Установить(1); 
КонецПроцедуры   

Процедура ЗаполнитьСодержимоеФайловBSL() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыBSL.Путь КАК Путь,
		|	ФайлыBSL.Содержимое КАК Содержимое,
		|	ФайлыBSL.Иттерация КАК Иттерация,
		|	ФайлыBSL.Хэш КАК Хэш,
		|	ФайлыBSL.Загружен КАК Загружен
		|ИЗ
		|	РегистрСведений.ФайлыBSL КАК ФайлыBSL
		|ГДЕ
		|	ФайлыBSL.Иттерация <> 1";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Файл = Новый ЧтениеТекста(ВыборкаДетальныеЗаписи.Путь);
		БлокнотТекст = Файл.Прочитать();
		ТекущийХэш = ХэшБлоками(БлокнотТекст);
		Если ТекущийХэш <> ВыборкаДетальныеЗаписи.Хэш Тогда 
			Данные = Новый Структура;
			Данные.Вставить("Содержимое", БлокнотТекст);
			Данные.Вставить("Иттерация", 1);
			Данные.Вставить("Хэш", ТекущийХэш); 
			Данные.Вставить("Загружен", ТекущаяДата());
			РегистрыСведений.ФайлыBSL.ДобавитьЗапись(Данные,ВыборкаДетальныеЗаписи.Путь);	
		КонецЕсли;
		//Сообщить(БлокнотТекст);
		Файл.Закрыть();
	КонецЦикла;
    Константы.ИтерацияЗагрузкиРеестраПроцедур.Установить(2);
КонецПроцедуры 

Процедура ЭаполнитьЭлементыКонфигурации() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыBSL.Путь КАК Путь,
		|	Конф.ПутьВыгрузки КАК ПутьВыгрузки,
		|	Конф.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.ФайлыBSL КАК ФайлыBSL
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Конфигурация КАК Конф
		|		ПО (ФайлыBSL.Путь ПОДОБНО Конф.ПутьВыгрузки + ""%"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Конф.ПутьВыгрузки + ""\"" + Эл.Наименование КАК Путь
		|		ИЗ
		|			Справочник.ЭлементКонфигурации КАК Эл
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Конфигурация КАК Конф
		|				ПО Эл.Владелец = Конф.Ссылка) КАК Элементы
		|		ПО (ФайлыBSL.Путь ПОДОБНО Элементы.Путь + ""%"")
		|ГДЕ
		|	Элементы.Путь ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Наименование = ПолучитьНазваниеЭлемента(ВыборкаДетальныеЗаписи.Путь, ВыборкаДетальныеЗаписи.ПутьВыгрузки);
		Запрос1 = Новый Запрос;
		Запрос1.Текст = 
			"ВЫБРАТЬ
			|   ЭлементКонфигурации.Ссылка КАК Ссылка,
			|	ЭлементКонфигурации.Владелец КАК Владелец,
			|	ЭлементКонфигурации.Наименование КАК Наименование
			|ИЗ
			|	Справочник.ЭлементКонфигурации КАК ЭлементКонфигурации
			|ГДЕ
			|	ЭлементКонфигурации.Владелец = &Владелец
			|	И ЭлементКонфигурации.Наименование = &Наименование";
		
		Запрос1.УстановитьПараметр("Владелец", ВыборкаДетальныеЗаписи.Ссылка);
		Запрос1.УстановитьПараметр("Наименование", Наименование);
		
		РезультатЗапроса1 = Запрос1.Выполнить(); 
		
		Если РезультатЗапроса1.Пустой() Тогда
	        Эл = Справочники.ЭлементКонфигурации.СоздатьЭлемент();
			Эл.Владелец = ВыборкаДетальныеЗаписи.Ссылка;
			Эл.Наименование = Наименование;
			Эл.Записать();
			Данные = Новый Структура;
			Данные.Вставить("Элемент", Эл.Ссылка);
			РегистрыСведений.ФайлыBSL.ДобавитьЗапись(Данные,ВыборкаДетальныеЗаписи.Путь);
		Иначе
			 ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
	
			 Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
				Данные = Новый Структура;
				Данные.Вставить("Элемент", ВыборкаДетальныеЗаписи1.Ссылка);
				РегистрыСведений.ФайлыBSL.ДобавитьЗапись(Данные,ВыборкаДетальныеЗаписи.Путь);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Константы.ИтерацияЗагрузкиРеестраПроцедур.Установить(3);
КонецПроцедуры  

Функция ПолучитьНазваниеЭлемента(Путь, ПутьВыгрузки) 
	Рез = СтрЗаменить(Путь, ПутьВыгрузки + "\", "");
	РазделительРез = СтрНайти(Рез, "\Ext\");
	Если РазделительРез > 0 Тогда
		Рез = Лев(Рез,РазделительРез-1);
	КонецЕсли;
	Возврат Рез; 	
КонецФункции

Процедура ЗаполнитьМетоды() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыBSL.Путь КАК Путь,
		|	Элементы.Конфигурация КАК Конфигурация,
		|	Элементы.Элемент КАК Элемент,
		|   Элементы.Путь КАК ПутьЭлемента,
		|   Элементы.Наименование КАК Наименование,
		|	ФайлыBSL.Содержимое КАК Содержимое
		|ИЗ
		|	РегистрСведений.ФайлыBSL КАК ФайлыBSL
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Конф.ПутьВыгрузки + ""\"" + Эл.Наименование + ""\Ext\"" КАК Путь,
		|			Конф.Ссылка КАК Конфигурация,
		|			Эл.Ссылка КАК Элемент,
		|			Эл.Наименование КАК Наименование
		|		ИЗ
		|			Справочник.ЭлементКонфигурации КАК Эл
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Конфигурация КАК Конф
		|				ПО Эл.Владелец = Конф.Ссылка) КАК Элементы
		|		ПО (ФайлыBSL.Элемент = Элементы.Элемент)
		|ГДЕ
		|		ФайлыBSL.Иттерация = 1";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		    ДобавитьМетоды(ВыборкаДетальныеЗаписи.Конфигурация, 
							ВыборкаДетальныеЗаписи.Элемент, 
							ВыборкаДетальныеЗаписи.Путь, 
							ВыборкаДетальныеЗаписи.ПутьЭлемента,
							ВыборкаДетальныеЗаписи.Наименование,
							ВыборкаДетальныеЗаписи.Содержимое);
		Данные = Новый Структура;
		Данные.Вставить("Иттерация", 3);
		Данные.Вставить("Методы", ТекущаяДата());
		РегистрыСведений.ФайлыBSL.ДобавитьЗапись(Данные,ВыборкаДетальныеЗаписи.Путь);
	КонецЦикла;

    Константы.ИтерацияЗагрузкиРеестраПроцедур.Установить(4);
КонецПроцедуры  

Процедура ЗаполнитьВызовы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыBSL.Путь КАК Путь,
		|	Элементы.Конфигурация КАК Конфигурация,
		|	Элементы.Элемент КАК Элемент,
		|   Элементы.Путь КАК ПутьЭлемента,
		|   Элементы.Наименование КАК Наименование,
		|	ФайлыBSL.Содержимое КАК Содержимое
		|ИЗ
		|	РегистрСведений.ФайлыBSL КАК ФайлыBSL
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Конф.ПутьВыгрузки + ""\"" + Эл.Наименование + ""\Ext\"" КАК Путь,
		|			Конф.Ссылка КАК Конфигурация,
		|			Эл.Ссылка КАК Элемент,
		|			Эл.Наименование КАК Наименование
		|		ИЗ
		|			Справочник.ЭлементКонфигурации КАК Эл
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Конфигурация КАК Конф
		|				ПО Эл.Владелец = Конф.Ссылка) КАК Элементы
		|		ПО (ФайлыBSL.Элемент = Элементы.Элемент)
		|ГДЕ
		|		ФайлыBSL.Иттерация = 3";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		    ДобавитьВызовы(ВыборкаДетальныеЗаписи.Конфигурация, 
							ВыборкаДетальныеЗаписи.Элемент, 
							ВыборкаДетальныеЗаписи.Путь, 
							ВыборкаДетальныеЗаписи.ПутьЭлемента,
							ВыборкаДетальныеЗаписи.Наименование,
							ВыборкаДетальныеЗаписи.Содержимое);
		Данные = Новый Структура;
		Данные.Вставить("Иттерация", 4);
		Данные.Вставить("Вызовы", ТекущаяДата());
		РегистрыСведений.ФайлыBSL.ДобавитьЗапись(Данные,ВыборкаДетальныеЗаписи.Путь);
	КонецЦикла;


	//Возврат в исходную позизию
    Константы.ИтерацияЗагрузкиРеестраПроцедур.Установить(0);
КонецПроцедуры 

Процедура ДобавитьВызовы(Конфигурация, Элемент, Путь, ПутьЭлемента, Наименование, Содержимое)
	
	//ТипМ = ПолучитьТип(Путь, ПутьЭлемента);
	//ЭлПапка = ПолучитьПапку(Папка);
	//ПоисковоеЗначение = "КонецПроцедуры";
	//НачалоМетода = 0;
	//КонецМетода = 0;
	//ТекущиеМетоды = Новый Массив;

	Для Индекс = 1 По СтрЧислоСтрок(Содержимое) Цикл
        стр = СтрПолучитьСтроку(Содержимое, Индекс);
		ПозП = СтрНайти(стр, ".");
        ПозЭ = СтрНайти(стр, "(");
		Если ПозП > 0 И ПозЭ > 0 И ПозЭ > ПозП  Тогда
			ПоисковоеЗначение = Сред(стр, ПозП+1, ПозЭ-ПозП-1) ;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Методы.Ссылка КАК Ссылка,
			|	Методы.Наименование КАК Наименование,
			|	Методы.Метаданные КАК Метаданные,
			|	Методы.Родитель КАК Родитель
			|ИЗ
			|	Справочник.Методы КАК Методы
			|ГДЕ
			|	Методы.Наименование = &ПоисковоеЗначение И ЭтоГруппа = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ПоисковоеЗначение", ПоисковоеЗначение);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Метод = ВыборкаДетальныеЗаписи.Ссылка;
			ЗапросМетаданные = ВыборкаДетальныеЗаписи.Метаданные;
			ЗапросРодитель = ВыборкаДетальныеЗаписи.Родитель;
			СтрокаЛево = СокрЛ(Лев(стр, ПозП-1));
			Если СтрокаЛево = Строка(ЗапросРодитель) Тогда
				РегистрыСведений.ОбращенияКМетодам.ДобавитьЗапись(ЗапросМетаданные, Метод, Элемент);
			КонецЕсли;
			
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
		КонецЦикла;
	
	
		КонецЕсли;
				
	КонецЦикла;
							
КонецПроцедуры


Процедура ДобавитьМетоды(Конфигурация, Элемент, Путь, ПутьЭлемента, Папка, Содержимое)
	
	ТипМ = ПолучитьТип(Путь, ПутьЭлемента);
	ЭлПапка = ПолучитьПапку(Папка);
	ПоисковоеЗначение = "КонецПроцедуры";
	НачалоМетода = 0;
	КонецМетода = 0;
	ТекущиеМетоды = Новый Массив;

	Для Индекс = 1 По СтрЧислоСтрок(Содержимое) Цикл
        стр = СтрПолучитьСтроку(Содержимое, Индекс);
		ПозФ = СтрНайти(стр, "Функция ");
		ПозП = СтрНайти(стр, "Процедура ");
        ПозЭ = СтрНайти(стр, " Экспорт");
		ПозОкон = СтрНайти(стр, ПоисковоеЗначение);
		Если ПозП > 0 И ПозЭ > 0 Тогда
			ПоисковоеЗначение = "КонецПроцедуры";
			НачалоМетода = Индекс;
		ИначеЕсли ПозФ > 0 И ПозЭ > 0 Тогда
			ПоисковоеЗначение = "КонецФункции";
			НачалоМетода = Индекс;
		КонецЕсли;
		Если ПозОкон > 0 Тогда
			КонецМетода = Индекс;
			Если КонецМетода >= НачалоМетода И НачалоМетода > 0 Тогда
				Код = ПолучитьКод(Содержимое, НачалоМетода, КонецМетода);
                Наименование = ПолучитьНаименование(Содержимое, НачалоМетода, ПоисковоеЗначение); 
				Описание = ПолучитьОписание(Содержимое, НачалоМетода, КонецМетода);
				ДобавитьМетод(Конфигурация, Элемент, ТипМ, Наименование, Описание, Код, ЭлПапка);
				ТекущиеМетоды.Добавить(Наименование);
				НачалоМетода = 0;
				КонецМетода = 0;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	АктуализироватьМетоды(Конфигурация, Элемент, ТипМ, ТекущиеМетоды);
				
КонецПроцедуры 

Функция ПолучитьКод(Содержимое, НачалоМетода, КонецМетода)
	Рез = "";
	Для Индекс = НачалоМетода По КонецМетода Цикл
		Рез = Рез + СтрПолучитьСтроку(Содержимое, Индекс) + Символы.ПС;	
	КонецЦикла;
	Возврат Рез;
КонецФункции

Функция ПолучитьНаименование(Содержимое, НачалоМетода, ПоисковоеЗначение) 
	Рез = СтрПолучитьСтроку(Содержимое, НачалоМетода);
	Поз = СтрНайти(Рез, "(");
	Если Поз > 0 Тогда
		Рез = Лев(Рез, Поз -1);	
	КонецЕсли;

	Если ПоисковоеЗначение = "КонецПроцедуры" Тогда
		Рез = СтрЗаменить(Рез, "Процедура ", "");	
	ИначеЕсли ПоисковоеЗначение = "КонецФункции" Тогда
		Рез = СтрЗаменить(Рез, "Функция ", "");	
	КонецЕсли; 
	Возврат Рез;
КонецФункции

Функция ПолучитьОписание(Содержимое, НачалоМетода, КонецМетода)
	Рез = "";
	Индекс = НачалоМетода - 1; 
	Пока Индекс > 0 Цикл
		стр = СтрПолучитьСтроку(Содержимое, Индекс);

		Поз = СтрНайти(стр, "//");
		Если Поз > 0 Тогда
			Рез = стр  + Символы.ПС + Рез;	
		Иначе
			Прервать;
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Для Индекс = НачалоМетода По КонецМетода Цикл
		стр = СтрПолучитьСтроку(Содержимое, Индекс);
		Поз = СтрНайти(стр, "//"); 
		Если Поз > 0  Тогда  
			Поз1 = СтрНайти(стр, "////");
	       Если Поз1 = 0 Тогда
				Рез = Рез + Символы.ПС + Прав(стр, СтрДлина(стр) - Поз-1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Рез;
КонецФункции
	

Процедура ДобавитьМетод(Конфигурация, Элемент, ТипМ, Наименование, Описание, Код, Папка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Методы КАК Т
		|ГДЕ
		|	Т.Конфигурация = &Конфигурация
		|	И Т.Метаданные = &Метаданные
		|	И Т.Тип = &Тип
		|	И Т.Наименование = &Наименование";

	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	Запрос.УстановитьПараметр("Метаданные", Элемент);
	Запрос.УстановитьПараметр("Тип", ТипМ);
	Запрос.УстановитьПараметр("Наименование", Наименование);

	РезультатЗапроса = Запрос.Выполнить(); 
		
	Если РезультатЗапроса.Пустой() Тогда
	    Эл = Справочники.Методы.СоздатьЭлемент();
		Эл.Наименование = Наименование;
		Эл.Конфигурация = Конфигурация;
		Эл.Описание = Описание;
		Эл.КодМетода = Код;
		Эл.Тип = ТипМ;
		Эл.Метаданные = Элемент; 
		Эл.Родитель = Папка;
		Эл.Записать(); 
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СсылкаЭл = ВыборкаДетальныеЗаписи.Ссылка;
			Эл = СсылкаЭл.ПолучитьОбъект();
            Эл.Описание = Описание;
			Эл.КодМетода = Код;
			Эл.Родитель = Папка;
			Эл.Записать(); 
		КонецЦикла;
	КонецЕсли; 

КонецПроцедуры

Функция ПолучитьТип(Путь, ПутьЭлемента) 
	Рез = Перечисления.ТипыМетодов.Module;
	СтрРез = СтрЗаменить(Путь, ПутьЭлемента, "");
	СтрРез = СтрЗаменить(СтрРез, ".bsl", "");

	Если СтрРез =  "ManagerModule" Тогда
		Рез = Перечисления.ТипыМетодов.ManagerModule;
	ИначеЕсли СтрРез =  "RecordSetModule" Тогда
		Рез = Перечисления.ТипыМетодов.RecordSetModule;
	ИначеЕсли СтрРез =  "Form\Module" Тогда
		Рез = Перечисления.ТипыМетодов.FormModule;
	ИначеЕсли СтрРез =  "ObjectModule" Тогда
		Рез = Перечисления.ТипыМетодов.ObjectModule;
	ИначеЕсли СтрРез =  "ValueManagerModule" Тогда
		Рез = Перечисления.ТипыМетодов.ValueManagerModule;
	ИначеЕсли СтрРез =  "CommandModule" Тогда
		Рез = Перечисления.ТипыМетодов.CommandModule;
	КонецЕсли;
	Возврат Рез; 	
КонецФункции

Функция ПолучитьПапку(Папка)
	
	Рез = Справочники.Методы.ПустаяСсылка();
	Поз = СтрНайти(Папка, "\");
	ИмяПредопределеннойПапки = "";
	Если Поз > 0 Тогда
		ИмяПредопределеннойПапки = Лев(Папка, Поз -1);	
	КонецЕсли;
	
	Если ИмяПредопределеннойПапки = "Ext" Тогда
		Возврат Справочники.Методы.Общие.Ссылка;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Методы.ЭтоГруппа КАК ЭтоГруппа,
		|	Методы.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	Методы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Методы КАК Методы
		|ГДЕ
		|	Методы.ИмяПредопределенныхДанных = &Папка
		|	И Методы.ЭтоГруппа = Истина";
	Запрос.УстановитьПараметр("Папка", ИмяПредопределеннойПапки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Рез = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	ИмяПапки = СтрЗаменить(Папка, ИмяПредопределеннойПапки + "\", "");
	Рез = ПолучитьДочернююПапку(ИмяПапки, Рез);	
		
	Возврат Рез; 	
КонецФункции 

Функция ПолучитьДочернююПапку(Путь, ПапкаРодителя)
	Рез = Справочники.Методы.ПустаяСсылка();
	
	Поз = СтрНайти(Путь, "\");
	ИмяПапки = "";
	ОстаточныйПуть = "";
	Если Поз > 0 Тогда
		ИмяПапки = Лев(Путь, Поз -1);
		ОстаточныйПуть = СтрЗаменить(Путь, ИмяПапки + "\", "");
	Иначе
		ИмяПапки = Путь;
	КонецЕсли;
	
	Если ИмяПапки = "Forms" Тогда
		ИмяПапки = "Формы";
	ИначеЕсли ИмяПапки = "Commands" Тогда
		ИмяПапки = "Команды";
	КонецЕсли;
 	
	ЗапросТ = Новый Запрос;
	ЗапросТ.Текст = 
		"ВЫБРАТЬ
		|	Методы.ЭтоГруппа КАК ЭтоГруппа,
		|	Методы.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	Методы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Методы КАК Методы
		|ГДЕ
		|	Методы.Родитель = &ПапкаРодителя
		|	И Методы.Наименование = &ИмяПапки 
		|	И Методы.ЭтоГруппа = Истина";
	ЗапросТ.УстановитьПараметр("ИмяПапки", ИмяПапки);
	ЗапросТ.УстановитьПараметр("ПапкаРодителя", ПапкаРодителя);
	
	РезультатЗапроса = ЗапросТ.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда		
		ЭлГруппы = Справочники.Методы.СоздатьГруппу();
		ЭлГруппы.Наименование = ИмяПапки;
		ЭлГруппы.Родитель = ПапкаРодителя;
		ЭлГруппы.Записать();
		Рез = ЭлГруппы.Ссылка;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Рез = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;  
	КонецЕсли; 
	
	Если ОстаточныйПуть <> "" Тогда
		Рез = ПолучитьДочернююПапку(ОстаточныйПуть, Рез);
	КонецЕсли;

	Возврат Рез; 	
КонецФункции 



Процедура АктуализироватьМетоды(Конфигурация, Элемент, ТипМ, ТекущиеМетоды)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Методы КАК Т
		|ГДЕ
		|	Т.Конфигурация = &Конфигурация
		|	И Т.Метаданные = &Метаданные
		|	И Т.Тип = &Тип
		|	И Т.Наименование НЕ В (&Наименование)";

	Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
	Запрос.УстановитьПараметр("Метаданные", Элемент);
	Запрос.УстановитьПараметр("Тип", ТипМ);
	Запрос.УстановитьПараметр("Наименование", ТекущиеМетоды);

	РезультатЗапроса = Запрос.Выполнить(); 
		
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СсылкаЭл = ВыборкаДетальныеЗаписи.Ссылка;
			Эл = СсылкаЭл.ПолучитьОбъект();
			Эл.Удалить();
		КонецЦикла;
	КонецЕсли;

		
КонецПроцедуры

Процедура ОбъектыМетаданныхМетоды() Экспорт
	
	Итерация = Константы.ИтерацияЗагрузкиРеестраПроцедур.Получить(); 	
	Если Итерация = 0 Тогда
		ПоискФайловBSL();
		ЗаполнитьСодержимоеФайловBSL();
		ЭаполнитьЭлементыКонфигурации();
		ЗаполнитьМетоды();
		ЗаполнитьВызовы();
	ИначеЕсли Итерация = 1 Тогда
		ЗаполнитьСодержимоеФайловBSL();
		ЭаполнитьЭлементыКонфигурации();
		ЗаполнитьМетоды();
		ЗаполнитьВызовы();
	ИначеЕсли Итерация = 2 Тогда
		ЭаполнитьЭлементыКонфигурации();
		ЗаполнитьМетоды();
		ЗаполнитьВызовы();
	ИначеЕсли Итерация = 3 Тогда
		ЗаполнитьМетоды();
		ЗаполнитьВызовы();
	ИначеЕсли Итерация = 4 Тогда
		ЗаполнитьВызовы();
	//ИначеЕсли Иттерация = 1 Тогда
	КонецЕсли;

КонецПроцедуры