
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Ключ можно устанавливать разный в зависимости от того, какие настройки нужны
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);
	
	Параметры.Свойство("ЗакрыватьЕслиНеВФокусе", ЗакрыватьЕслиНеВФокусе);
	
	Если ТипЗнч(Параметры.ПоказатьЗначение) = Тип("СписокЗначений") Тогда
		Для каждого Значение Из  Параметры.ПоказатьЗначение Цикл
			ЗначениеСтрока = ЗначениеСтрока + Значение + Символы.ПС;
		КонецЦикла;
		Если Прав(ЗначениеСтрока, 1) = Символы.ПС Тогда
			ЗначениеСтрока = Лев(ЗначениеСтрока, СтрДлина(ЗначениеСтрока) - 1);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметры.ПоказатьЗначение) = Тип("Массив") Тогда //массив структур из таблицы значений
		КлючСохраненияПоложенияОкна = "ТаблицаЗначений";
		
		Элементы.ТаблицаЗначений.Видимость = Истина;
		Элементы.ЗначениеСтрока.Видимость = Ложь;

		МассивРеквизитов = Новый Массив;		
		
		Для каждого Эл Из Параметры.ПоказатьЗначение[0] Цикл
			
			ИмяПоля = Эл.Ключ;
			
			ОписаниеТипов = Новый ОписаниеТипов("Строка");
			СоздатьРеквизит("ТаблицаЗначений" + ИмяПоля, ОписаниеТипов);  
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяПоля, ОписаниеТипов, "ТаблицаЗначений"));
			
		КонецЦикла;
		
		ИзменитьРеквизиты(МассивРеквизитов);
		
		Для каждого Эл Из Параметры.ПоказатьЗначение[0] Цикл
			ИмяПоля = Эл.Ключ;	
			НовыйЭлемент  = Элементы.Добавить("ТаблицаЗначений" + ИмяПоля, Тип("ПолеФормы"), Элементы.ТаблицаЗначений);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным = "ТаблицаЗначений." + ИмяПоля;
		КонецЦикла;
		
		Для каждого Эл Из  Параметры.ПоказатьЗначение Цикл
			НоваяСтрока = ТаблицаЗначений.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Эл);
		КонецЦикла;
		
		
	Иначе
		ЗначениеСтрока = Параметры.ПоказатьЗначение;
		Параметры.Свойство("РазрешитьРедактирование", РазрешитьРедактирование);
		Элементы.ЗначениеСтрока.ТолькоПросмотр = Не РазрешитьРедактирование;
	КонецЕсли;
	
	
	Если ТипЗнч(Параметры.ПоказатьЗначение) = Тип("СписокЗначений") Или ТипЗнч(Параметры.ПоказатьЗначение) = Тип("Строка") Тогда
		
		КоличествоСтрок = СтрЧислоСтрок(ЗначениеСтрока);
		
		ШиринаСтроки = 1;
		Для Счетчик = 1 По КоличествоСтрок  Цикл
			
			ТекСтрока = СтрПолучитьСтроку(ЗначениеСтрока, Счетчик);
			ДлинаСтроки = СтрДлина(ТекСтрока);
			Если ДлинаСтроки >= ШиринаСтроки Тогда
				СамаяДлиннаяСтрока = ТекСтрока;
			КонецЕсли;		
			ШиринаСтроки = Макс(ШиринаСтроки, ДлинаСтроки);
		КонецЦикла;
		
		ШиринаСтроки = Макс(55, ШиринаСтроки);
		
		//!!!
		МаксимальноеКоличествоСтрок = 20;
		ТребуемаяВысота = Мин(МаксимальноеКоличествоСтрок, КоличествоСтрок + 10);
		
		Если ЭтаФорма.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет Тогда
			ЭтаФорма.Высота = ТребуемаяВысота;
		Иначе
			ЭтаФорма.Высота = ТребуемаяВысота + 2; 
		КонецЕсли; 
		
		
		//!!! не больше 30 , желательно проверить
		ВысотаМСтроки = Макс(3, КоличествоСтрок + 2);
		ВысотаМСтроки = Мин(30, ВысотаМСтроки);
		Элементы.ЗначениеСтрока.Высота = ВысотаМСтроки;
		
		
		//УдалитьНастройкуРазмераИПоложенияФормы();
		
		ЭтаФорма.Ширина = Окр(ШиринаСтроки / 1.25, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийЭлемент = Элементы.ЗначениеСтрока;
	
	ПодключитьОбработчикОжидания("ЗакрытьОкноНеВФокусе", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОкноНеВФокусе() Экспорт 
	
	Если Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если Открыта() И ЗакрыватьЕслиНеВФокусе = Ложь Тогда
		ЗакрыватьЕслиНеВФокусе = Истина;
	КонецЕсли;
	
	Если ВводДоступен() = Ложь И ЗакрыватьЕслиНеВФокусе Тогда
		Окна = ПолучитьОкна();
		
		Для каждого выбОкно Из Окна Цикл
			Если выбОкно.Заголовок = "Поиск" Тогда
				ПодключитьОбработчикОжидания("ЗакрытьОкноНеВФокусе", 0.3, Истина);
				Возврат;
			КонецЕсли;
		КонецЦикла;
		
		//ОтключитьОбработчикОжидания("ЗакрытьОкноНеВФокусе");
		Закрыть(ЗначениеСтрока);
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ЗакрытьОкноНеВФокусе", 0.3, Истина);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьРеквизит(ИмяРеквизита,ОписаниеТипа) Экспорт
	
	структураРеквизитов = Новый Структура;
	структураРеквизитов.Вставить(ИмяРеквизита,ОписаниеТипа);
	СоздатьРеквизиты(структураРеквизитов); 
	
КонецПроцедуры

//Если требуется создать несколько реквизитов
&НаСервере
Процедура СоздатьРеквизиты(структураРеквизитов) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	Для Каждого тРеквизит Из структураРеквизитов Цикл 
		НовыйРеквизит = Новый РеквизитФормы(тРеквизит.Ключ,тРеквизит.Значение); 
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит); 
	КонецЦикла;
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	
КонецПроцедуры

&НаСервере 
Функция ИмяОбработки() 
	
	ОбъектВЗначение = РеквизитФормыВЗначение("Объект");
	
	ИмяОбработки = СтрЗаменить(РеквизитФормыВЗначение("Объект"), "Объект.", ".");
	
	Возврат ИмяОбработки;   //вернет "ВнешняяОбработка.ДеревоПроцедурПоЗамеруПроизводительности";
	
КонецФункции

&НаСервере
Процедура УдалитьНастройкуРазмераИПоложенияФормы() 
	
	//КлючОбъекта = "Обработка.ДеревоПроцедурПоЗамеруПроизводительности";
	ИмяОбработки = ИмяОбработки();
	
	КлючОбъекта = ИмяОбработки;
	
	КлючНастроек = "ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаЗначения/Такси/НастройкиОкна";
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	УИНПользователя     = ТекущийПользователь.ИдентификаторПользователяИБ;
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИНПользователя);
	
	ИмяПользователяИБ = ПользовательИБ.Имя;
	
	//Вызов метода требует наличия права "СохранениеДанныхПользователя".
	ПривилегированныйРежим();
	
	ХранилищеСистемныхНастроек.Удалить(КлючОбъекта, КлючНастроек, ИмяПользователяИБ);	
	
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда
		ХранилищеСистемныхНастроек.Удалить("ОбщаяФорма.Вопрос", "", ИмяПользователя);
	КонецЕсли;
	КлючСохраненияПоложенияОкна = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры





&НаКлиенте
Процедура ВысотаФормыПриИзменении(Элемент)
	
	Высота = ВысотаФормы;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОкно(Команда)
	
	Закрыть(ЗначениеСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеСтрокаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Мофицированность = Истина;
	
КонецПроцедуры
