
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ХранилищеНастроек = Константы.НастройкаПочты.Получить();
	ПараметрыПочты = ХранилищеНастроек.Получить();
	Если ЗначениеЗаполнено(ПараметрыПочты) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма,ПараметрыПочты);//,"АдресСервераSMTP,АутентификацияSMTP,Отправитель,ПарольSMTP,ПользовательSMTP,Тема"
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПараметрыПочты = Новый Структура("АдресСервераSMTP,АутентификацияSMTP,Отправитель,ПарольSMTP,ПользовательSMTP,Тема");
	ЗаполнитьЗначенияСвойств(ПараметрыПочты,ЭтаФорма,"АдресСервераSMTP,АутентификацияSMTP,Отправитель,ПарольSMTP,ПользовательSMTP,Тема");
	ХранилищеНастроекПочты = Новый ХранилищеЗначения(ПараметрыПочты);
	Константы.НастройкаПочты.Установить(ХранилищеНастроекПочты);
КонецПроцедуры


