
Процедура ОбработатьПолученныеОтчетыОбОшибках() Экспорт
	МассивИдентификаторов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПолученныеОтчетыОбОшибках.Идентификатор КАК Идентификатор,
		|	ПолученныеОтчетыОбОшибках.Содержимое КАК Содержимое,
		|	ПолученныеОтчетыОбОшибках.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ПолученныеОтчетыОбОшибках КАК ПолученныеОтчетыОбОшибках";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Попытка
				ОбработатьДанныеПолученногоОтчетаОбОшибке(Выборка, МассивИдентификаторов);
			Исключение
				ТекстОшибки = "Не удалось обработать отчет об ошибке с идентификатором %1 по причине %2";
				ТекстОшибки = СтрШаблон(ТекстОшибки, Выборка.Идентификатор, ОписаниеОшибки()); 
				ДобавитьСообщение(ТекстОшибки);
			КонецПопытки;
		КонецЦикла;
		ОтправитьВJira(МассивИдентификаторов);
	
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьСообщение(ТекстСообщения)
	Сообщить(ТекстСообщения);
	ЗаписьЖурналаРегистрации("ОбработкаПолученныхОтчетовОбОшибках", 
	УровеньЖурналаРегистрации.Ошибка,,,ТекстСообщения);
КонецПроцедуры

Функция ПолучитьИнформациюИзОтчета(ДанныеОтчета)
	
	Отчет = Неопределено;
	ОтчетСтруктура = Неопределено;
	Скриншот = Неопределено;
			
	ЧтениеZip = Новый ЧтениеZipФайла(ДанныеОтчета.ОткрытьПотокДляЧтения());
	Для Каждого Элемент Из ЧтениеZip.Элементы Цикл 
		Если Элемент.Имя = "report.json" Тогда
			ПутьКПапкеReportJson = ПолучитьИмяВременногоФайла();
			ЧтениеZip.Извлечь(Элемент, ПутьКПапкеReportJson);
			
			ЧтениеТекста = Новый ЧтениеТекста(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json", КодировкаТекста.UTF8);
			Отчет = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
			
			ЧтениеJson = Новый ЧтениеJSON();
			ЧтениеJson.ОткрытьФайл(ПутьКПапкеReportJson + ПолучитьРазделительПути() + "report.json");
			ОтчетСтруктура = ПрочитатьJSON(ЧтениеJson);			
			ЧтениеJson.Закрыть();
			
			УдалитьФайлы(ПутьКПапкеReportJson);
		ИначеЕсли Элемент.Имя = "screenshot.png" Тогда
			ПутьКПапкеScreenshot = ПолучитьИмяВременногоФайла();
			ЧтениеZip.Извлечь(Элемент, ПутьКПапкеScreenshot);
			Картинка = Новый Картинка(ПутьКПапкеScreenshot + ПолучитьРазделительПути() + "screenshot.png");
			Скриншот = Новый ХранилищеЗначения(Картинка);
			УдалитьФайлы(ПутьКПапкеScreenshot);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("Report, ReportStructure, Screenshot", Отчет, ОтчетСтруктура, Скриншот); 
	
КонецФункции 

Процедура ОбработатьДанныеПолученногоОтчетаОбОшибке(ДанныеОбОтчете, МассивИдентификаторов)
	ДанныеОтчета = ДанныеОбОтчете.Содержимое.Получить(); 
	ИнформацияОтчетаСтруктура = ПолучитьИнформациюИзОтчета(ДанныеОтчета);

	СсылкаНаОтчет = Документы.ОтчетыОбОшибках.ПолучитьСсылку(ДанныеОбОтчете.Идентификатор);
	ОтчетОбОшибке = СсылкаНаОтчет.ПолучитьОбъект();
	Если ОтчетОбОшибке = Неопределено Тогда
		ОтчетОбОшибке = Документы.ОтчетыОбОшибках.СоздатьДокумент();
		ОтчетОбОшибке.УстановитьСсылкуНового(СсылкаНаОтчет);
	КонецЕсли;
	
	ОтчетОбОшибке.Дата = ДанныеОбОтчете.Дата;
	ОтчетОбОшибке.ТекстОтчета = ИнформацияОтчетаСтруктура.Report;
	ОтчетОбОшибке.Скриншот = ИнформацияОтчетаСтруктура.Screenshot;
	ОтчетОбОшибке.Записать();
	МассивИдентификаторов.Добавить(ОтчетОбОшибке.Ссылка);
	
	РегистрыСведений.ПолученныеОтчетыОбОшибках.УдалитьЗапись(ДанныеОбОтчете.Идентификатор);
	
КонецПроцедуры 

Процедура ОтправитьВJira(МассивСсылокДокументов) 
	
	ОтчетыОбОшибкахОтправлятьJira = Константы.ОтчетыОбОшибкахОтправлятьJira.Получить();  
	Если ОтчетыОбОшибкахОтправлятьJira Тогда    
		Для Каждого Ссылка Из МассивСсылокДокументов Цикл
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Т.Номер КАК Номер,
				|	Т.Дата КАК Дата,
				|	Т.ТекстОтчета КАК ТекстОтчета,
				|	Т.Скриншот КАК Скриншот
				|ИЗ
				|	Документ.ОтчетыОбОшибках КАК Т
				|ГДЕ
				|	Т.Ссылка = &Ссылка";
			РезультатЗапроса = Запрос.Выполнить();

			Если НЕ РезультатЗапроса.Пустой() Тогда
				Выборка = РезультатЗапроса.Выбрать();
				Картинка = Неопределено;
				Пока Выборка.Следующий() Цикл
					Номер = Выборка.Номер;
					Дата = Выборка.Дата;
					Ошибка = Выборка.ТекстОтчета;
					Картинка = Выборка.Скриншот.Получить();
					Картинка.Записать("C:\temp\screenshot.png"); 
					Текст =  "
				    |Скриншот:
				    |<img  src=""file:///C:\temp\screenshot.png"" />
				    |Ошибка:
				    |"; 
					Для Счетчик = 1 По СтрЧислоСтрок(Ошибка) Цикл
					    ТекСтрока = СтрПолучитьСтроку(Ошибка, Счетчик);
					    Текст = Текст + "<p>" + ТекСтрока + "</p>";
					КонецЦикла;

					ПараметрыПисьма = Новый Структура;
					//ПараметрыПисьма.Вставить("Кому", "baklanov@ks-technology.ru");
					ПараметрыПисьма.Вставить("Кому", "help@ks-technology.ru");
					ПараметрыПисьма.Вставить("Тема", "Сервис регистрации ошибок " + Номер + " от " + Дата);
					ПараметрыПисьма.Вставить("Тело", Текст);
					ПараметрыПисьма.Вставить("ТипТекста", "HTML"); 
					
					РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(
							Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты,
							ПараметрыПисьма);

				КонецЦикла;
			КонецЕсли;
		КонецЦикла;	   	   
	КонецЕсли;

КонецПроцедуры