
&НаКлиенте
Процедура ТЧ_СкриптыПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТЧ_Параметр.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСтроки",Элементы.ТЧ_Скрипты.ТекущиеДанные.КлючСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_СкриптыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.КлючСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ПараметрПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока и Элементы.ТЧ_Скрипты.ТекущиеДанные = Неопределено Тогда
		ВызватьИсключение ("Укажите строку сценария для параметра");
	КонецЕсли; 
	
	Если НоваяСтрока Тогда
       Элемент.ТекущиеДанные.КлючСтроки = Элементы.ТЧ_Скрипты.ТекущиеДанные.КлючСтроки; 
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура РеглЗаданияАктивностьПриИзменении(Элемент)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(НастройкиРЗ) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		НастройкиРЗ = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ИзменитьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
	
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(НастройкиРЗ);
	РедактированиеРасписания.Показать(Обработчик);

	
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьРегламентноеЗаданиеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиРЗ = Расписание;
	СостояниеРЗ = Строка(Расписание);
	
	ОформитьРегЗадание();
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаСервере
Процедура ОформитьРегЗадание()
		
	РеглЗадание = "не указано";
	Если Объект.РеглЗаданияАктивность и 
		ЗначениеЗаполнено(Объект.РеглЗаданияИдентификатор) и НастройкиРЗ = Неопределено Тогда
		РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Объект.РеглЗаданияИдентификатор);
		РеглЗадание = РЗ.Расписание;
		НастройкиРЗ = РЗ.Расписание;
	ИначеЕсли НастройкиРЗ<>Неопределено Тогда
		РеглЗадание = ""+НастройкиРЗ;					
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОформитьРегЗадание();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НастройкиРЗ", НастройкиРЗ);
КонецПроцедуры
