
 #Область Механизмы_Сериализации

Функция Сериализовать(ОбъектСериализации) Экспорт
	
	ДеревоВОбъектеХДТО	=	СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	мЗаписьХМЛ			=	новый ЗаписьXML;
	мЗаписьХМЛ.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(мЗаписьХМЛ,ДеревоВОбъектеХДТО);
	возврат мЗаписьХМЛ.Закрыть();
	
	
КонецФункции

Функция Десериализовать(XML_СтруктураСериализованногоОбъекта)
	
	ЧтениеХМЛ	=	Новый ЧтениеXML;
	ЧтениеХМЛ.УстановитьСтроку(XML_СтруктураСериализованногоОбъекта);
	ТЗ	=	СериализаторXDTO.ПрочитатьXML(ЧтениеХМЛ);
	ЧтениеХМЛ.Закрыть();
	
	возврат ТЗ;	
	
КонецФункции


Функция СерилизацияJSON(ЗначениеСериализации) Экспорт	
	
	//2. сериализуем массив клиентов в JSON 
	ЗаписьJSON 		= Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, ЗначениеСериализации); 
	СтрокаДляОтвета = ЗаписьJSON.Закрыть(); 
	Возврат СтрокаДляОтвета;
	
КонецФункции

Функция ДесереализацияJSON(Строка_json) Экспорт
	
	ЧтениеJSON 			= Новый ЧтениеJSON; 
	ЧтениеJSON.УстановитьСтроку(Строка_json); 
	ДанныеЗагрузки		=	ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат ДанныеЗагрузки;
	
КонецФункции


#КонецОбласти    


Функция ТЗ_В_Структуру(ТабЗначений) Экспорт 
	
	Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабЗначений);
	
	КоллекцияКолонок = ТабЗначений.колонки;	
	
	Для каждого ТекЭлемента из Результат Цикл		
		Для каждого ТекКолонки из КоллекцияКолонок Цикл
			мЗначение	=	ТекЭлемента[ТекКолонки.имя];
			Если ТипЗнч(мЗначение)	=	Тип("Строка") или
				ТипЗнч(мЗначение)	=	Тип("Дата") или 
				ТипЗнч(мЗначение)	=	Тип("Число") или 
				ТипЗнч(мЗначение)	=	Тип("Булево") Тогда
				Продолжить;
			КонецЕсли;
			ТекЭлемента[ТекКолонки.имя]	=	""+мЗначение;			
		КонецЦикла;			
	КонецЦикла;	
	
	возврат Результат;
	
КонецФункции

