
Функция ПолучитьПолноеСоответствиеСвойств() Экспорт
	
	Соответствие = Новый Соответствие();
	
	ТабДокумент = ПолучитьМакет("Макет");
	ТаблицаЗначений = ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент);
	
	Для каждого стр из ТаблицаЗначений Цикл
		Структура = новый Структура("Свойство,Синоним,Тип,Коэффициент,Комментарий",стр[1],стр[2],стр[4],стр[5],стр[6]);
		Если ЗначениеЗаполнено(Структура.Коэффициент) Тогда
			Структура.Коэффициент = Число(Структура.Коэффициент);
		Иначе
			Структура.Коэффициент = 0;
		КонецЕсли;
		Соответствие.Вставить(стр[0]+"/"+стр[3],Структура);
	КонецЦикла;

	
	Возврат Соответствие;
	
КонецФункции


Функция ПреобразоватьТабличныйДокументВТаблицуЗначений(ТабДокумент)
	ПоследняяСтрока = ТабДокумент.ВысотаТаблицы;
	ПоследняяКолонка = ТабДокумент.ШиринаТаблицы;
	ОбластьЯчеек = ТабДокумент.Область(1, 1, ПоследняяСтрока, ПоследняяКолонка);
	// Создаем описание источника данных на основании области ячеек табличного документа.
	ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьЯчеек);
	// Создаем объект для интеллектуального построения отчетов,
	// указываем источник данных и выполняем построение отчета.
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = ИсточникДанных;
	ПостроительОтчета.Выполнить();
	// Результат выгружаем в таблицу значений.
	ТабЗначений = ПостроительОтчета.Результат.Выгрузить();
	Возврат ТабЗначений
КонецФункции
