
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.ЭлементКонфигурации.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	РазобратьМетаданные_Сервер(ПараметрКоманды);	
	
КонецПроцедуры     

&НаСервере
процедура РазобратьМетаданные_Сервер(МассивСсылок)

	Справочники.ВерсииХранилища.ОбработатьВерсии_РазобратьМетаданные(МассивСсылок);
	
КонецПроцедуры

