
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ЗаполнитьРазделРазработка(Команда) 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);  
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина); 

	ОткрытьФорму("Справочник.ксРазделыКартыКомпетенций.ФормаВыбора", ПараметрыФормы,Элементы.Разработка);
	
КонецПроцедуры


&НаКлиенте
Процедура ПрограммированиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Для Каждого ВыбранныйЭлемент ИЗ ВыбранноеЗначение Цикл
		НовСтр = Объект.Разработка.Добавить();
		НовСтр.Раздел = ВыбранныйЭлемент;
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьПредметнаяОбласть(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);  
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина); 

	ОткрытьФорму("Справочник.ксРазделыКартыКомпетенций.ФормаВыбора", ПараметрыФормы,Элементы.ПредметнаяОбластьЕРП); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПредметнаяОбластьЕРПОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для Каждого ВыбранныйЭлемент ИЗ ВыбранноеЗначение Цикл
		НовСтр = Объект.ПредметнаяОбластьЕРП.Добавить();
		НовСтр.Раздел = ВыбранныйЭлемент;
	КонецЦикла;     
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОбучение(Команда) 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);  
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина); 

	ОткрытьФорму("Справочник.ксСертификатыКурсы.ФормаВыбора", ПараметрыФормы,Элементы.КурсыДипломы);  
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыДипломыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Для Каждого ВыбранныйЭлемент ИЗ ВыбранноеЗначение Цикл
		НовСтр = Объект.КурсыДипломы.Добавить();
		НовСтр.Курс = ВыбранныйЭлемент;
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти
