
Процедура ЗаписатьСоединения(ТаблицаСеансов, Кластер, ПериодЗаписи) Экспорт
	
	Для каждого ТекСтрока из ТаблицаСеансов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.connection) Тогда
			МЗ = РегистрыСведений.ксСоединения.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ,ТекСтрока); 
			МЗ.connection = Новый УникальныйИдентификатор(ТекСтрока.connection);
			МЗ.infobase = Новый УникальныйИдентификатор(ТекСтрока.infobase);
			МЗ.process = Новый УникальныйИдентификатор(ТекСтрока.process);		
			Если ТекСтрока.application = "1CV8C" Тогда
				МЗ.application = "Тонкий клиент";
			ИначеЕсли  ТекСтрока.application = "BackgroundJob" Тогда
				МЗ.application = "Фоновое задание"; 
			ИначеЕсли ТекСтрока.application = "WebClient" Тогда
				МЗ.application = "Веб-клиент";
			ИначеЕсли ТекСтрока.application = "HTTPServiceConnection" Тогда
				МЗ.application = "Соединение с HTTP-сервисом";
			ИначеЕсли ТекСтрока.application = "SrvrConsole" Тогда
				МЗ.application = "Консоль кластера"; 				 
			ИначеЕсли ТекСтрока.application = "Designer" Тогда
				МЗ.application = "Конфигуратор";  
			ИначеЕсли ТекСтрока.application = "1CV8" Тогда
				МЗ.application = "Толстый клиент";
			КонецЕсли;
	        МЗ.connectedAt = xmlЗначение(тип("дата"), ТекСтрока.connectedAt);
			МЗ.Кластер = Кластер;
			МЗ.ПериодЗаписи = ПериодЗаписи;
			МЗ.Записать();	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры
