
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСпискиТипов();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЗДокументы

&НаКлиенте
Процедура ТЗДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Новый Структура("Имя, Синоним", "Документ." + Элемент.ТекущиеДанные.Имя, Элемент.ТекущиеДанные.Синоним));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЗСправочники

&НаКлиенте
Процедура ТЗСправочникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Новый Структура("Имя, Синоним", "Справочник." + Элемент.ТекущиеДанные.Имя, Элемент.ТекущиеДанные.Синоним));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСпискиТипов()
	
	ТЗДокументы.Очистить();
	ТЗСправочники.Очистить();  
	ТЗРегистрыСведений.Очистить();
	
		
	Для Каждого мдДокументы из Метаданные.Документы Цикл
		ЗаполнитьЗначенияСвойств(ТЗДокументы.Добавить(), мдДокументы, "Имя, Синоним");
	КонецЦикла;
	
	Для Каждого мдСправочники из Метаданные.Справочники Цикл
		ЗаполнитьЗначенияСвойств(ТЗСправочники.Добавить(), мдСправочники, "Имя, Синоним");
	КонецЦикла;  
	
	Для Каждого мдРС из Метаданные.РегистрыСведений Цикл
		ЗаполнитьЗначенияСвойств(ТЗРегистрыСведений.Добавить(), мдРС, "Имя, Синоним");
	КонецЦикла;
		
	ТЗДокументы.Сортировать("Синоним");
	ТЗСправочники.Сортировать("Синоним");
	ТЗРегистрыСведений.Сортировать("Синоним");

	
КонецПроцедуры

&НаКлиенте
Процедура ТЗРегистрыСведенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Новый Структура("Имя, Синоним", "РегистрСведений." + Элемент.ТекущиеДанные.Имя, Элемент.ТекущиеДанные.Синоним));
КонецПроцедуры

#КонецОбласти
