&НаКлиенте
Перем RegExp, 
	КомОбъект, WsShell, 
	СписокРасширений, 
	ПутьКФайлуЛога, 
	ПутьКФайлуЛогаРасширения, 
	ПутьКФайлуДампРезультата,
	КоличествоПроверокДампРезультата,
	КоличествоПроверокЛогРасширения;

&НаКлиенте
Перем КолонкиДереваЛево, КолонкиТаблицыПраво;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Отладка = Истина;
	
	Если Не ЗначениеЗаполнено(РежимЗапуска) Тогда
		РежимЗапуска = "DESIGNER";	
	КонецЕсли;
	
	
	Колонки = Новый Структура();
	Колонки.Вставить("КолонкиДереваЛево",   КолонкиТаблицыСтрокой("ТаблицаЛево"));
	Колонки.Вставить("КолонкиТаблицыПраво", КолонкиТаблицыСтрокой("ТаблицаПраво"));
	
	ЗаполнитьРеквизитыДляКлиента();
	
	КаталогЭтойОбработки = КаталогЭтойОбработки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ПутьКИсполняемомуФайлу) Тогда
		ПутьКИсполняемомуФайлу = ИмяИсполняемогоФайлаКлиентаПлатформы();
	КонецЕсли;
	
	Если КлючУникальности = Неопределено Тогда
		КлючУникальности = СтрРазделить(ИмяФормы, ".", Ложь)[1] + XMLСтрока(ТекущаяДата());
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтрокаСоединенияИБ) Тогда
		Если ЭтоФайловаяБаза() Тогда
			
			КаталогИнформационнойБазы = НСтр(СтрокаСоединенияИнформационнойБазы(), "File");
			ВариантЗапуска = 3;
			СтрокаСоединенияИБ = "/F " + ВКавычки(КаталогИнформационнойБазы);
		Иначе
			
			ИмяСервера = НСтр(СтрокаСоединенияИнформационнойБазы(), "Srvr");
			ИмяИнформационнойБазы = НСтр(СтрокаСоединенияИнформационнойБазы(), "Ref");
			ВариантЗапуска = 2;
			СтрокаСоединенияИБ = "/S " + ВКавычки(ИмяСервера + "\" + ИмяИнформационнойБазы);
		КонецЕсли;
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(ВариантЗапуска) Тогда
		ВариантЗапуска = 1;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		//Пользователь = ИмяПользователя();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(РежимЗапуска) Тогда
		РежимЗапуска = "DESIGNER";
	КонецЕсли;
	
	Если ВерсияПлатформы = "" Тогда
		ОбновитьИспользуемуюВерсиюПлатформы();
	ИначеЕсли СтрНайти(ПутьКИсполняемомуФайлу, ВерсияПлатформы + ".") = 0 Тогда
		Заголовок = ВерсияПлатформы;
	КонецЕсли;
	
	
	ВыделитьКнопкуРежимаЗапуска();
	
	СформироватьСтрокуЗапуска();
	
	ПрочитатьФайлДерева();
	
	ОбновитьТаблицуРекомендуемые();
	
	Если Не ЗначениеЗаполнено(МасштабФормы) Тогда
		МасштабФормы = 100;
	КонецЕсли;
	Масштаб = МасштабФормы;
	
	ПодключитьОбработчикОжидания("РазвернутьПрежнююСтроку", 0.5, Истина); 
	
КонецПроцедуры

&НаСервере
Функция КолонкиТаблицыСтрокой(ТаблицаИмя) 
	
	Таблица = РеквизитФормыВЗначение(ТаблицаИмя);
	
	Массив = Новый Массив;
	
	Для каждого Колонка Из Таблица.Колонки Цикл
		Массив.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, ",");
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыДляКлиента() 
	
	Реквизиты = ПолучитьРеквизиты();
	
	КлючиСтруктурыРеквизита = "Заголовок, Имя, Путь, СохраняемыеДанные, ТипЗначения";
	
	РеквизитыКлиент = Новый Структура;
	Для каждого Эл Из Реквизиты Цикл
		СтруктураРеквизита = Новый Структура(КлючиСтруктурыРеквизита);
		ЗаполнитьЗначенияСвойств(СтруктураРеквизита, Эл);
		СтруктураРеквизита.ТипЗначения = Строка(Эл.ТипЗначения);
		
		РеквизитыКлиент.Вставить(Эл.Имя, СтруктураРеквизита);
		
		Если Строка(Эл.ТипЗначения) = "Таблица значений" Или Строка(Эл.ТипЗначения) = "Дерево значений" Тогда
		
			ПодчиненныеРеквизиты = ПолучитьРеквизиты(Эл.Имя);
			Для каждого Подч Из ПодчиненныеРеквизиты Цикл
				СтруктураПодчиненныхРеквизитов = Новый Структура(КлючиСтруктурыРеквизита);
				ЗаполнитьЗначенияСвойств(СтруктураПодчиненныхРеквизитов, Подч);
				
				СтруктураПодчиненныхРеквизитов.Заголовок          = Подч.Заголовок;
				СтруктураПодчиненныхРеквизитов.Имя                = Подч.Имя;
				СтруктураПодчиненныхРеквизитов.Путь               = Подч.Путь + "." + Подч.Имя;
				СтруктураПодчиненныхРеквизитов.СохраняемыеДанные  = Подч.СохраняемыеДанные;
				СтруктураПодчиненныхРеквизитов.ТипЗначения        = Строка(Подч.ТипЗначения);
				
				РеквизитыКлиент.Вставить(Эл.Имя + "__" + Подч.Имя, СтруктураПодчиненныхРеквизитов);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПрежнююСтроку() Экспорт
	
	Если ЗначениеЗаполнено(ТекущаяСтрокаЛево) И ТаблицаЛево.НайтиПоИдентификатору(ТекущаяСтрокаЛево) <> Неопределено Тогда
		Элементы.ТаблицаЛево.Развернуть(ТекущаяСтрокаЛево);
		Элементы.ТаблицаЛево.ТекущаяСтрока = ТекущаяСтрокаЛево;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьДиалогВыбораФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДиалогВыбораФайла()
	
	РасширениеФайла = "exe";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьФайлЗавершение", ЭтотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Шаблон = "Файл %1 (*.%2)|*.%2";
	Диалог.Фильтр = СтрШаблон(Шаблон, ВРег(РасширениеФайла), РасширениеФайла);
	Диалог.Каталог = КаталогФайла(ПутьКИсполняемомуФайлу);

	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Функция КаталогФайла(выбПуть) 
	
	Если Не ЗначениеЗаполнено(выбПуть) Тогда
		Возврат "";	
	КонецЕсли;
	
	Файл = Новый Файл(выбПуть);
	Если Файл.ЭтоКаталог() Тогда
		Возврат Файл.ПолноеИмя;
	КонецЕсли;
	
	Возврат Файл.Путь;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКИсполняемомуФайлу = ВыбранныеФайлы[0];
	КонецЕсли;
	СформироватьСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыСоединения(Команда)
	
	ИмяОбработки = СтрРазделить(ИмяФормы, ".", Ложь)[1];
	ИмяФормыПараметрыСоединения = "ВнешняяОбработка." + ИмяОбработки + ".Форма.ПараметрыСоединения";
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытиеФормыПараметрыСоединения", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("АутентификацияОС",          АутентификацияОС);
	ПараметрыОткрытия.Вставить("ИмяИнформационнойБазы",     ИмяИнформационнойБазы);
	ПараметрыОткрытия.Вставить("ИмяСервера",                ИмяСервера);
	ПараметрыОткрытия.Вставить("КаталогИнформационнойБазы", КаталогИнформационнойБазы);
	ПараметрыОткрытия.Вставить("Пользователь",              Пользователь);
	ПараметрыОткрытия.Вставить("Пароль",                    Пароль);
	ПараметрыОткрытия.Вставить("ВариантЗапуска",            ВариантЗапуска);
	ПараметрыОткрытия.Вставить("ИмяБазыИзСписка",           ИмяБазыИзСписка);
	ПараметрыОткрытия.Вставить("СтрокаСоединения",          СтрокаСоединения);
	
	ОткрытьФорму(ИмяФормыПараметрыСоединения, ПараметрыОткрытия, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры	

&НаКлиенте
Процедура ЗакрытиеФормыПараметрыСоединения(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	АутентификацияОС = РезультатВыполнения.АутентификацияОС;
	ИмяИнформационнойБазы = РезультатВыполнения.ИмяИнформационнойБазы;
	ИмяСервера = РезультатВыполнения.ИмяСервера;
	КаталогИнформационнойБазы = РезультатВыполнения.КаталогИнформационнойБазы;
	Пользователь = РезультатВыполнения.Пользователь;
	Пароль = РезультатВыполнения.Пароль;
	ВариантЗапуска = РезультатВыполнения.ВариантЗапуска;
	ИмяБазыИзСписка = РезультатВыполнения.ИмяБазыИзСписка;
	СтрокаСоединения = РезультатВыполнения.СтрокаСоединения;
	
	СтрокаСоединенияИБ = СтрокаСоединенияИБ();
	
	СформироватьСтрокуЗапуска();
	
	ОбновитьСписокРасширений();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РасширениеФайла(ПутьКФайлу)
	
	Файл = Новый Файл(ПутьКФайлу);
	РасширениеФайла = Файл.Расширение;
	
	Возврат РасширениеФайла;
	
КонецФункции

&НаКлиенте
Функция ИмяИсполняемогоФайлаКлиентаПлатформы() Экспорт
	
	Результат = "1cv8";
	
	Если ЭтоУчебнаяПлатформа() Тогда
		Результат = Результат + "t";
	КонецЕсли;
	
	КаталогПрограммы = ПолучитьКаталогПрограммы();
	
	Результат = КаталогПрограммы + Результат + ".exe";

	Возврат Результат;
	
КонецФункции 

&НаКлиенте
Функция ПолучитьКаталогПрограммы() 
	
	// При нескольких установленных платформах, КаталогПрограммы() может выдавать
	// неверный результат
	
	КаталогПрограммы = КаталогПрограммы();
	
	Инфо = Новый СистемнаяИнформация;
	
	Поз = СтрНайти(КаталогПрограммы, "\common\");
	
	Если Поз = 0 Тогда
		Возврат КаталогПрограммы;
	КонецЕсли;
	
	Поз = СтрНайти(КаталогПрограммы, Инфо.ВерсияПриложения);
	
	Если Поз = 0 Тогда
		Массив = СтрРазделить(КаталогПрограммы, "\", Ложь);
		Для каждого Эл Из Массив Цикл
			Если СтрНачинаетсяС(Эл, "8.3.") Тогда
				Эл = Инфо.ВерсияПриложения;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		времКаталогПрограммы = СтрСоединить(Массив, "\");
		
		Файл = Новый Файл(времКаталогПрограммы);
		Если Файл.Существует() Тогда
			КаталогПрограммы = времКаталогПрограммы;
			Возврат КаталогПрограммы;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КаталогПрограммы;
	
КонецФункции

&НаКлиенте
Функция ЭтоУчебнаяПлатформа() Экспорт 

	Если Не ЭтоФайловаяБаза() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("mxl");
	ТабДок = Новый ТабличныйДокумент;
	Попытка
		ТабДок.Записать(ВременныйФайл, ТипФайлаТабличногоДокумента.MXL7); // В учебной версии платформы это запрещено https://www.hostedredmine.com/issues/923942
	Исключение
		// Сработает при отсутствии права "Вывод" (портативный вариант) и в учебной платформе ("Ограничение используемой лицензии")
		ОписаниеОшибки = ОписаниеОшибки();
		Возврат Истина;
	КонецПопытки; 
	УдалитьФайлы(ВременныйФайл);
	Возврат Ложь;

КонецФункции

&НаКлиенте
Функция ЭтоФайловаяБаза()

	Если ВариантЗапуска = 1 Тогда       // Из списка баз
		ФайлСписка = ИмяФайлаСпискаИнфобазПользователяОС();
		выбСтрокаСоединения = ПолучитьСтрокуСоединенияИзСпискаБаз(ФайлСписка);
		
		ФайловыйКаталог = НСтр(выбСтрокаСоединения, "File");
		Результат = Не ПустаяСтрока(ФайловыйКаталог);
		Возврат Результат;
	ИначеЕсли ВариантЗапуска = 2 Тогда  // Клиент-серверный
		Возврат Ложь;
	ИначеЕсли ВариантЗапуска = 3 Тогда  // Файловый
		Возврат Истина;
	Иначе			                    // По строке соединения
		ФайловыйКаталог = НСтр(выбСтрокаСоединения, "File");
		Результат = Не ПустаяСтрока(ФайловыйКаталог);
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ИмяФайлаСпискаИнфобазПользователяОС() 
	
	Каталог = РабочийКаталогДанныхПользователя();
	AppData = Сред(Каталог, 1, СтрНайти(Каталог, "\AppData\") + 8);
	
	ИмяФайлаСписка = AppData + "Roaming\1C\1CEStart\ibases.v8i";
	Возврат ИмяФайлаСписка;

КонецФункции

&НаКлиенте
Функция ПолучитьСтрокуСоединенияИзСпискаБаз(ФайлСпискаБаз)
 
	Файл = Новый Файл(ФайлСпискаБаз);
	ДобавленныеСтроки = Новый Массив;
	Если Не Файл.Существует() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ФайлСпискаБаз);
	
	СписокБаз = ТекстовыйДокумент.ПолучитьТекст();
	
	врем = СтрЗаменить(СписокБаз, "[", "^[");
	
	МассивОписаний = СтрРазделить(врем, "^", Ложь);
	Для каждого Эл Из МассивОписаний Цикл
		Если СтрНайти(Эл, "[" + ИмяБазыИзСписка + "]") > 0 Тогда
			ОписаниеБазы = Эл;
		КонецЕсли;
	КонецЦикла;
	
	СписокПараметров = СтрРазделить(ОписаниеБазы, Символы.ПС, Ложь);
	
	Для каждого Эл Из СписокПараметров Цикл
		Если ВРег(Лев(Эл, 8)) = "CONNECT=" Тогда
			выбСтрокаСоединения = Сред(Эл, 9);
			Возврат выбСтрокаСоединения;
		КонецЕсли;
	КонецЦикла;	
		
	Возврат "";
	
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьСтрокуСоединения() 
	
	
	
КонецПроцедуры

&НаКлиенте
Функция СтрокаСоединенияИБ() 
	
	Квч = Символ(34);	
	
	Если ВариантЗапуска = 0 Тогда
		ВариантЗапуска = 1;
		Стр = "/IBName " + ВКавычки(ИмяБазыИзСписка);
	ИначеЕсли ВариантЗапуска = 1 Тогда
		Стр = "/IBName " + ВКавычки(ИмяБазыИзСписка);
	ИначеЕсли ВариантЗапуска = 2 Тогда
		Стр = "/S " + ВКавычки(ИмяСервера + "\" + ИмяИнформационнойБазы);
	ИначеЕсли ВариантЗапуска = 3 Тогда
		Стр = "/F " + ВКавычки(КаталогИнформационнойБазы);
	ИначеЕсли ВариантЗапуска = 4 Тогда
		Стр = "/IBConnectionString " + ВКавычки(СтрокаСоединения);
	КонецЕсли;
	
	Если АутентификацияОС = Истина Тогда
		Стр = Стр + " /WA+";	
	Иначе
		
		Если ЗначениеЗаполнено(Пользователь) Тогда
			Стр = Стр + " /N " + ВКавычки(Пользователь);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Пароль) Тогда
			Стр = Стр + " /P ""Пароль скрыт""";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВКавычки(Знач Текст) 
	
	Квч = Символ(34);	
	
	Текст = СтрЗаменить(Текст, Квч + Квч, "@%Квч2%@");
	
	Текст = СтрЗаменить(Текст, Квч, Квч + Квч);
	
	Текст = СтрЗаменить(Текст, "@%Квч2%@", Квч + Квч + Квч + Квч);
	
	Возврат Квч + Текст + Квч;
	
КонецФункции

&НаКлиенте
Процедура СформироватьСтрокуЗапуска() 
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(ВКавычки(ПутьКИсполняемомуФайлу));
	МассивПараметров.Добавить(" ");
	
	Если РежимЗапуска = "DESIGNER" Тогда

		МассивПараметров.Добавить(РежимЗапуска);
	ИначеЕсли РежимЗапуска = "ENTERPRISE" Тогда
		
		МассивПараметров.Добавить(РежимЗапуска);
	Иначе
		
		МассивПараметров.Добавить(РежимЗапуска);
	КонецЕсли;
	
	МассивПараметров.Добавить(" ");
	МассивПараметров.Добавить(СтрокаСоединенияИБ);
	МассивПараметров.Добавить(" ");
	
	Разделитель = "";
	
	Для каждого Строка Из ТаблицаПраво Цикл
		
		Параметр = СокрЛП(Строка.Параметр);
		
		
		Если СтрДлина(Параметр) > 1 Тогда
			МассивПараметров.Добавить(Разделитель);
		КонецЕсли;
		МассивПараметров.Добавить(Параметр);

		
		//////////   Значение1  //////////
		
		ЗначениеПараметра = СокрЛП(Строка.Значение0);
		
		Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			
			Если Строка.Данные.Значение0.ТипЗначения <> "Список"
				И СтрДлина(ЗначениеПараметра) > 1 И Не ЭтоЧисло(ЗначениеПараметра) Тогда
				
				НовЗначение = ВКавычки(ЗначениеПараметра);
				
			Иначе	
				НовЗначение = ЗначениеПараметра;
			КонецЕсли;
			
			СтрокаЛево = ТаблицаЛево.НайтиПоИдентификатору(Строка.КлючСвязиЛево);
			ШаблонКоманды = СтрокаЛево.ШаблонКоманды;
			Разделитель = ПолучитьРазделительЗначения(Параметр, ШаблонКоманды);
			Если Разделитель = Неопределено Тогда
				Если СтрДлина(НовЗначение) > 1 И Не ЭтоЧисло(НовЗначение) Тогда
					МассивПараметров.Добавить(НовЗначение);
				Иначе
					МассивПараметров.Добавить(" " + НовЗначение);
				КонецЕсли;
			Иначе
				МассивПараметров.Добавить(Разделитель + НовЗначение);	
			КонецЕсли;
			
		КонецЕсли;

		//////////   Значение2    /////////////
		
		ЗначениеПараметра = СокрЛП(Строка.Значение1);
		
		Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			
			Если Строка.Данные.Значение1.ТипЗначения <> "СписокВыбора"
				И СтрДлина(ЗначениеПараметра) > 1 Тогда
				
				НовЗначение = ВКавычки(ЗначениеПараметра);
			Иначе	
				НовЗначение = ЗначениеПараметра;
			КонецЕсли;
			
			МассивПараметров.Добавить(" " + НовЗначение);
			
		КонецЕсли;
		
		////////
		
		Разделитель = " ";
	КонецЦикла;
	
	ВсяСтрокаЗапускаДокумент.УстановитьФорматированнуюСтроку(Новый ФорматированнаяСтрока(МассивПараметров));
	ВсяСтрокаЗапуска = СокрЛП(СтрСоединить(МассивПараметров));
	
	ЭтоФайловаяБаза = ЭтоФайловаяБаза();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРазделительЗначения(Параметр, ШаблонКоманды) 
	
	Кавычки = Символ(34);
	
	Поз = СтрНайти(ШаблонКоманды, Параметр);
	Если Поз = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПозНачала = Поз + СтрДлина(Параметр);
	
	ПозКавычки = СтрНайти(ШаблонКоманды, Кавычки, , ПозНачала);
	ПозМеньше = СтрНайти(ШаблонКоманды, "<", , ПозНачала);
	
	Если ПозМеньше = 0 И ПозКавычки = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПозКавычки = 0 Тогда
		ПозОкончания = ПозМеньше;
	ИначеЕсли ПозМеньше = 0 Тогда
		ПозОкончания = ПозКавычки;
	Иначе
		ПозОкончания = Мин(ПозМеньше, ПозКавычки);
	КонецЕсли;

	
	Если ПозОкончания - ПозНачала = 1 Тогда
		Результат = Сред(ШаблонКоманды, ПозНачала, 1);
		Возврат Результат;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоЧисло(Знач ПроверяемоеЗначение) 
	
	Если ПроверяемоеЗначение = "0" Тогда
		Возврат Истина;
	КонецЕсли;
	
	ОписаниеЧисла = Новый ОписаниеТипов("Число");
	
	Возврат ОписаниеЧисла.ПривестиЗначение(ПроверяемоеЗначение) <> 0;
	
КонецФункции
	
&НаКлиенте
Процедура ПутьКИсполняемомуФайлуПриИзменении(Элемент)
	
	СформироватьСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаСоединенияИБПриИзменении(Элемент)
	
	СформироватьСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимЗапускаПриИзменении(Элемент)
	
	СформироватьСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьXMLФайл() 
	
	ПутьКФайлуXML = КаталогЭтойОбработки + "БазаПараметров.xml";
	
	ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.ОткрытьФайл(ПутьКФайлуXML);
	
	ПостроительDOM = Новый ПостроительDOM;
    ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	ЧтениеXML.Закрыть();
    
	
	Корень = ДокументDOM.ПервыйДочерний; 
	
	Куда = ТаблицаЛево.ПолучитьЭлементы();
	ЗаполнитьДерево(Корень.ДочерниеУзлы, Куда);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИспользуемуюВерсиюПлатформы()
	
	Соотв = Новый Соответствие;
	Соотв.Вставить("8.3.14", "ВсеПараметры_8_3_14");
	Соотв.Вставить("8.3.15", "ВсеПараметры_8_3_15");
	Соотв.Вставить("8.3.16", "ВсеПараметры_8_3_16");
	Соотв.Вставить("8.3.17", "ВсеПараметры_8_3_17");
	Соотв.Вставить("8.3.18", "ВсеПараметры_8_3_18");
	Соотв.Вставить("8.3.19", "ВсеПараметры_8_3_19");
	Соотв.Вставить("8.3.20", "ВсеПараметры_8_3_20");
	Соотв.Вставить("8.3.21", "ВсеПараметры_8_3_21");
	Соотв.Вставить("8.3.22", "ВсеПараметры_8_3_22");
	Соотв.Вставить("8.3.23", "ВсеПараметры_8_3_23");
	
	
	ВерсияПлатформы = "8.3.23";
	
	Для каждого КЗ Из Соотв Цикл
		Если СтрНайти(ПутьКИсполняемомуФайлу, КЗ.Ключ + ".") > 0 Тогда
			ВерсияПлатформы = КЗ.Ключ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ВерсияПлатформы.Заголовок = "Версия платформы " + ВерсияПлатформы;
	
КонецПроцедуры


&НаСервере
Процедура ПрочитатьФайлДерева() 
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ИмяМакета = "ВсеПараметры_" + СтрЗаменить(ВерсияПлатформы, ".", "_");
	Макет = ОбъектОбработки.ПолучитьМакет(ИмяМакета);
	
	Текст = Макет.ПолучитьТекст();
	
	ЗаполнитьДеревоИзСтрокиВнутр(Текст);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоИзСтрокиВнутр(СтрокаВнутр) 
	
	ТаблицаЛево.ПолучитьЭлементы().Очистить();
	ПредДерево = РеквизитФормыВЗначение("ТаблицаЛево");
	
	НовДерево = ЗначениеИзСтрокиВнутр(СтрокаВнутр);
	
	КопироватьДерево(ПредДерево.Строки, НовДерево.Строки);
	
	ЗначениеВРеквизитФормы(ПредДерево, "ТаблицаЛево");
	
КонецПроцедуры

&НаСервере
Процедура КопироватьДерево(Получатель, Отправитель) 
	
	Для каждого Эл Из Отправитель  Цикл
		ПолучательСтрока = Получатель.Добавить();
		ЗаполнитьЗначенияСвойств(ПолучательСтрока, Эл);
		
		Если Эл.Строки.Количество() > 0 Тогда
			КопироватьДерево(ПолучательСтрока.Строки, Эл.Строки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПутьКФайлуОбработки() 
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	Возврат ОбъектОбработки.ИспользуемоеИмяФайла;
	
КонецФункции

&НаСервере
Функция КаталогЭтойОбработки() 
	
	ПутьКФайлуОбработки = ПутьКФайлуОбработки();
	
	Файл = Новый Файл(ПутьКФайлуОбработки);
	
	Возврат Файл.Путь;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСтруктуруЭлементов(Элемент) 
	
	Структура = Новый Структура();
	
	Для каждого Свойство Из Элемент.ДочерниеУзлы Цикл
		Структура.Вставить(Свойство.ИмяУзла, Свойство.ТекстовоеСодержимое);
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтрокаДереваВСтруктуру(СтрокаДерева, Знач Колонки) 
	
	Если ТипЗнч("Колонки") = Тип("Строка") Тогда
		Колонки = СтрРазделить(Колонки, ",", Ложь);
	КонецЕсли;
	
	НовСтруктура = Новый Структура();
	Для каждого выбКолонка Из Колонки Цикл
		Значение = СтрокаДерева[выбКолонка];
		Если ТипЗнч(Значение) = Тип("Структура") Тогда
			Значение = СкопироватьСтруктуру(Значение);
		КонецЕсли;
		
		НовСтруктура.Вставить(выбКолонка, Значение);
	КонецЦикла;
	
	НовСтруктура.Вставить("КлючСвязиЛево", СтрокаДерева.ПолучитьИдентификатор());
	
	Возврат НовСтруктура;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СкопироватьСтруктуру(Знач Структура) 
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДерево(Коллекция, Куда) 

	Строки = Коллекция;

	Для каждого Эл Из Строки Цикл
		Если Эл.ИмяЭлемента = "Элемент" Тогда
			Строка = Куда.Добавить();
			Строка.Параметр = Эл.ПервыйДочерний.СледующийСоседний.ТекстовоеСодержимое;
			Строка.Описание = НайтиЭлементПоИмени(Эл.ДочерниеУзлы, "Представление").ТекстовоеСодержимое;
			
			Структура = Новый Структура();
			Для каждого Свойство Из Эл.ДочерниеУзлы Цикл
				Если Свойство.ИмяУзла = "Элемент" Тогда
					Продолжить;	
				КонецЕсли;
				
				Если Свойство.ИмяУзла = "СтруктураЗначенияПараметра" Тогда
					СтруктураЗначенияПараметра = ПолучитьСтруктуруЭлементов(Свойство);
					Структура.Вставить("СтруктураЗначенияПараметра", СтруктураЗначенияПараметра);
					Продолжить;
				КонецЕсли;
				
				Структура.Вставить(Свойство.ИмяУзла, Свойство.ТекстовоеСодержимое);
				
			КонецЦикла;
			Строка.Данные = Структура;
			
			ЗаполнитьДерево(Эл.ДочерниеУзлы, Строка.ПолучитьЭлементы());
		КонецЕсли;
		
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Функция НайтиЭлементы(СписокЭлементов) 
	
	Массив = Новый Массив;
	Для каждого Эл Из СписокЭлементов Цикл
		Если Эл.ИмяЭлемента = "Элемент" Тогда
			Массив.Добавить(Эл);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Функция НайтиЭлементПоИмени(СписокЭлементов, Имя) 
	
	Для каждого Эл Из СписокЭлементов Цикл
		Если Эл.ИмяЭлемента = Имя Тогда
			Возврат Эл;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаЛевоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрокаТаблицы = ТаблицаЛево.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле = Элементы.ТаблицаЛевоПараметр Тогда
		
		Структура = СтрокаДереваВСтруктуру(Элемент.ТекущиеДанные, Колонки.КолонкиДереваЛево);
		
		Если СтрокаТаблицы.ЭтоГруппа Тогда
			Возврат;
		КонецЕсли;
		
		Если ПроверитьПараметрУжеЕсть(СтрокаТаблицы.Параметр) Тогда
			Возврат;	
		КонецЕсли;
		
		Ошибки = МожноДобавитьПараметрСвойство(Структура);
		
		Если Ошибки.Количество() > 0 Тогда
			ПоказатьОшибки(Ошибки);
			Возврат;
		КонецЕсли;
		
		ПеренестиПараметрВправо(СтрокаТаблицы);
		
	ИначеЕсли Поле = Элементы.ТаблицаЛевоПредставление Тогда
		
		
		ОткрытьЗначениеВОтдельнойФорме(СтрокаТаблицы.Описание);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПараметрУжеЕсть(Параметр) 
		
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Параметр", Параметр);
	
	НайденныеСтроки = ТаблицаПраво.НайтиСтроки(СтруктураОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаЛевоПриАктивизацииСтроки(Элемент)

	ТекДанные = Элемент.ТекущиеДанные;
	
	Элементы.ОписаниеHTML.Видимость = Ложь;
	Элементы.ОписаниеТекст.Видимость = Истина;
	
	Описание = ТекДанные.Описание;
	Возврат;
	
	//!!! HTML описания пока не реализованы
	Если ТекДанные.ЭтоГруппа = Ложь Тогда
		ОписаниеHTML = ПолучитьОписаниеHTMLИзФайла(ТекДанные.Параметр);
		Возврат;
	КонецЕсли;
	
	выбОписание = ТекДанные.Описание;

	ОписаниеHTML = ПолучитьОписаниеHTML(выбОписание); 
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОписаниеHTMLИзФайла(Параметр) 
	
	Если СтрНачинаетсяС(Параметр, "/") Или СтрНачинаетсяС(Параметр, "-") Тогда
		выбПуть = КаталогЭтойОбработки + Сред(Параметр, 2) + ".htm";
	Иначе
		выбПуть = КаталогЭтойОбработки + Параметр + ".htm";
	КонецЕсли;
	
	Файл = Новый Файл(выбПуть);
	
	Если Не Файл.Существует() Тогда
		Возврат "<html><body></body></html>";
	КонецЕсли;
	
	ТД = Новый ТекстовыйДокумент;
	ТД.Прочитать(выбПуть, КодировкаТекста.UTF8);
	Текст = ТД.ПолучитьТекст();
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОписаниеHTML(выбОписание)
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ИнициализироватьRegExp();
	
	Если RegExp = Неопределено Тогда
		RegExp = Новый COMОбъект("VBScript.RegExp");
	КонецЕсли;

    RegExp.MultiLine    = Истина;
    RegExp.Global       = Ложь;   // истина — поиск по всей строке, ложь — до первого совпадения
    RegExp.IgnoreCase   = Истина;        // истина — игнорировать регистр строки при поиске

	Возврат RegExp;
	
КонецФункции

&НаКлиенте
Процедура ПеренестиПараметрВправо(СтрокаТаблицы)
	
	Данные = СтрокаТаблицы.СтруктураЗначенияПараметра;
	
		
	НоваяСтрока = ТаблицаПраво.Добавить();
	
	НоваяСтрока.КлючСвязиЛево = СтрокаТаблицы.ПолучитьИдентификатор();
	НоваяСтрока.Параметр = СтрокаТаблицы.Параметр;
	НоваяСтрока.Данные = Данные;
	
	Если Данные <> Неопределено Тогда
		Если Данные.Свойство("Значение0") Тогда
			Данные.Значение0.Свойство("ВозможноПустое", НоваяСтрока.ВозможноПустоеЗначение0);
		КонецЕсли;
		Если Данные.Свойство("Значение1") Тогда
			Данные.Значение1.Свойство("ВозможноПустое", НоваяСтрока.ВозможноПустоеЗначение1);
		КонецЕсли;
	КонецЕсли;
	
	Массив = ПолучитьПодсказкиВвода(СтрокаТаблицы);
	Для Сч = 0 По Массив.ВГраница() Цикл
		НоваяСтрока["ПодсказкаВвода" + Сч] = Массив[Сч];
	КонецЦикла;
	
	ОчиститьСообщения();

	
	ОбновитьТаблицуРекомендуемые();
	
	СортироватьПараметры();
	
	СформироватьСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Функция НайтиПараметрВДереве(Параметр, Строки = Неопределено) 
	
	Если Строки = Неопределено Тогда
		Строки = ТаблицаЛево.ПолучитьЭлементы();
		
		//ищем только в ветке своего режима
		Для каждого Строка Из Строки Цикл
			Если ВРег(РежимЗапуска) = ВРег(Строка.Параметр) Тогда
				Строки = Строка.ПолучитьЭлементы();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Строка Из Строки Цикл
		Если Строка.Параметр = Параметр Тогда
			Возврат Строка;
		КонецЕсли;
		
		Подчиненные = Строка.ПолучитьЭлементы();
		Если Подчиненные.Количество() > 0 Тогда
			выбСтрока = НайтиПараметрВДереве(Параметр, Подчиненные);
			Если выбСтрока <> Неопределено Тогда
				Возврат выбСтрока;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция НайтиПараметрВДеревеСервер(Параметр, Строки = Неопределено) 
	
	Если Строки = Неопределено Тогда
		Строки = ТаблицаЛево.ПолучитьЭлементы();
		
		//ищем только в ветке своего режима
		Для каждого Строка Из Строки Цикл
			Если ВРег(РежимЗапуска) = ВРег(Строка.Параметр) Тогда
				Строки = Строка.ПолучитьЭлементы();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Строка Из Строки Цикл
		Если Строка.Параметр = Параметр Тогда
			Возврат Строка;
		КонецЕсли;
		
		Подчиненные = Строка.ПолучитьЭлементы();
		Если Подчиненные.Количество() > 0 Тогда
			выбСтрока = НайтиПараметрВДеревеСервер(Параметр, Подчиненные);
			Если выбСтрока <> Неопределено Тогда
				Возврат выбСтрока;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПеренестиРекомендуемыйПараметр(Параметр)
	
	Если РежимЗапуска = "ENTERPRISE" Тогда
		СтрокиПоиска = НайтиЗначениеВДереве(ТаблицаЛево.ПолучитьЭлементы(), "Параметр", "ПРЕДПРИЯТИЕ");
	ИначеЕсли РежимЗапуска = "DESIGNER" Тогда
		СтрокиПоиска = НайтиЗначениеВДереве(ТаблицаЛево.ПолучитьЭлементы(), "Параметр", "КОНФИГУРАТОР");
	ИначеЕсли РежимЗапуска = "CREATEINFOBASE" Тогда
			СтрокиПоиска = НайтиЗначениеВДереве(ТаблицаЛево.ПолучитьЭлементы(), "Параметр", "СОЗДАНИЕ БД");
	КонецЕсли;
		
	СтрокаТаблицы = НайтиПараметрВДереве(Параметр, СтрокиПоиска);
	
	Если СтрокаТаблицы = Неопределено Тогда
		СтрокаТаблицы = НайтиПараметрВДереве(Параметр); //сначала в своем разделе, если не нашли, то по всему дереву
	КонецЕсли;
	
	
	Данные = СтрокаТаблицы.СтруктураЗначенияПараметра;
	
	
	Если СтрокаТаблицы.ЭтоГруппа Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	
	Если ПроверитьПараметрУжеЕсть(СтрокаТаблицы.Параметр) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	НоваяСтрока = ТаблицаПраво.Добавить();
	
	НоваяСтрока.Параметр = СтрокаТаблицы.Параметр;
	НоваяСтрока.Данные = Данные;
	
	Если Данные <> Неопределено Тогда
		Если Данные.Свойство("Значение0") Тогда
			Данные.Значение0.Свойство("ВозможноПустое", НоваяСтрока.ВозможноПустоеЗначение0);
		КонецЕсли;
		
	КонецЕсли;
	
	Массив = ПолучитьПодсказкиВвода(СтрокаТаблицы);
	Для Сч = 0 По Массив.ВГраница() Цикл
		НоваяСтрока["ПодсказкаВвода" + Сч] = Массив[Сч];
	КонецЦикла;
	
	
	НоваяСтрока.КлючСвязиЛево = СтрокаТаблицы.ПолучитьИдентификатор();
	
	ОбновитьТаблицуРекомендуемые();
	
	СформироватьСтрокуЗапуска();
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаменитьСпецСимволы(Знач Строка) 
	
	Тире = Символ(8209);
	
	Строка = СтрЗаменить(Строка, Тире, "-");
	
	Возврат Строка;
	
КонецФункции

&НаКлиенте
Функция ПоискРегулярногоВыражения(Строка, Шаблон, ТолькоПервый = Истина) 
	
	ИнициализироватьRegExp();
	
	Glob = RegExp.Global;
	
	RegExp.Pattern = Шаблон;
	RegExp.Global = Не ТолькоПервый;
	
	Результаты = RegExp.Execute(Строка);
	
	
	RegExp.Global = Glob;

						
	Структура = Новый Структура("Количество, Результаты");
	Структура.Количество = Результаты.Count;
	Структура.Результаты = Новый Структура();
	Сч = 0;
	Для каждого Результат Из Результаты Цикл
		Стру = Новый Структура("Значение, КоличествоПодчиненных, Подчиненные");
		Стру.Значение = Результат.Value;
		Стру.КоличествоПодчиненных = Результат.Submatches.Count;
		
		Стру.Подчиненные = Новый Структура("Значение");
		Сч2 = 0;
		Для каждого Подчиненный Из Результат.Submatches Цикл
			Стру.Подчиненные.Вставить("Подчиненный" + XMLСтрока(Сч2), Подчиненный);
			Сч2 = Сч2 + 1;
		КонецЦикла;
		
		Структура.Результаты.Вставить("Результат" + XMLСтрока(Сч), Стру);
		
		Сч = Сч + 1;
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПодсказкиВвода(СтрокаТаблицы) 
	
	МассивПодсказок = Новый Массив;
	СодержитЗначение = Ложь;
	
	Если СтрокаТаблицы.СтруктураЗначенияПараметра = Неопределено Тогда
		Возврат МассивПодсказок;
	КонецЕсли;
	
	Если ДанныеСодержатЗначения(СтрокаТаблицы.СтруктураЗначенияПараметра) = Ложь Тогда
		Возврат МассивПодсказок;
	КонецЕсли;
	
	
	
	СтрокаГдеИскать = СтрокаТаблицы.ШаблонКоманды;
	Если Не ЗначениеЗаполнено(СтрокаГдеИскать) Тогда
		ВызватьИсключение("Не заполнен шаблон команды");
	КонецЕсли;
	
	ПараметрГдеИскать = СтрокаТаблицы.Параметр;
	
	СтрокаГдеИскать = СтрЗаменить(СтрокаГдеИскать, "<", "*<");
	СтрокаГдеИскать = СтрЗаменить(СтрокаГдеИскать, ">", ">*");
	Массив = СтрРазделить(СтрокаГдеИскать, "*[]=" + Символ(34));
	Для Сч = 0 По Массив.ВГраница() Цикл
		Массив[Сч] = СокрЛП(Массив[Сч]);
	КонецЦикла;
	
	ИндексПараметра = Массив.Найти(ПараметрГдеИскать);
	
	Для Сч = ИндексПараметра + 1 По Массив.ВГраница() Цикл
		Строка = Массив[Сч];
		
		Если СокрЛП(Строка) = ""  Тогда
			Продолжить;
		КонецЕсли;
		
		Если Лев(Строка, 1) <> "<" Тогда
			Прервать;
		КонецЕсли;
		
		МассивПодсказок.Добавить(Строка);
	КонецЦикла;
	
	Если МассивПодсказок.Количество() > 0 Тогда
		Возврат МассивПодсказок;		
	КонецЕсли;
	
	
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("ДиалогОткрытие",      "<имя файла>");
	Соответствие.Вставить("ДиалогСохранение",    "<имя файла>");
	Соответствие.Вставить("ДиалогВыборКаталога", "<имя каталога>");
	Соответствие.Вставить("Расширение",          "<имя расширения>");
	Соответствие.Вставить("Строка",              "<значение параметра>");
	
	
	Для каждого КЗ Из СтрокаТаблицы.СтруктураЗначенияПараметра Цикл
		Если КЗ.Ключ = "СодержитЗначения" Тогда
			Продолжить;
		КонецЕсли;
		
		КлючСоотв = СокрЛП(КЗ.Значение.ТипЗначения) + СокрЛП(КЗ.Значение.РежимДиалога);
		МассивПодсказок.Добавить(Соответствие[КлючСоотв]);
		
	КонецЦикла;
	
	
	Возврат МассивПодсказок;
	
КонецФункции

&НаКлиенте
Функция НайтиКонецСлова(Строка, НачальнаяПозиция = 1)
	
	Длина = СтрДлина(Строка);
	
	Если Длина = 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	СтрокаСимволов = "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЬЪЭЮЯ0123456789_ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
	ВРегСтрока = ВРЕГ(Строка);
	
	Для Сч = НачальнаяПозиция По Длина Цикл
		
		Символ = Сред(ВРегСтрока, Сч, 1);
		Если СтрНайти(СтрокаСимволов, Символ) = 0 Тогда
			Возврат Сч - 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Длина;
	
КонецФункции

&НаКлиенте
Процедура ОчиститьЭлементыУправленияПоля(выбПоле) 
	
	выбПоле.КнопкаВыбора = Ложь;
	выбПоле.КнопкаВыпадающегоСписка = Ложь;
	выбПоле.РедактированиеТекста = Ложь;
	выбПоле.СписокВыбора.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоПриАктивизацииСтроки(Элемент)
	
	СообщениеОтладки("ТаблицаПраво ПриАктивизацииСтроки");
	
	СтрокаТЧ = Элементы.ТаблицаПраво.ТекущиеДанные;
	
	Элементы.ТаблицаПраво.ЗакончитьРедактированиеСтроки(Истина);
	
	ТаблицаПравоУсловноеОформлениеСтроки(СтрокаТЧ);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРекомендуемыеУбратьТекущуюСтроку() Экспорт
	
	Элементы.ТаблицаРекомендуемые.ТекущаяСтрока = Неопределено;
	Элементы.ТаблицаРекомендуемые.ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = Элементы.ТаблицаПраво;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоУсловноеОформлениеСтроки(СтрокаТЧ)
	
	Если СтрокаТЧ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолеЗначение0 = Элементы.ТаблицаПравоЗначение0;
	
	ОчиститьЭлементыУправленияПоля(ПолеЗначение0);
	
	ПолеЗначение1 = Элементы.ТаблицаПравоЗначение1;
	
	ОчиститьЭлементыУправленияПоля(ПолеЗначение1);
		
	Если ДанныеСодержатЗначения(СтрокаТЧ.Данные) = Ложь Тогда	
		Возврат;
	КонецЕсли;
	
	Сч = 0;
	МассивЗначений = ПолучитьМассивЗначенийДанных(СтрокаТЧ.Данные);
	Для каждого КЗ Из МассивЗначений Цикл
		
		выбПолеЗначение = Элементы["ТаблицаПравоЗначение" + Сч];
		СтруктураДанных = КЗ.Значение;
		ТаблицаПравоУсловноеОформлениеПоля(выбПолеЗначение, СтруктураДанных);
		Сч = Сч + 1;
	КонецЦикла;
	
	Если МассивЗначений.Количество() > 1 Тогда
		ПолеЗначение1.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеСодержатЗначения(Данные) 
	
	Если Данные = Неопределено Или Данные.Свойство("СодержитЗначения") = Ложь Или Данные.СодержитЗначения = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Данные.Свойство("Значение0") = Ложь Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Данные.Значение0.ТипЗначения) Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ПолучитьМассивЗначенийДанных(Данные) 
	
	Массив = Новый Массив;
	
	Если Не ДанныеСодержатЗначения(Данные) Тогда
		Возврат Массив;
	КонецЕсли;
	
	Для каждого КЗ Из Данные Цикл
		Если КЗ.Ключ = "СодержитЗначения" Тогда
			Продолжить;
		КонецЕсли;
		Массив.Добавить(КЗ);	
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаПравоУсловноеОформлениеПоля(Поле, СтруктураДанных) 
	
	ТипЗначения = СтруктураДанных.ТипЗначения;
	
	
	Если ТипЗначения = "Строка" Тогда
		Поле.РедактированиеТекста = Истина;
		
	ИначеЕсли ТипЗначения = "Список" Тогда
		СписокДоступныхЗначений = СтруктураДанных.СписокВыбора;
		
		СписокВыбора = СтрРазделить(СписокДоступныхЗначений, ";", Ложь);
		
		Поле.КнопкаВыпадающегоСписка = Истина;
		Поле.СписокВыбора.ЗагрузитьЗначения(СписокВыбора); 
	ИначеЕсли Лев(ТипЗначения, 6) = "Диалог" Тогда
		Поле.КнопкаВыбора = Истина;
		Поле.РедактированиеТекста = Истина;

	ИначеЕсли ТипЗначения = "Расширения" Тогда
		Если СписокРасширений = Неопределено Тогда
			ОбновитьСписокРасширений();
		КонецЕсли;
		
		//СписокВыбора = СписокРасширений.ВыгрузитьЗначения();
		
		Поле.КнопкаВыпадающегоСписка = Истина;
		Поле.РедактированиеТекста = Истина;
		//Поле.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
		ТаблицаПравоОбновитьСписокВыбораРасширений();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Лог(Знач Текст, Дописывать = Истина) 
	
	Путь = КаталогЭтойОбработки + "log.txt";
	
	ТекстДок = Новый ТекстовыйДокумент;
	
	Если Дописывать Тогда
		Файл = Новый Файл(Путь);
		
		Если Файл.Существует() Тогда
			ТекстДок.Прочитать(Путь);
			Текст = ТекстДок.ПолучитьТекст() + Символы.ПС + XMLСтрока(ТекущаяДата()) + Символы.ПС + Текст;
		КонецЕсли;
		
	КонецЕсли;
	
	
	ТекстДок.УстановитьТекст(XMLСтрока(ТекущаяДата()) + Символы.ПС + Текст);
	ТекстДок.Записать(Путь, КодировкаТекста.ANSI);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СообщениеОтладки("ТаблицаПраво НачалоВыбора");
	
	Строка = ТаблицаПраво.НайтиПоИдентификатору(Элементы.ТаблицаПраво.ТекущаяСтрока);

	Индекс = ТаблицаПраво.Индекс(Строка);
	
	ИмяКолонки = Сред(Элемент.Имя, СтрДлина("ТаблицаПраво") + 1);
	
	Если Элемент.КнопкаВыбора = Истина Тогда
		
		РежимВыбора = РежимДиалогаВыбораФайла[Строка.Данные[ИмяКолонки].РежимДиалога];
		
		ПараметрыДиалога = Новый Структура("РежимДиалогаВыбора, НачальныйКаталог, Фильтр");
		ПараметрыДиалога.Вставить("РежимДиалогаВыбора", РежимВыбора);
		ПараметрыДиалога.Вставить("НачальныйКаталог", "");
		ПараметрыДиалога.Вставить("Фильтр", Строка.Данные[ИмяКолонки].ФильтрДиалога);
		
		ВыбратьФайлИлиКаталог("ТаблицаПраво[" + XMLСтрока(Индекс) + "]." + ИмяКолонки, ПараметрыДиалога);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокРасширений() Экспорт 
	
	СписокРасширений = Новый СписокЗначений;
	СписокРасширений.Добавить("Список расширений загружается...");
	ТаблицаПравоОбновитьСписокВыбораРасширений();
	
	ПодключитьОбработчикОжидания("ОбновитьСписокРасширенийОтложенное", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоОбновитьСписокВыбораРасширений() 
	
	Если Элементы.ТаблицаПраво.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ТаблицаПраво.ТекущиеДанные.Параметр = "-Extension" Тогда
		Элементы.ТаблицаПравоЗначение0.СписокВыбора.Очистить();
		Для каждого Расш Из СписокРасширений Цикл
			Элементы.ТаблицаПравоЗначение0.СписокВыбора.Добавить(Расш.Значение, Расш.Представление);
		КонецЦикла;
		Если СписокРасширений.Количество() = 0 Тогда
			Элементы.ТаблицаПравоЗначение0.СписокВыбора.Добавить("Нет расширений");
		КонецЕсли;
		
		Элементы.ТаблицаПраво.ЗакончитьРедактированиеСтроки(Истина);
		Элементы.ТаблицаПраво.ЗакончитьРедактированиеСтроки(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СтрокаСоединенияВедетКЭтойБазе() 
	
	СтрокаСоединенияЭтойБазы = СтрокаСоединенияИнформационнойБазы();
	
	Соотв = Новый Соответствие;
	Соотв.Вставить(1, "ПоИмениБазы");
	Соотв.Вставить(2, "КлиентСервер");
	Соотв.Вставить(3, "Файловый");
	Соотв.Вставить(4, "ПоСтрокеСоединения");
	
	Результат = Соотв[ВариантЗапуска];
	
	Если ВариантЗапуска = 1 Тогда
		ФайлСписка = ИмяФайлаСпискаИнфобазПользователяОС();
		выбСтрокаСоединения = ПолучитьСтрокуСоединенияИзСпискаБаз(ФайлСписка);
		
		Возврат ВРЕГ(СтрокаСоединенияЭтойБазы) = ВРЕГ(выбСтрокаСоединения);
	ИначеЕсли ВариантЗапуска = 2 Тогда
		Возврат ВРЕГ(СтрокаСоединенияЭтойБазы) = ВРЕГ(СтрокаСоединения);
	ИначеЕсли ВариантЗапуска = 3 Тогда
		Возврат ВРЕГ(СтрокаСоединенияЭтойБазы) = ВРЕГ(СтрокаСоединения);
	ИначеЕсли ВариантЗапуска = 4 Тогда
		Возврат СтрНайти(СтрокаСоединения, СтрокаСоединенияЭтойБазы) > 0;
	Иначе
		ВызватьИсключение("Данный вариант запуска не предусмотрен");
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьРасширенияЭтойБазыСервер() 
	
	Список = Новый СписокЗначений;
	Для каждого Расш Из РасширенияКонфигурации.Получить() Цикл
		Список.Добавить(Расш.Имя, Расш.Имя, Расш.Активно);
	КонецЦикла;
	
	Возврат Список;
	
КонецФункции

&НаКлиенте
Функция ПервоеЗначение(Коллекция) 
	
	Для каждого Эл Из Коллекция Цикл
		Возврат Эл;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПоследнееЗначение(Коллекция) 
	
	Для Сч = 1- Коллекция.Количество() По 0 Цикл
		Возврат Коллекция[-Сч];
	КонецЦикла;	
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокРасширенийОтложенное() Экспорт
	
	Если СтрокаСоединенияВедетКЭтойБазе() Тогда
		Для каждого Расш Из ПолучитьРасширенияЭтойБазыСервер() Цикл
			СписокРасширений.Добавить(Расш.Значение, Расш.Представление);
		КонецЦикла;
		Если ПервоеЗначение(СписокРасширений) <> Неопределено И ПервоеЗначение(СписокРасширений).Значение = "Список расширений загружается..." Тогда
			СписокРасширений.Удалить(0);
		КонецЕсли;
		
		ТаблицаПравоОбновитьСписокВыбораРасширений();
		Возврат;
		
	КонецЕсли;
	
	ПутьКФайлуЛогаРасширения = ПолучитьИмяВременногоФайла("txt");
	ПутьКФайлуДампРезультата = ПолучитьИмяВременногоФайла("txt");
	
	Шаблон = "%1 DESIGNER %2 /DumpDBCfgList -AllExtensions /Out %3 /DisableStartupMessages /DisableStartupDialogs /DumpResult %4";
	
	СтрокаЗапуска = СтрШаблон(Шаблон, ВКавычки(ПутьКИсполняемомуФайлу), СтрокаСоединенияИБ, ВКавычки(ПутьКФайлуЛогаРасширения), ВКавычки(ПутьКФайлуДампРезультата));
	
	СтрокаЗапуска = ПолучитьСтрокуЗапуска(СтрокаЗапуска);
	
	ОжидатьЗавершения = Ложь;
	
	Если WsShell = Неопределено Тогда
		WsShell = Новый COMОбъект("WScript.Shell");
	КонецЕсли;
	А = WsShell.Run(Строка(СтрокаЗапуска), 0, ОжидатьЗавершения);
	ПодключитьОбработчикОжидания("ПроверкаНаличияФайлаДампРезультата", 3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапускПриложенияЗавершение(КодВозврата, ДопПараметры) Экспорт
	
	Если КодВозврата <> 0 Тогда
		Возврат;
	КонецЕсли;

	Если ДопПараметры.ОжидатьЗавершения Тогда
		ПроверкаНаличияФайлаДампРезультата();
	Иначе
		ПодключитьОбработчикОжидания("ПроверкаНаличияФайлаДампРезультата", 1, Истина);
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура Завершение(РезультатВыполнения, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ФайлДоступенДляЧтения(выбПутьКФайлу)
	
	Попытка 
		А = Новый ЗаписьТекста(выбПутьКФайлу, , , Истина);
		А.Закрыть();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПроверкаНаличияФайлаДампРезультата() Экспорт 
	
	Лог("ПроверкаНаличияФайлаДампРезультата");
	ФайлДампаДоступен = ФайлДоступенДляЧтения(ПутьКФайлуДампРезультата);
	
	Если ФайлДампаДоступен <> Истина Тогда
		ПодключитьОбработчикОжидания("ПроверкаНаличияФайлаДампРезультата", 1, Истина);
		Возврат;
	КонецЕсли;
		
	ТД = Новый ТекстовыйДокумент;
		
	ДопПараметры = Новый Структура("ТекстДок, ПутьКФайлу", ТД, ПутьКФайлуДампРезультата);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЧтениеФайлаДампРезультатаЗавершение", ЭтотОбъект, ДопПараметры);
	
	ТД.НачатьЧтение(ОписаниеОповещения, ПутьКФайлуДампРезультата, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеФайлаДампРезультатаЗавершение(ДопПараметры) Экспорт
	
	ДампРезультата = ДампРезультата(ДопПараметры.ПутьКФайлу, ДопПараметры.ТекстДок);
	Лог("ЧтениеФайлаДампРезультатаЗавершение. Результат " + ДампРезультата);
	Если ДампРезультата = Истина Тогда
		ПроверкаНаличияФайлаЛогаРасширения();
	Иначе
		СписокРасширений.Очистить();
		СписокРасширений.Добавить("Не удалось получить список расширений");
		ТаблицаПравоОбновитьСписокВыбораРасширений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаНаличияФайлаЛогаРасширения() Экспорт 
	
	ФайлЛогаДоступен = ФайлДоступенДляЧтения(ПутьКФайлуЛогаРасширения);
	
	Если ФайлЛогаДоступен <> Истина Тогда
		ПодключитьОбработчикОжидания("ПроверкаНаличияФайлаЛогаРасширения", 1, Истина);
		Возврат;
	КонецЕсли;
		
	ТД = Новый ТекстовыйДокумент;
		
	ДопПараметры = Новый Структура("ТекстДок, ПутьКФайлу", ТД, ПутьКФайлуЛогаРасширения);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЧтениеФайлаЛогаРасширенияЗавершение", ЭтотОбъект, ДопПараметры);
	
	ТД.НачатьЧтение(ОписаниеОповещения, ПутьКФайлуЛогаРасширения, КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧтениеФайлаЛогаРасширенияЗавершение(ДопПараметры) Экспорт
	
	ТекстДок = ДопПараметры.ТекстДок;

	СписокРасширений.Очистить();
	Для Сч = 1 По ТекстДок.КоличествоСтрок() Цикл
		СписокРасширений.Добавить(ТекстДок.ПолучитьСтроку(Сч));
	КонецЦикла;
	Если ПервоеЗначение(СписокРасширений) <> Неопределено И ПервоеЗначение(СписокРасширений).Значение = "Список расширений загружается..." Тогда
		СписокРасширений.Удалить(0);
	КонецЕсли;
	
	
	Если Элементы.ТаблицаПраво.ТекущиеДанные <> Неопределено И Элементы.ТаблицаПраво.ТекущиеДанные.Данные.СодержитЗначения И Элементы.ТаблицаПраво.ТекущиеДанные.Данные.Значение0.ТипЗначения = "Расширения" Тогда
		Элементы.ТаблицаПравоЗначение0.СписокВыбора.ЗагрузитьЗначения(СписокРасширений.ВыгрузитьЗначения());
	КонецЕсли;
	
	Если СписокРасширений.Количество() = 0 Тогда
		Элементы.ТаблицаПравоЗначение0.СписокВыбора.Очистить();
		Элементы.ТаблицаПравоЗначение0.СписокВыбора.Добавить("Нет расширений");	
	КонецЕсли;
	
	УдалитьФайлы(ДопПараметры.ПутьКФайлу);
	
КонецПроцедуры

&НаКлиенте
Функция ДампРезультата(выбПутьКФайлу, ТекстДок = Неопределено) 
	
	Если ТекстДок = Неопределено Тогда
		
		Файл = Новый Файл(выбПутьКФайлу);
		Если Файл.Существует() = Ложь Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ТекстДок = Новый ТекстовыйДокумент;
		ТекстДок.Прочитать(выбПутьКФайлу);
		
	КонецЕсли;
	
	Текст = ТекстДок.ПолучитьТекст();
	Если СокрЛП(Текст) = "0" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ВыбратьФайлИлиКаталог(ИмяРеквизитаРезультатВыбора, ПараметрыДиалога)
	
	
	ДополнительныеПараметры = Новый Структура("ИмяРеквизитаРезультатВыбора", ИмяРеквизитаРезультатВыбора); 
	
	ПослеВыбораКаталога = Новый ОписаниеОповещения("ПослеВыбораКаталога", ЭтотОбъект, ДополнительныеПараметры);
	ДиалогВыбора = Новый ДиалогВыбораФайла(ПараметрыДиалога.РежимДиалогаВыбора);
	
	ДиалогВыбора.Каталог = СокрЛП(ПараметрыДиалога.НачальныйКаталог);
	ДиалогВыбора.Фильтр = ПараметрыДиалога.Фильтр;
	
	ДиалогВыбора.Показать(ПослеВыбораКаталога);
	
КонецПроцедуры
	
&НаКлиенте 
Процедура ПослеВыбораКаталога(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ЗначениеВыбора = ВыбранныеФайлы[0];
		
		Выполнить("" + ДополнительныеПараметры.ИмяРеквизитаРезультатВыбора + " = " + ВКавычки(ЗначениеВыбора));
		
		Элементы.ТаблицаПраво.ЗакончитьРедактированиеСтроки(Истина);
		
		СформироватьСтрокуЗапуска();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоЗначениеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СообщениеОтладки("ТаблицаПраво.Значение НачалоВыбораИзСписка");
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоПриИзменении(Элемент)
	
	СформироватьСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаИзбранное Тогда
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПредприятие(Команда)
	
	РежимЗапуска = "ENTERPRISE";
	ВыделитьКнопкуРежимаЗапуска();
	
	СформироватьСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимКонфигуратор(Команда)
	
	РежимЗапуска = "DESIGNER";

	ВыделитьКнопкуРежимаЗапуска();
	
	СформироватьСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСозданиеБазы(Команда)
	
	РежимЗапуска = "CREATEINFOBASE";
	
	ВыделитьКнопкуРежимаЗапуска();
	
	СформироватьСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьКнопкуРежимаЗапуска()
	
	Соотв = Новый Соответствие;
	Соотв.Вставить("CREATEINFOBASE", "РежимСозданиеБазы");
	Соотв.Вставить("DESIGNER",       "РежимКонфигуратор");
	Соотв.Вставить("ENTERPRISE",     "РежимПредприятие");
	
	ИмяКнопки = Соотв.Получить(РежимЗапуска);
	ЭлементКнопка = Элементы[ИмяКнопки];
	
	Для каждого Эл Из Элементы.ГруппаКнопки.ПодчиненныеЭлементы Цикл
		Шрифт = Эл.Шрифт;
		Эл.ЦветТекста = Новый Цвет;
		Эл.Шрифт   = Новый Шрифт(Шрифт, , 10, Ложь);
		Эл.Пометка = Ложь;
	КонецЦикла;
	
	
	ЭлементКнопка.ЦветТекста = Новый Цвет(0, 180, 0);
	Шрифт = ЭлементКнопка.Шрифт;
	ЭлементКнопка.Шрифт      = Новый Шрифт(Шрифт, ,10, Истина);
	ЭлементКнопка.Пометка    = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	СообщениеОтладки("ТаблицаПраво Окончание перетаскивания");
	
	Если ИсточникПеретаскивания <> ПолучательПеретаскивания Тогда
		
		Значение = ПолучитьЗначениеПеретаскивания(ПараметрыПеретаскивания.Значение);
		
		УдалитьСПодчиненными();
		ТаблицаПраво.Удалить(Значение);
		ОбновитьТаблицуРекомендуемые();
		
	КонецЕсли;
	
	СортироватьПараметры();
	СформироватьСтрокуЗапуска();
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПараметры() 
	
	СортироватьПоИдентификатору();
	
	ИдЛево = Элементы.ТаблицаЛево.ТекущаяСтрока;
	Для каждого Строка Из ТаблицаПраво Цикл
		Если Строка.КлючСвязиЛево = ИдЛево Тогда
			Элементы.ТаблицаПраво.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Функция СтрокаДереваПоПолномуПути(ПолныйПуть) 
	
	
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура СообщениеОтладки(Текст) 
	
	Если Отладка = Истина Тогда
		Сообщить(Текст);
	КонецЕсли;
	
КонецПроцедуры

// WshShell.Run(СтрокаЗапуска, СкрыватьОкно, bWaitOnReturn)
//
// Скрывать окно – является необязательным, и задает стиль окна. Параметр может принимать целые значения от 0 до 10. Согласно документации, в языке vbscript можно использовать именованные константы, но, они не всегда дают ожидаемый результат, и так как эти значения между собой повторяются, я упомянул лишь три:
//
// 0 – скрывает окно, будет виден только процесс в диспетчере задач.
// 1 – нормальный режим
// 2 – свернутый вид
// 3 – развернутый вид
//
//bWaitOnReturn – может принимать 
//   Истина – сценарий будет ожидать завершения работы запущенного приложения, и только потом перейдет к выполнению следующей строчки кода, 
//   Ложь   – будет продолжатся выполнение сценария независимо от того, завершилась работа запущенного приложения или нет
&НаКлиенте
Процедура Запустить(Команда)
	
	СтрокаЗапуска = ПолучитьСтрокуЗапуска(ВсяСтрокаЗапуска);
	
	WshShell = Новый COMОбъект("WScript.Shell");
	
	
	Если РежимЗапуска = "DESIGNER" Тогда
		ОжидатьЗавершения = -1; 			//истина
	ИначеЕсли РежимЗапуска = "ENTERPRISE" Или СтрНайти(СтрокаЗапуска, "/AgentMode") > 0 Тогда
		ОжидатьЗавершения = 0;				//ложь
	КонецЕсли;
	
	WshShell.Run(Строка(СтрокаЗапуска), 0, ОжидатьЗавершения);

	
	
	ПутьКФайлуЛога = ПутьКФайлуЛога();
	Если ЗначениеЗаполнено(ПутьКФайлуЛога) Тогда
		ТД = Новый ТекстовыйДокумент;
		
		ДополнительныеПараметры = Новый Структура("ТекстДок", ТД);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЧтенияФайлаЛога", ЭтотОбъект, ДополнительныеПараметры);
		
		ТД.НачатьЧтение(ОписаниеОповещения, ПутьКФайлуЛога, КодировкаТекста.UTF8);
		
	Иначе
		
		Если Не ВводДоступен() Тогда
			ОткрытьЗначениеВОтдельнойФорме("Выполнение команды завершено");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЧтенияФайлаЛога(Параметры) Экспорт
	
	Текст = Параметры.ТекстДок.ПолучитьТекст();
	
	ОткрытьЗначениеВОтдельнойФорме(Текст);
	
КонецПроцедуры

&НаКлиенте
Функция ПутьКФайлуЛога() 
	
	Для каждого Строка Из ТаблицаПраво Цикл
		Если Строка.Параметр = "/Out" Тогда
			Возврат Строка.Значение0;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьЗначениеВОтдельнойФорме(Элементы.ТаблицаЛево.ТекущиеДанные.Описание);
	СтандартнаяОбработка = Ложь;
	ТекущийЭлемент = Элементы.ТаблицаЛево;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначениеВОтдельнойФорме(Значение, ЗакрыватьЕслиНеВФокусе = Истина) 
	
	ИмяОбработки = СтрРазделить(ИмяФормы, ".", Ложь)[1];
	ДопПараметры = Новый Структура("ПоказатьЗначение, РазрешитьРедактирование", Значение, Ложь);
	
	РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ИДФормы = Новый УникальныйИдентификатор;
	ДополнительныеПараметры = Новый Структура();
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытиеФормыОписания", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма.ФормаЗначения", ДопПараметры, ЭтаФорма, , , , ОписаниеОповещения , РежимОткрытияОкна);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыОписания(Результат, ДополнительныеПараметры) Экспорт 
	
	ОписаниеHTML = СтрЗаменить(ОписаниеHTML, "<style>body {display: none;}</style><body>", "<body>");
	
	Элементы.ОписаниеHTML.Доступность = Истина;
	Элементы.ОписаниеТекст.ЦветТекста = WebЦвета.ТемноГрифельноСерый;
	
КонецПроцедуры

&НаКлиенте
Процедура Описание1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ОткрытьЗначениеВОтдельнойФорме(Элементы.ТаблицаЛево.ТекущиеДанные.Описание);
	СтандартнаяОбработка = Ложь;
	ТекущийЭлемент = Элементы.ТаблицаЛево;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Элементы.ТаблицаЛево.ТекущаяСтрока <> Неопределено Тогда
		ТекущаяСтрокаЛево = Элементы.ТаблицаЛево.ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОписание(Команда)
	
	Элементы.ОписаниеHTML.Доступность = Ложь;
	Элементы.ОписаниеТекст.ЦветТекста = WebЦвета.СеребристоСерый;
	
	ОткрытьЗначениеВОтдельнойФорме(Элементы.ТаблицаЛево.ТекущиеДанные.Описание);
	ТекущийЭлемент = Элементы.ТаблицаЛево;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)

	ОчиститьСообщения();
	СообщениеОтладки("ТаблицаПраво Начало перетаскивания");
	
	ИсточникПеретаскивания = Элемент.Имя;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗначениеПеретаскивания(Значение)
	
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Возврат Значение[0];
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаПравоПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	
	СообщениеОтладки("ТаблицаПраво Проверка перетаскивания");
	
	Если ИсточникПеретаскивания = "ТаблицаЛево" Тогда
		
		Значение = ПолучитьЗначениеПеретаскивания(ПараметрыПеретаскивания.Значение);
			
		Если ПроверитьПараметрУжеЕсть(Значение.Параметр) Тогда
			ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
			Возврат;
			
		КонецЕсли;
		
		
	ИначеЕсли ИсточникПеретаскивания = "ТаблицаРекомендуемые" Тогда
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение;
	ИначеЕсли ИсточникПеретаскивания = "ТаблицаПраво" Тогда
		ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение;
	КонецЕсли;
	
	ПолучательПеретаскивания = Элемент.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиПараметрИзРекомендуемых(Знач Параметр) 
	
	Параметр = СтрРазделить(Параметр, " <", Ложь)[0];
	
	СтрокаТаблицыПраво = ПеренестиРекомендуемыйПараметр(Параметр);
	
	ТаблицаПравоУсловноеОформлениеСтроки(СтрокаТаблицыПраво);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СообщениеОтладки("ТаблицаПраво Перетаскивание");
	
	Если ИсточникПеретаскивания = ПолучательПеретаскивания Тогда
		ТаблицаПраво.Удалить(Элемент.ТекущиеДанные);
		
		ОбновитьТаблицуРекомендуемые();
		Возврат;
	КонецЕсли;
	
	
	Если ИсточникПеретаскивания = "ТаблицаРекомендуемые" Тогда
		
		Значение = ПолучитьЗначениеПеретаскивания(ПараметрыПеретаскивания.Значение);
		
		
		ПеренестиПараметрИзРекомендуемых(Значение.Параметр);
		
	ИначеЕсли ИсточникПеретаскивания = "ТаблицаЛево" Тогда
		
		СтрокаЛево = ПолучитьЗначениеПеретаскивания(ПараметрыПеретаскивания.Значение);
		
		Структура = СтрокаДереваВСтруктуру(СтрокаЛево, Колонки.КолонкиДереваЛево);
		
		Ошибки = МожноДобавитьПараметрСвойство(Структура);
		
		Если Ошибки.Количество() > 0 Тогда
			ПоказатьОшибки(Ошибки);
			Возврат;
		КонецЕсли;
		
		ПеренестиПараметрВправо(СтрокаЛево);	
		
	КонецЕсли;
	
	СортироватьПараметры();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибки(Ошибки) 
	
	ОчиститьСообщения();
	
	Строка = СтрСоединить(Ошибки, Символы.ПС);
	
	ДополнительныеПараметры = Новый Структура(); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборИзМенюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	
	Список = Новый СписокЗначений;
	Для каждого Эл Из Ошибки Цикл
		
		Массив = СтрРазделить(Эл, ";", Ложь);
		Если Массив.Количество() > 1 Тогда
			//ПоказатьОповещениеПользователя(Массив[0], , Массив[1]);
			
			Список.Добавить(Массив[0],,, БиблиотекаКартинок.Информация);
			Для каждого Эл Из СтрРазделить(Массив[1], Символы.ПС, Ложь) Цикл
				Список.Добавить(Эл);
			КонецЦикла;
			ПоказатьВыборИзМеню(ОписаниеОповещения, Список, Элементы.ТаблицаЛевоПредставление);
		Иначе
			//ПоказатьОповещениеПользователя(Строка);
			Список = Новый СписокЗначений;
			Список.Добавить(Эл,,, БиблиотекаКартинок.Информация);
			ПоказатьВыборИзМеню(ОписаниеОповещения, Список, Элементы.ТаблицаЛевоПредставление);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборИзМенюЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоказатьОшибкиСервер(Ошибки)
	
	Для каждого Эл Из Ошибки Цикл
		Сообщить(Эл);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуРекомендуемые() 
	
	ТаблицаРекомендуемые.Очистить();
	
	Соотв = Новый Соответствие;
		
	Для каждого СтрокаПраво Из ТаблицаПраво Цикл
		
		СтрокаЛево = ТаблицаЛево.НайтиПоИдентификатору(СтрокаПраво.КлючСвязиЛево);
		
		РекПараметры = СтрокаЛево.РекомендуемыеПараметрыСправа;
		
		Если Не ЗначениеЗаполнено(РекПараметры) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(РекПараметры) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		СодержитЗначения = Ложь;
		РекПараметры.Свойство("СодержитЗначения", СодержитЗначения);
		
		Если СодержитЗначения <> Истина Тогда
			Продолжить;	
		КонецЕсли;
		
		Для каждого КЗ Из РекПараметры Цикл
			Если КЗ.Ключ = "СодержитЗначения" Тогда
				Продолжить;
			КонецЕсли;
			
			Если ВидимостьСоотвествуетУсловиям(КЗ.Значение.Параметр, КЗ.Значение.УсловияВидимости) = Ложь Тогда
				Продолжить;
			КонецЕсли;
			Структура = Новый Структура("Представление, УсловияВидимости", КЗ.Значение.Представление, КЗ.Значение.УсловияВидимости);
			
			Соотв.Вставить(КЗ.Значение.Параметр, Структура);
			
		КонецЦикла;
		
	КонецЦикла;	
	
	МассивУдалить = Новый Массив;
	Для каждого КЗ Из Соотв Цикл
		Парам = Лев(КЗ.Ключ, НайтиКонецСлова(КЗ.Ключ, 2));
		Для каждого Строка Из ТаблицаПраво Цикл
			Если Строка.Параметр = Парам Тогда
				МассивУдалить.Добавить(КЗ.Ключ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого Эл Из МассивУдалить Цикл
		Соотв.Удалить(Эл);
	КонецЦикла;
	
	
	Для каждого КЗ Из Соотв Цикл
		НоваяСтрока = ТаблицаРекомендуемые.Добавить();
		НоваяСтрока.Параметр = КЗ.Ключ;
		НоваяСтрока.Представление = КЗ.Значение.Представление;
		НоваяСтрока.УсловияВидимости = КЗ.Значение.УсловияВидимости;
	КонецЦикла;	
	
	Если ТаблицаРекомендуемые.Количество() > 0 Тогда
	Элементы.ДекорацияПустышка.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияПустышка.Видимость = Истина;
	КонецЕсли;
	
	Если ТаблицаРекомендуемые.Количество() = 0 Тогда
		Элементы.ГруппаРекомендуемые.Видимость = Ложь;
		Элементы.ВсяСтрокаЗапуска.Высота = 8;
		ОтключитьОбработчикОжидания("ТаблицаРекомендуемыеУбратьВыделениеСтроки");
	Иначе
		Элементы.ГруппаРекомендуемые.Видимость = Истина;
		Элементы.ВсяСтрокаЗапуска.Высота = 4;
		ПодключитьОбработчикОжидания("ТаблицаРекомендуемыеУбратьВыделениеСтроки", 1, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРекомендуемыеУбратьВыделениеСтроки() Экспорт 
	
	Если ТекущийЭлемент <> Элементы.ТаблицаРекомендуемые Тогда
		Элементы.ТаблицаРекомендуемые.ТекущаяСтрока = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВидимостьСоотвествуетУсловиям(Параметр, УсловияВидимости) 
	
	Видимость = Истина;
	
	// КОНСТАНТЫ УСЛОВИЙ ВИДИМОСТИ
	//ЭтоФайловаяБаза - реквизит формы, уже заполнена	
	//--
	
	
	
	Массив = СтрРазделить(УсловияВидимости, ";", Ложь);
	
	Для каждого Эл Из Массив Цикл
		Попытка
			Видимость = Видимость И Вычислить(Эл);
		Исключение
			Сообщить("Ошибка в условиях параметра " + Параметр + " " + Эл, СтатусСообщения.Внимание);
		КонецПопытки;
			
	КонецЦикла;
	
	Возврат Видимость;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаЛевоНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ИсточникПеретаскивания = Элемент.Имя;
	
	Ид = ПараметрыПеретаскивания.Значение[0];
	
	Строка = ТаблицаЛево.НайтиПоИдентификатору(Ид);
	
	Если Строка.ЭтоГруппа Тогда
		Выполнение = Ложь;
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКомандыПраво(Команда)
	ТаблицаПраво.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРекомендуемыеНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)

	ОчиститьСообщения();
	СообщениеОтладки("ТаблицаРекомендуемые Начало перетаскивания");
	
	ИсточникПеретаскивания = Элемент.Имя;
	
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Параметр) Тогда
		Выполнение = Ложь;
	КонецЕсли;
	
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Перемещение;
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Перемещение;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЛевоОтборИзбранногоНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ИсточникПеретаскивания = Элемент.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЛевоОтборИзбранногоПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ПолучательПеретаскивания = Элемент.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРекомендуемыеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	СообщениеОтладки("ТаблицаРекомендуемые Проверка перетаскивания");
	
	ПолучательПеретаскивания = Элемент.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЛевоПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ПолучательПеретаскивания = Элемент.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоПослеУдаления(Элемент)
	
	ОбновитьТаблицуРекомендуемые();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРекомендуемыеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПеренестиПараметрИзРекомендуемых(Элементы.ТаблицаРекомендуемые.ТекущиеДанные.Параметр);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТаблицаПравоВыполнитьВыборЗначения();	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоВыполнитьВыборЗначения() 
	
	ВыбраннаяСтрока = Элементы.ТаблицаПраво.ТекущаяСтрока;
	Поле = Элементы.ТаблицаПраво.ТекущийЭлемент;
	
	Если Поле.Имя = "ТаблицаПравоПараметр" Тогда
		Возврат;
	КонецЕсли;
	ИмяКолонки = Сред(Поле.Имя, СтрДлина("ТаблицаПраво") + 1);
	
	ИмяКолонки = Сред(Поле.Имя, СтрДлина("ТаблицаПраво") + 1);
	
	
	Строка = ТаблицаПраво.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если ДанныеСодержатЗначения(Строка.Данные) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Значение = Строка.Данные[ИмяКолонки];
	
	Если Значение.ТипЗначения = "Диалог" Тогда
		РежимДиалога = РежимДиалогаВыбораФайла[Значение.РежимДиалога];
		
		ПараметрыДиалога = Новый Структура("РежимДиалогаВыбора, НачальныйКаталог, Фильтр");
		ПараметрыДиалога.Вставить("РежимДиалогаВыбора", РежимДиалога);
		ПараметрыДиалога.Вставить("НачальныйКаталог", "");
		ПараметрыДиалога.Вставить("Фильтр", Значение.ФильтрДиалога); 
		
		ВыбратьФайлИлиКаталог("Элементы.ТаблицаПраво.ТекущиеДанные." + ИмяКолонки, ПараметрыДиалога);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СортироватьПоИдентификатору() 
	
	Строки = Новый Массив;	
	ТЗКолонки = ТаблицаПраво.Выгрузить(Строки);
	
	ТЗ_ДополнительныеПараметры = ТЗКолонки.СкопироватьКолонки();
	ТЗ_ОсновныеПараметры       = ТЗКолонки.СкопироватьКолонки();
	ТЗ_ПараметрыСоединения     = ТЗКолонки.СкопироватьКолонки();
	
	
	Для каждого Строка Из ТаблицаПраво Цикл
		СтрокаЛево = ТаблицаЛево.НайтиПоИдентификатору(Строка.КлючСвязиЛево);
		
		
		Родитель = СтрокаЛево.ПолучитьРодителя();
		РодительРодитель = Родитель.ПолучитьРодителя();
		
		Если ВГруппе(СтрокаЛево, "Вспомогательные параметры")
			Или ВГруппе(СтрокаЛево, "16. Прочие параметры") 
			Или ВГруппе(СтрокаЛево, "Прочие параметры") Тогда
			НовСтрока = ТЗ_ДополнительныеПараметры.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
		ИначеЕсли ВГруппе(СтрокаЛево, "Параметры запуска") Тогда
			НовСтрока = ТЗ_ПараметрыСоединения.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
		Иначе
			НовСтрока = ТЗ_ОсновныеПараметры.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
		КонецЕсли;
	КонецЦикла;
	
	ТЗ_ПараметрыСоединения.Сортировать("КлючСвязиЛево");
	ТЗ_ОсновныеПараметры.Сортировать("КлючСвязиЛево");
	
	// если есть параметр /UpdateDBCfg, то переместить его вниз основной таблицы с потомками
	КоличествоСмещенных = 0;
	Для Сч = 1 - ТЗ_ОсновныеПараметры.Количество() По 0 Цикл
		Индекс = -Сч;
		Строка = ТЗ_ОсновныеПараметры[Индекс];
		Родитель = ТаблицаЛево.НайтиПоИдентификатору(Строка.КлючСвязиЛево).ПолучитьРодителя();
		Если Родитель.Параметр = "/UpdateDBCfg" Или Строка.Параметр = "/UpdateDBCfg" Тогда
			ТЗ_ОсновныеПараметры.Сдвинуть(Индекс, ТЗ_ОсновныеПараметры.Количество() - Индекс - 1 - КоличествоСмещенных);
			КоличествоСмещенных = КоличествоСмещенных + 1;
		КонецЕсли;
	КонецЦикла;
	
	ТЗ_ДополнительныеПараметры.Сортировать("КлючСвязиЛево");
	
	ТаблицаПраво.Очистить();
	Для каждого Строка Из ТЗ_ПараметрыСоединения Цикл
		НовСтрока = ТаблицаПраво.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
	КонецЦикла;
	
	Для каждого Строка Из ТЗ_ОсновныеПараметры Цикл
		НовСтрока = ТаблицаПраво.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
	КонецЦикла;
	
	Для каждого Строка Из ТЗ_ДополнительныеПараметры Цикл
		НовСтрока = ТаблицаПраво.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ТаблицаСекцииПараметра(СтрокаПраво) 
	
	СтрокаЛево = ТаблицаЛево.НайтиПоИдентификатору(СтрокаПраво.КлючСвязиЛево);
	
	Родитель = СтрокаЛево.ПолучитьРодителя();
	РодительРодитель = Родитель.ПолучитьРодителя();
	
	Если СтрокаЛево.Параметр = "/@" Тогда
		Возврат "ТЗ_ОсновныеПараметры";
	ИначеЕсли Родитель.Параметр = "Вспомогательные параметры"
		Или Родитель.Параметр = "16. Прочие параметры"
		Или Родитель.Параметр = "Прочие параметры" Тогда
		Возврат "ТЗ_ДополнительныеПараметры"
	ИначеЕсли РодительРодитель <> Неопределено И РодительРодитель.Параметр = "Параметры запуска" Тогда
		Возврат "ТЗ_ПараметрыСоединения";
	Иначе
		Возврат "ТЗ_ОсновныеПараметры";
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ВГруппе(СтрокаДерева, ИмяГруппы) 
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	
	Если Родитель = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Родитель.Параметр = ИмяГруппы Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ВГруппе(Родитель, ИмяГруппы);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура МассивСокрЛП(Массив) 
	
	Для Сч = 0 По Массив.Вграница() Цикл
		Массив[Сч] = СокрЛП(Массив[Сч]);
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция СледующийПараметр(Строка) 
	
	Индекс = ТаблицаПраво.Индекс(Строка);
	
	Если Индекс = ТаблицаПраво.Количество() - 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ТаблицаПраво[Индекс + 1].Параметр;
	
КонецФункции

&НаСервере
Функция ПроверитьОбязательныеПараметры(СтрокаОбязательные) 
	
	МассивИ_ИЛИ = СтрРазделить(СтрокаОбязательные, "[]", Ложь);
	МассивИ2 = Новый Массив;
	Ошибки = Новый Массив;
	
	Для каждого ЭлИ_ИЛИ Из МассивИ_ИЛИ Цикл
		МассивИ = СтрРазделить(ЭлИ_ИЛИ, ";", Ложь);
		Для каждого ЭлИ Из МассивИ Цикл
			МассивИЛИ = СтрРазделить(ЭлИ, "|", Ложь);
			МассивСокрЛП(МассивИЛИ);
			МассивИ2.Добавить(МассивИЛИ);
		КонецЦикла;		
	КонецЦикла;
	
	
	Для каждого ЭлИ2 Из МассивИ2 Цикл
		НайденоИЛИ = Ложь;
		
		
		МассивЗначений = Новый Массив;	
		Для каждого ЭлИЛИ Из ЭлИ2 Цикл
			
			ЧастиУсловия = СтрРазделить(ЭлИЛИ, "=", Ложь);
			МассивСокрЛП(ЧастиУсловия);
			Для каждого Строка Из ТаблицаПраво Цикл
				
				
				
				Если Строка.Параметр = ЧастиУсловия[0] Тогда
					Если ЧастиУсловия.Количество() > 1 Тогда
						Если ЧастиУсловия[1] = Строка.Значение0 Или ЧастиУсловия[1] = Строка.Значение1
							Или СледующийПараметр(Строка) = ЧастиУсловия[1] Тогда
							НайденоИЛИ = Истина;
							Перейти ~ВыходИзДвойногоЦикла;
						КонецЕсли;
					Иначе
						НайденоИЛИ = Истина;
						Перейти ~ВыходИзДвойногоЦикла;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЧастиУсловия.Количество() > 1 Тогда
				Точка = Символ(9679);
				МассивЗначений.Добавить("    " + Точка + "  " + ЧастиУсловия[1]);
			Иначе
				МассивЗначений.Добавить("    " + Точка + "  " + ЧастиУсловия[0]);
			КонецЕсли;
			
		КонецЦикла;
		
		Если НайденоИЛИ = Ложь Тогда
			Если ЧастиУсловия.Количество() > 1 Тогда
				Значения = СтрСоединить(МассивЗначений, Символы.ПС);
				Если МассивЗначений.Количество() = 1 Тогда
					Значение = СтрЗаменить(Значения, "    " + Точка + "  ", ""); 
					Ошибки.Добавить("Сначала нужно добавить значение " + Значение + ";параметра " + ЧастиУсловия[0]);
				Иначе
					Ошибки.Добавить("Сначала нужно добавить одно из значений:;" + Символы.ПС + Значения + Символы.ПС + Символы.ПС + "параметра " + ЧастиУсловия[0]);
				КонецЕсли;
				
			Иначе
				Ошибки.Добавить("Сначала нужно добавить параметр: " + ЭлИЛИ);
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;	
		
		~ВыходИзДвойногоЦикла:
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

&НаСервере
Функция МожноДобавитьПараметрСвойство(СтрокаДереваЛево) 
	
	Ошибки = Новый Массив;
	
	//0. Отсутствует обязательный параметр слева
	Обязательные = СтрокаДереваЛево.ОбязательныеПараметрыСлева;
	Массив = СтрРазделить(Обязательные, ";", Ложь);
	МассивСокрЛП(Массив);
	
	Ошибки = ПроверитьОбязательныеПараметры(Обязательные);
	
	Если Ошибки.Количество() > 0 Тогда
		Возврат Ошибки;
	КонецЕсли;
	
	//1. Определить, в какую секцию попадет параметр - ПараметрыСоединения, ОсновныеПараметры, ДополнительныеПараметры
	
	Строки = Новый Массив;	
	ТЗ_Все = ТаблицаПраво.Выгрузить();
	
	ТЗ_ДополнительныеПараметры = ТЗ_Все.СкопироватьКолонки();
	ТЗ_ОсновныеПараметры       = ТЗ_Все.СкопироватьКолонки();
	ТЗ_ПараметрыСоединения     = ТЗ_Все.СкопироватьКолонки();
	
	Данные = СтрокаДереваЛево.СтруктураЗначенияПараметра;
	
	НоваяСтрока = ТЗ_Все.Добавить();
	НоваяСтрока.КлючСвязиЛево = СтрокаДереваЛево.КлючСвязиЛево;
	НоваяСтрока.Параметр = СтрокаДереваЛево.Параметр;
	НоваяСтрока.Данные = Данные;
	
	Если Данные <> Неопределено Тогда
		Если Данные.Свойство("Значение0") Тогда
			Данные.Значение0.Свойство("ВозможноПустое", НоваяСтрока.ВозможноПустоеЗначение0);
		КонецЕсли;
		Если Данные.Свойство("Значение1") Тогда
			Данные.Значение1.Свойство("ВозможноПустое", НоваяСтрока.ВозможноПустоеЗначение1);
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаСекцииПараметра = ТаблицаСекцииПараметра(НоваяСтрока);
	
	
	Массив = ПолучитьПодсказкиВвода(СтрокаДереваЛево);
	Для Сч = 0 По Массив.ВГраница() Цикл
		НоваяСтрока["ПодсказкаВвода" + Сч] = Массив[Сч];
	КонецЦикла;
	
	
	Для каждого Строка Из ТЗ_Все Цикл
		выбТаблицаСекцииПараметра = ТаблицаСекцииПараметра(Строка);
		Табл = Вычислить(выбТаблицаСекцииПараметра);
		
		НовСтрока = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
		
	КонецЦикла;
	
	
	
	
	//2. Отсортировать
	ТЗ_ПараметрыСоединения.Сортировать("КлючСвязиЛево");
	ТЗ_ОсновныеПараметры.Сортировать("КлючСвязиЛево");
	ТЗ_ДополнительныеПараметры.Сортировать("КлючСвязиЛево");
	
	
	//3. Проверить параметры из своей секции на исключающие параметры этого параметра
	ИсключающиеПараметры = СтрокаДереваЛево.ИсключающиеПараметры;
	Массив = СтрРазделить(ИсключающиеПараметры, ";", Ложь);
	
	
	Ошибки = Новый Массив;
	Для каждого Эл Из Массив Цикл

			Табл = Вычислить(ТаблицаСекцииПараметра);
			ТекОшибки = КонфликтующиеПараметрыВТаблице(Табл, СтрокаДереваЛево.Параметр, Эл);
			Для каждого Эл Из ТекОшибки Цикл
				Ошибки.Добавить(Эл);
			КонецЦикла;
					

	КонецЦикла;	
	
	Возврат Ошибки;
	
КонецФункции

&НаСервере
Функция КонфликтующиеПараметрыВТаблице(Таблица, выбПараметр, ИсключающийПараметр) 
	
	Ошибки = Новый Массив;
	
	Для каждого Строка Из Таблица Цикл
		Если Строка.Параметр = выбПараметр Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИсключающийПараметр = Строка.Параметр Тогда
			Ошибка = "Параметры " + выбПараметр + " и " + Строка.Параметр + ";не могут присутствовать одновременно";
			Ошибки.Добавить(Ошибка);
			Возврат Ошибки;
		КонецЕсли;
		
		Если ИсключающийПараметр = "[Все]" И СтрНачинаетсяС(Строка.Параметр, "/") Тогда
			Ошибка = "Параметры " + выбПараметр + " и " + Строка.Параметр + ";не могут присутствовать одновременно";
			Ошибки.Добавить(Ошибка);
			Возврат Ошибки;
		КонецЕсли;
		
			
		Если СтрНайти(ИсключающийПараметр, "=") > 0 Тогда	
			Результат = Вычислить(ИсключающийПараметр);
			Если Результат = Истина Тогда
				Ошибка = "Нельзя добавить параметр, т.к. " + ИсключающийПараметр;
				Ошибки.Добавить(Ошибка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

// Вспомогательная функция
&НаКлиенте
Функция НайтиЗначениеВДереве(Коллекция, ИмяСвойства, Значение)
	
	Массив = Новый Массив;
	
	Для каждого Строка Из Коллекция Цикл
		Если СтрНайти(Строка[ИмяСвойства], Значение) > 0 Тогда
			Массив.Добавить(Строка);
		КонецЕсли;
		Подчиненные = Строка.ПолучитьЭлементы();
		Если Подчиненные.Количество() > 0 Тогда
			МассивПодчиненных = НайтиЗначениеВДереве(Подчиненные, ИмяСвойства, Значение);
			Для каждого Эл Из МассивПодчиненных Цикл
				Массив.Добавить(Эл);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ИмяОбработки = СтрРазделить(ИмяФормы, ".", Ложь)[1];
	
	ПараметрыЗакрытия = Новый Структура("ОткрытьПослеЗакрытия, ИмяОбработки", Истина, ИмяОбработки);
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЛевоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Элемент.ЗакончитьРедактированиеСтроки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРекомендуемыеОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("ТаблицаРекомендуемыеУбратьТекущуюСтроку", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Масштаб(Команда)
	
	Если МасштабФормы = 100 Тогда
		МасштабФормы = 85;
	ИначеЕсли МасштабФормы = 85 Тогда
		МасштабФормы = 110;
	ИначеЕсли МасштабФормы = 110 Тогда
		МасштабФормы = 100;
	КонецЕсли;
	Масштаб = МасштабФормы;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоПриАктивизацииЯчейки(Элемент)
	
	Элементы.ТаблицаРекомендуемые.ТекущаяСтрока = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура КопироватьТулкитовский(Команда)
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ВсяСтрокаЗапуска);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ТекстовыйДокумент.НачатьЗапись(, ИмяВременногоФайла, КодировкаТекста.OEM, Символы.ПС);
	
	WScriptShell = Новый COMОбъект("WScript.Shell");
	
	Шаблон = "%%comspec%% /c type ""%1"" | clip & del ""%1""";
	WScriptShell.Run(СтрШаблон(Шаблон, ИмяВременногоФайла), 0, 0);
	
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьИзБуфера() Экспорт
	
	htmlfile = Новый COMОбъект("htmlfile");
	Результат =  htmlfile.ParentWindow.ClipboardData.Getdata("Text");
	htmlfile = Неопределено;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура Копировать(Команда) 
	
	ТекстКопирования = СтрЗаменить(ВсяСтрокаЗапуска, "Пароль скрыт", РасшифроватьBase64(Пароль));
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстКопирования);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	
	ДопПараметры = Новый Структура("ИмяВременногоФайла, Текст", ИмяВременногоФайла, ТекстКопирования); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ВремФайлЗаписьЗавершение", ЭтотОбъект, ДопПараметры);
	
	ТекстовыйДокумент.НачатьЗапись(ОписаниеОповещения, ИмяВременногоФайла, КодировкаТекста.ANSI, Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремФайлЗаписьЗавершение(Результат, ДопПараметры) Экспорт 
	
	WScriptShell = Новый COMОбъект("WScript.Shell");
	
	Попытка
	СтрокаЗапуска = "powershell -c Get-Content """ + ДопПараметры.ИмяВременногоФайла + """ | Set-Clipboard";
	WScriptShell.Run(СтрокаЗапуска, 0, Истина);
	Исключение
		ПоказатьОповещениеПользователя("Не удалось скопировать текст в буфер обмена");
	КонецПопытки;
	
	НачатьУдалениеФайлов(, ДопПараметры.ИмяВременногоФайла);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуЗапуска(СтрокаЗапуска) 
	
	Если СтрНайти(СтрокаЗапуска, "Пароль скрыт") > 0 Тогда
		Возврат СтрЗаменить(СтрокаЗапуска, "Пароль скрыт", РасшифроватьBase64(Пароль));
	Иначе
		Возврат СтрокаЗапуска;
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Функция РасшифроватьBase64(Строка) Экспорт
	
	Двоичные = Base64Значение(Строка);
	
    ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	Поток = Двоичные.ОткрытьПотокДляЧтения();
	
	
	ЧтениеТекста = Новый ЧтениеТекста(Поток, КодировкаТекста.UTF8);
	Стр = ЧтениеТекста.ПрочитатьСтроку();
	ЧтениеТекста.Закрыть();
	
	Поток.Закрыть();
	
    Возврат Стр;
    
КонецФункции

&НаКлиенте
Процедура КопироватьВБуфер(ТекстКопирования) 
	
	HTML = Новый COMОбъект("htmlfile");
	HTML.parentWindow.clipboardData.setData("Text", ТекстКопирования,"mytext");
	HTML = Неопределено;
	
	//Если ТекстКопирования = ПрочитатьИзБуфера() Тогда
	//	Возврат;
	//КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(ТекстКопирования);
	
	ИмяВремФайла = ПолучитьИмяВременногоФайла();
	
	ДопПараметры = Новый Структура("ИмяВремФайла, Текст", ИмяВремФайла, ТекстКопирования); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ВремФайлЗаписьЗавершение", ЭтотОбъект, ДопПараметры);
	
	ТекстовыйДокумент.НачатьЗапись(ОписаниеОповещения, ИмяВремФайла, КодировкаТекста.ANSI, Символы.ПС);
	
КонецПроцедуры

&НаКлиенте
Функция ПрочитатьИзБуфера2() 
	
	WScriptShell = Новый COMОбъект("WScript.Shell");

	ИмяВремФайла = ПолучитьИмяВременногоФайла();
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Записать(ИмяВремФайла);
	
	СтрокаЗапуска = "powershell -c Get-Clipboard | Out-File """ + ИмяВремФайла + """ -NoNewline";
	WScriptShell.Run(СтрокаЗапуска, 0, 1);

	
	ТекстовыйДокумент.Прочитать(ИмяВремФайла);
	Результат = ТекстовыйДокумент.ПолучитьТекст();
	
	НачатьУдалениеФайлов(, ИмяВремФайла);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьИзБуфера1(Команда)
	
	Текст = ПрочитатьИзБуфера2();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокРасширений1(Команда)
	ОбновитьСписокРасширений();
КонецПроцедуры

&НаКлиенте
Процедура НайтиВДереве(Команда)
	
	ТекДанные = Элементы.ТаблицаПраво.ТекущиеДанные;
	
	Элементы.ТаблицаЛево.Развернуть(ТекДанные.КлючСвязиЛево);
	Элементы.ТаблицаЛево.ТекущаяСтрока = ТекДанные.КлючСвязиЛево;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПравоПередУдалением(Элемент, Отказ)
	
	УдалитьСПодчиненными();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСПодчиненными() 
	
	Строка = Элементы.ТаблицаПраво.ТекущиеДанные;
	
	СтрокаЛево = ТаблицаЛево.НайтиПоИдентификатору(Строка.КлючСвязиЛево);
	
	Подчиненные = СтрокаЛево.ПолучитьЭлементы();
	
	МассивУдалить = Новый Массив;
	Для каждого Эл Из Подчиненные Цикл
		Для каждого СтрокаТЧ Из ТаблицаПраво Цикл
			Если Эл.ПолучитьИдентификатор() = СтрокаТЧ.КлючСвязиЛево Тогда
				МассивУдалить.Добавить(СтрокаТЧ);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого Эл Из МассивУдалить Цикл
		ТаблицаПраво.Удалить(Эл);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВерсиюПлатформы(Команда)
	
	ДополнительныеПараметры = Новый Структура(); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ВерсияПлатформыВыборИзМенюЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	Список = Новый СписокЗначений;
	Список.Добавить("8.3.14");
	Список.Добавить("8.3.15");
	Список.Добавить("8.3.16");
	Список.Добавить("8.3.17");
	Список.Добавить("8.3.18");
	Список.Добавить("8.3.19");
	Список.Добавить("8.3.20");
	Список.Добавить("8.3.21");
	Список.Добавить("8.3.22");
	Список.Добавить("8.3.23");

	ПоказатьВыборИзМеню(ОписаниеОповещения, Список, Элементы.Группа5);
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПлатформыВыборИзМенюЗавершение(ВыбранныйЭлемент, ДопПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВерсияПлатформы = ВыбранныйЭлемент;
	Элементы.ВерсияПлатформы.Заголовок = "Версия платформы " + ВерсияПлатформы;
	
	ДополнительныеПараметры = Новый Структура(); 
	ОписаниеОповещения = Новый ОписаниеОповещения("ВерсияПлатформыВопросЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПоказатьВопрос(ОписаниеОповещения, "Загрузить дерево параметров для платформы " + ВерсияПлатформы + "?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияПлатформыВопросЗавершение(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Заголовок = ВерсияПлатформы;
		//АвтоЗаголовок = Ложь;
		ПрочитатьФайлДерева();
	КонецЕсли;
	
КонецПроцедуры
